[{"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing the validity of a gay marriage study.  S1 states that a problem with the study is that most people in the country identifies as Christian. S2 states that since the specifics are unknown, questioning them would just be making up objections without factual evidence.  S1 states that questioning a study is appropriate, especially if it vilifies a group of people.  S2 contradicts, stating that the study was done professionally, stating that no one is vilifying anyone.  S1 states that the divorce rate of Christians has nothing to do with gay marriage, to which S2 states that as long as they're trying to protect marriage by keeping gays out, it's relevant.", "Natural_Summary_Text_4": "S1 feels much more clarification is needed as to how the study was conducted and who conducted it.  S1 also feels forums such as this one spend too much time attempting to make Christians look bad.  S1 also feels that divorce rates among Christians has nothing to do with the issue of gay marriage. S1 accuses S2 of being a reactionist.\r  \r  S2 believes S1 is bringing up random,factless arguments without factual information arguing the study seems to be well and professionally done.  S2 also feels that the issues are being dismissed by S1 instead of being met by providing a valid argument.  S2 believes citing the protection of the sanctity of marriage makes the study's arguments relevant by supporting their arguments.", "Natural_Summary_Text_3": "S1 is uncomfortable with the study because there isn't information on how they got the results. S1 goes on to say the study vilifies a group of people, namely Christians, and that most people in the country may identify as Christian. S1 also thinks the divorce rate of Christians has no bearing on the issue of gay marriage. S2 thinks S1 should ask questions about the study rather than just assume it is incorrect and that it isn't being used to vilify anyone. S1 thinks the results are professional and S1 is just uncomfortable with the results. S2 thinks the divorce rate of Christians is very important to the issue because Christians say they are protecting the \"sanctity\" of marriage.", "Natural_Summary_Text_2": "S1 claims that the problem with an unmentioned study is that the majority of people identify as Christian, but he also recognizes S2's argument that more details of the study would be helpful to determine whether this is actually a problem. S1 also claims that the forum tends to make Christianity look bad, and points out that the divorce rate of Christians is irrelevant to the gay marriage amendment. \r  S2 defends the unmentioned study by suggesting that S1 is unaware of the particular details of the study which could invalidate his argument. He also suggests that S1 dismissed the results of the study without trying to understand them, and that the study was in fact well done and any objections should be based on evidence.", "Natural_Summary_Text_1": "S1 argues that most people in the country might identify as Christian and that questioning a study is a very appropriate response to one that vilifies a group of people. They believe that there is a lot of attention given to trying to make Christianity look bad through generalization, irrelevant studies and misinterpretations. They believe the divorce rate of Christians has no bearing on the gay marriage amendment.\r  S2 believes that S1 is making up objections and deciding without any factual evidence. He or she believes that objections should not be hypothetical, but actual proven ones. This person thinks that dismissing results, rather than checking validity is reactionary. This person thinks it is relevant as long as people say they are protecting the sanctity of marriage."}, "Key": "1-5670_24_21__26_29_30_32_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing gay marriage.  The discussion revolves around whether or not a clergy person should have the right to refuse to marry a gay couple based on religious beliefs.  S1 believes this is alright to do while S2 does not agree.  S2 provides an example of his/her managing a restaurant asking if it would be acceptable for him to refuse to serve a boy scout based on the fact they conflict with his/her religious beliefs.  He/she also believes clergy members should not be permitted to refuse a union due to the fact the tax payers pay the salary of such people.  S1 feels forcing this issue is the equivalent to forcing a Jewish person to eat pork sandwiches.", "Natural_Summary_Text_4": "Two people are discussing equality and natural rights.  S1 states that discrimination on people for being religious and keeping people from religion infringes on natural rights, and if you are for equality for gays then you need equality for all.  S2 states that this allows people to do whatever they want and use their religious beliefs as an excuse.  To contradict, S1 states that only serious religious views are taken into account.  S2 then proposes a scenario where the only person available to perform the gay marriage ceremony is exempted based on religious beliefs, their rights won't be upholded.  S1 rebuts by stating that the proposed provision would allow someone else, and this is due to religious freedom.", "Natural_Summary_Text_3": "The issues here appears to stem from an employee citing some religious view to his/her boss indicating why they cannot perform a job duty.\r  \r  Speaker one doesn't think people should pick and choose what they want equal rights on, in this case between religion and other rights issues, that it should be all or nothing. Speaker one therefore believes that speaker two is unfairly discriminating against an employee based off their religious views.\r  \r  Speaker two believes that society dictates that you have to be biased at times. Speaker two continues that if speaker one's logic holds true, then he/she should be able to turn away customers based off his/her own personal religious views.", "Natural_Summary_Text_2": "S1 believes that religious freedom allows for people to not do something, such as serve a gay customer, that they find objective to their religion. He gives an example that Jewish people should not be forced to work on the Sabbath or eat pork. Likewise, he thinks Christians should not be required to serve gay people in a way that violates their religious beliefs. S2 believes it should be a requirement that you serve all customers and gives the example that he couldn't refuse to serve a boy scout or Christian that he doesn't agree with. He goes on to say that taxpayers and employers are the ones providing the paycheck, not God. He believes service is a requirement to express the freedom people have.", "Natural_Summary_Text_1": "S1 and S2 are discussing a seemingly pending law that would permit marriage officials to decline to conduct gay marriages if they are opposed to them on religious principals.  S1 finds it acceptable, while S2 complains about it.  S1 proposes that it is easy for S2 to be unsympathetic because S2 dislikes religion.  S1 acknowledges that he considers such religious objections to be evil.  He suggests that because the individual licensed to perform a marriage is paid or licensed by the State, the individual should reflect the will and choices of the State and therefore perform gay marriages despite his or her personal religious objection to them.  S2 suspects that the law may result in an effective denial of gay marriage."}, "Key": "1-6319_63_42__66_73_74_78_79_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two subjects are discussing a law banning gay marriage.  S2 believes the law is unjust as it segregates the gay community from that of the heterosexual community.  S1 supports the nation's ability to vote on such issues and supports the \"majority rules\" philosophy. S2 believes the courts should take individuals' into consideration and rule on each instead of as a whole.  S1 contends this idea to be incorrect citing the fact that those who believe abortion should be illegal are technically the minority and that a court would not rule on that issue individually.  S1 feels S2 and others like him/her support society's oppression of certain groups.  S1 disagrees advising he/she wants only a society free to vote on laws.", "Natural_Summary_Text_4": "Two people are discussing gay marriage laws.  S1 contends that the current system the most votes win, to which S2 contends that the laws should be decided based on looking at the individuals that are affected.  S1 states that if one wants to change the law, he must get a majority of people to do it, and the majority should not be ignored because someone objects to them.  S2 states that the courts should look at the individual lives that will be affected and decide, and that laws that a majority favors that are unjust in an individuals life must be overruled.  S1 rebuts that that goes against how the courts were designed to work.", "Natural_Summary_Text_3": "Speaker one is a heterosexual who believes that in our democratic society, the majority rules, and that this majority has so far consistently ruled again gay rights. Speaker one believes that courts should not overturn decisions based off the minority complaining and should abide by the majority, how our constitution and government was designed.\r  \r  Speaker two believes that the majority is oppressing the LGBT community and being treated as second-class citizens. The speaker believes that if a law effects an individuals' life in an unjust way, then it is courts responsibility to overrule it for the individual's sake. Speaker two believes society is oppressing people, and that if a law adversely effects even one person, it is unjust.", "Natural_Summary_Text_2": "S1 believes that the majority rules no matter what the minority thinks. He thinks this is the way the law works and that it doesn't matter how an individual feels. It matters what the majority votes on. He cites slavery as an example. If someone wants a law changed S1 thinks they should get the majority to side with them and change it. S2 thinks that S1 doesn't understand because he is heterosexual and not the one being oppressed. S2 believes that the courts should look at individuals lives and the effect of laws on everyone. He thinks if a law is unjust then it should be overturned regardless of what the majority wants. He thinks conservatives are heartless and don't care if people suffer.", "Natural_Summary_Text_1": "S1, a heterosexual, and S2, a homosexual, discuss the justness of the legislative process, majority rule, and how the latter affects individuals and the gay community.  S2 describes how the gay community is discriminated against, and posits that because laws regarding homosexuals impact them more directly than the general population, it is unfair to have a majority rule apply.  S1 accuses S2 of not understanding the legal system and proposes that S2 find majority to have legislation passed, and not look to the courts to redress the discrimination.  S1 analogizes that process to how slavery was abolished, and also analogizes the alleged oppression to the oppression that may be felt by anti-abortion advocates and child molesters as a result of majority rule."}, "Key": "1-5176_12_7__15_16_17_18_20_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing gay rights and the redefinition of marriage as it pertains to gay couples.  S1 believes the Massachusetts decision to allow for gay couples to marry is proof positive the world as a whole is changing to be more accepting of gay couples.  S2 is defending a statement he/she made in regard to the possibility that Massachusetts may at some point decide to overturn the decision to allow gay couples to marry.  S1 feels statements made by S2 indicate he/she is completely opposed to equal rights for gay couples.  S2 contends he/she is against an amendment put in place to ban gay marriage as it would be the government being overly intrusive into the lives of the public.", "Natural_Summary_Text_4": "Two people are discussing gay rights.  S1 states that the world changed when the Mass. legislature ratified a court decision for equal rights.  To him, it means that people are changing against homophobic bigotry and he contends that S2 hopes that the bigots will overturn equality.  S2 disagrees with this, stating that the court decision for equal rights is not a big change, and he only disagrees because the legislation is an over-intrusion by the government.  S1 rebuts stating that such a position means S2 favors gay marriage, to which S2 rebuts by stating that he believes that legislation favoring or banning gay marriage are both over-intrusive into people's lives by the government.", "Natural_Summary_Text_3": "Speaker one believes the world changed when Massachusetts legislature ratified a court decision for equal rights regarding homosexuals. The speaker also believes the world is not as anti-gay as it used to be. Speaker one believes that speaker two is opposed to gay marriage because speaker two does not support equal rights for homosexuals.\r  \r  Speaker two has opposed gay marriage and likely equal rights for gays in the past, but opinions that the cause of this opposition is that the speaker believes that government is over-intruding by creating legislature regarding the topic of gay marriage. Speaker two has a very conservative stance in politics and believes government should not be interfering with people's personal lives.", "Natural_Summary_Text_2": "S1 believes the world changed with the legislation in Massachusetts to allow gay marriage. He assumes that S2, having stated several times he is against gay marriage, will hope the legislation is overturned but may be out of luck. He questions if S2's opinion has changed now that gay marriage is in place in Massachusetts and if he wants it overturned. S2 resents the assumption of S1 and says that legislation to overturn the Massachusetts decision would be an over intrusion by the government. He states that he would not want an amendment to ban gay marriage and that has always been his opinion because he does not agree with over intrusion by the government. He sees this as a true conservative opinion to take.", "Natural_Summary_Text_1": "S1 and S2 are discussing a legislative action associated with a Massachusetts court ruling which is favorable to gay rights.  S1 is enthusiastic about the matter and sees it as a step in the right direction against bigotry, and a recognition that the world is not as anti-gay as it used to be, which S2 is advised to acknowledge and accept.  S1 also accuses S2 of being inconsistent in having been on the record on the website opposing gay marriage (and therefor according to S1 being opposed to equal rights for gays), but now also taking a position that the state should not intervene to ban gay marriage.  S2 defends that position and argues it is based on conservative principles against intrusions into individual lives."}, "Key": "1-6949_18_17__19_20_21_22_29_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two subjects are discussing gay marriage.  S1 believes marriage should not be handled by state or legislature but instead be dealt with on a religious level.  S2 believes the religious aspect is not what gay couples are trying to be a part of.  He/she feels gay couples are more interested in the rights and benefits heterosexual couples are afforded such as insurance and in cases where the relationships dissolve, custody and visitation.  S1 contends he/she feels not there should be a ban on gay marriage but a better system to handle the types of situations which S1 describes.  S2 believes each person should be free to marry whoever he/she chooses as despite the reasoning for the marriage, it is commitment.", "Natural_Summary_Text_4": "Two people are discussing the right to marry.  S1 states that marriage should be left to a religious institution where it would mean something.  S2 states that it is not the ceremonies that gays are looking for, it is all the civil benefits. S1 retorts that there should be a better system, that even allows single people with best friends access to the same benefits.  S2 retorts saying that gays are not single people, and single people can always get married.  S1 contradicts by saying that gay people should just marry the opposite sex, to which S2 states that gay people are seeking the right to marry a person of their choosing, not to just marry anyone for benefits.", "Natural_Summary_Text_3": "The issue here is whether government or religion should decides the principles of marriage, and who is allowed to get married.\r  \r  Speaker one believes that leaving it up to religions groups does not satisfy what gays are looking for. They are searching for the civil benefits that come with a marriage and would like to be treated equally in that respect. The speaker believes gay should be able to marry a person of their choice and get equal rights.\r  \r  Speaker two opinions that there should indeed be a better system for marriage benefits and that it is all \"single\" people that get screwed over by marriage's current stature. Speaker two believes that gay people should marry a woman if they want the same rights.", "Natural_Summary_Text_2": "S1 thinks that the government should stay out of marriage and that it should be left to religious institutions. He thinks there needs to be a better system and that single people are the ones that are harmed the most by marriage laws because they are unable to get any of the benefits that married people do even if they want them, or it is important to their situation. S2 says religious ceremonies aren't what gay people want because they already can have them via churches. They want the rights and to keep the government out would be to give up those rights. If single people want those rights they should get married, but he thinks you should be free to marry who you wish.", "Natural_Summary_Text_1": "S1 and S2 discuss the civil benefits of marriage and how they could or could not be extended to single people and gay people.  S1 is initially against government being involved in the equation, but after S2 describes many of the legal rights and benefits associated with marriage, such as automatic inheritance and hospital visitation rights, S1 is then able to relate to the issues by considering the case of his life-long bachelor uncle, suggesting that it is single people who are discriminated against by being excluded from the marriage benefits.  S2 suggests that if a single person desires the benefits of marriage, they should marry, but that they should be able to marry a person of either gender as they see fit."}, "Key": "1-6124_36_32__38_42_51_55_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 asserts that gay marriage and polygamy are commonplace in ancient Greece, Rome and China. He listed hyperlinks to the source of his assertion. He argues that marriage as a union between one man and one woman is a recent construct as compared to gay marriage.\r  S2 asserts that same-sex marriage has never been commonplace. He argues that a couple of Buddhist sects allow it. It was frowned upon in Roman times. The Greeks had homosexual liaisons, some from desire, some for a form of mentoring reasons. But those were neither marriages nor assumed to be so by those societies. Marriage is between people of opposite genders in those societies, and thus it is not a new concept.", "Natural_Summary_Text_4": "S1 bring sup historical evidence in support that homosexual marriage was conducted in the past, naming the Romans, Celts, Greeks and Native American tribes. They argue that such unions were important in the Native American tribe's culture as these individuals were seen as healers and prophets. They also point out that polygamy has been around historically as well, and argues that marriage has never been a binary union between one man and one woman.\r  S2 responds by stating that the evidence provided does not classify these unions as marriage, but special case scenarios that do not overlap with existing marriage laws in existence. They argue that marriage has always been considered to be between one man and one woman and that homosexual liaisons were special cases.", "Natural_Summary_Text_3": "Two people are discussing gay marriage. S1 states that gay marriage is not a new idea, as many societies have historically practiced it and in some cases the homosexuals were valued.  He also asserts that even in the old testament marriage was not just between one man and one woman; polygamy was present.  S2 states that historically marriage has been about different genders.  He then states that even though the societies had homosexual liaisons, but they were not regarded as marriage but as unions for a particular purpose.  In some cases they were even frowned upon.", "Natural_Summary_Text_2": "S1 provides two websites which outline the history of gay marriage in a few different cultures advising homosexuals were held in high regard in some cultures and were thought of as healers and prophets.  S1 cites several cultures who practices gay unions such as Romans and Celts.  S1 advises some cultures still practice polygamy and one in Nigeria  even practices polyandry. \r  \r  S1 advises while homosexual unions were present in history they were not actually thought of as marriages but more of unions for a specific purpose.  He/she contends that matrimonial unions were between opposite genders, even throughout history.  S1 concedes that homosexual liaisons were common in other times and cultures but never recognized as actual marriages and were frowned upon.", "Natural_Summary_Text_1": "S1 presents the idea that gay marriage has been pervasive in many cultures, including the Romans, Greeks, Celts, and American Indians. He also mentions the existence of other alternative forms of marriage such as polygamy and polyandry. He claims that gay marriage is not a new idea and that the idea of marriage being between a man and a woman is a recent development.\r  S2 claims that although homosexual acts did occur in many past cultures, these relationships were not marriages. He insists that marriages were almost exclusively between people of opposite genders. He argues that same-sex marriage has never been commonplace or accepted, despite homosexual acts occurring at times, and that the original idea of marriage is a union between people of opposite genders."}, "Key": "1-6646_188_186__190_191_219_220_6"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 asserts that AIDS became an epidemic in the US through the gay community. He accuses S2 of changing the topic to AIDs in Africa to deflect attention from the topic of AIDs in the US. He challenges S2 to refute his assertion with proof. S1 said that he is not a bigot, but that he is just presenting a fact of how AIDs became an epidemic in the US through the gay community. S2 asserts that S1 did not present his statistics as a discussion about the progression of AIDS in the US. Rather, S1 presented his statistics to justify opposition to gay rights. S2 brought out AIDs in Africa because location is irrelevant in refuting S1's logic.", "Natural_Summary_Text_4": "S1 believes that those who defend homosexual activity deflect the question of an AIDS epidemic in the United States by bringing up statistics for it in Africa. They believe that such arguments have no place in an argument about homosexual marriage and are blatant attempts to sidetrack the argument. They believe that AIDS became an epidemic in the United States through the homosexual male community, and that all evidence should be contained and localized in the United States when arguing a point.\r  S2 refutes this by stating that statistics in Africa are brought up to counter arguments that blame the homosexual community for the United States epidemic. They believe that if one broaches the topic of AIDS one must also look at it as a whole.", "Natural_Summary_Text_3": "Two people are discussing the spread of AIDS in the US as part of a discussion on gay marriage in the USA. S1 states that location is relevant, as the way AIDS spread in Africa is different from how it spreads in the US. He continues to state that AIDS spread in the US because of the gay community, and the gay community continually tries to deflect the argument and include Africa in the discussion instead of providing real facts.  S2 argues that bringing up the topic of AIDS is solely as a weapon against gays, and that the location of the AIDS epidemic is irrelevant to the discussion. He then states that Africa is included in order to refute the opposing logic.", "Natural_Summary_Text_2": "S1 feels the topic of AIDS in the U.S. being spread by the gay community is avoiding by returning to the argument that AIDS originated in Africa.  S1 requests factual proof that his groups' statements are untrue.  He/she advises citing feelings or wants is not providing proof but deflecting the topic.\r  \r  S2 argues that by blaming the gay community for AIDS' spreading in America, S1's group is opening the door for the argument that the disease originated elsewhere.  S2 feels the opposing group is using the spread of AIDS as a basis for banning gay marriage. He/she feels doing so is like saying if a bus hit a group of people in Africa, then buses should be banned in New York.", "Natural_Summary_Text_1": "S1 claims that the gay community is the cause of the AIDs epidemic in the US and that homosexuals and their advocates attempt to divert attention from this fact by tracing the origin of the disease to Africa. He believes that the existence of AIDs in Africa has nothing to do with AIDs in the US and that it should be ignored.\r  S2 argues that discussing AIDs in Africa is relevant to AIDs in the US and point out how AIDs is used as a justification for those who oppose gay rights. He suggests that the statistics regarding AIDs in Africa show that it is not simply a homosexual disease and that AIDs should therefore not be used as a justification to make gay marriage illegal."}, "Key": "1-6646_104_102__105_108_113_120_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes that a big 'bunch' of people cherish the notion that marriage is a sacred bond of union between a man and a woman. Redefining marriage to include same-sex couples upsets the sensitivities of these people. This is unnecessary because it is possible for gay couples to obtain rights similar to married couples without having to redefine marriage.\r  S2 asserts that redefining marriage to include same-sex couples does not harm anyone. He said that offending the sensibilities of people does not constitute harm. He claims that evidence show that the majority of people do not want to grant same-sex couples rights similar to marriage under a separate label. Hence gays have to resort to redefining marriage to secure legal rights under the marriage arrangement.", "Natural_Summary_Text_4": "S1 believes that gay marriage will hurt more people than it helps, and that the benefits deserved by homosexuals can be had without redefining marriage. They believe that it hurts people who view marriage as a sacred bond between a man and a woman. They believe that homosexuals are entitled to their rights, but do not need to redefine marriage in order to get them.\r  S2 does not believe that offending one group of individuals counts as damage, but they do believe that appeasing faith justified hate does. They don't believe people are interested in giving homosexuals marriage rights under a different name, and also don't believe people wish to grant them any rights at all. They believe separate rules will be too easy to manipulate.", "Natural_Summary_Text_3": "Two people are discussing about redefining the meaning of marriage.  S1 thinks that it is unnecessary to redefine marriage to include gays.  He states that all of the rights and benefits that married couples have are already granted to gays without the need for redefining.  Redefining only serves to hurt the many people who see marriage as a sacred bond between man and woman.  S2 thinks that it is necessary to redefine marriage. If not, the rights and benefits granted to gays will not be guaranteed.  Also, he believes that offending someone's sensibility is not real, measurable damage, so there is not reason not to redefine marriage, not doing so only appeases faith justified hate.", "Natural_Summary_Text_2": "S1 believes since gay couples qualify for the same benefits as married heterosexual couples there is no reason to allow for gay marriage advising his/her agreeing with these points does not make him/her a bigot.  S1 feels supporting arguments with logic eliminates the ability to label one as a bigot.\r  \r  S2 feels not redefining marriage to allow for same sex couples to unite leaves the door open for gay couples to not be given the same rights and benefits as hetero couples.  He/she believes as long as there is a separate set of standards there can be rule changes to prevent their benefits. S2 concedes that S1 is not labeled as a bigot but supports those who are in a sense bigots or supporters.", "Natural_Summary_Text_1": "S1 claims that his opposition to gay marriage is based on the belief that it will hurt more people than it helps, not on bigotry. He suggests that it would hurt people with a traditional view of marriage as between a man and a woman, and that the benefits of marriage can be gained by homosexuals without redefining marriage.\r  S2 argues that gay marriage does not hurt anyone, straight or gay, and offending proponents of traditional marriage is not a valid argument against it. He believes that preventing gay marriage is simply faith based hate. He claims that having separate rules for straight and gay marriage creates the possibility of those rules being different for the two groups, allowing the gay minority to be disenfranchised."}, "Key": "1-6646_318_316__319_320_325_326_331_335_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 asserts that those who are against gay marriage are not anti-gay per se, but are against redefining marriage. He argues that any minority group who attempts to redefine marriage to include anything beyond a man and a woman will get a similar response from the majority group. Hence calling those who oppose gay marriage bigot is inaccurate\r  S2 asserts that those who oppose gay marriage are not simply attempting to preserve the current definition of marriage as between a man and a woman. He argues that the opposition to gay marriage is a lack of acceptance of homosexuality or its visible and open displays and representations. This is an anti-gay bias. Hence the term bigot is appropriate to those who oppose gay marriage.", "Natural_Summary_Text_4": "S1 does not believe that disagreement is the same as being bigoted, and that if someone resorts to name calling in an argument it means they no longer have any sound arguments. They argue that any argument goes back to one's motivations and that people don't often oppose homosexual marriage on the basis of not liking homosexual individuals, but because of their views on marriage. They argue that people who base their arguments on how they view marriage would still think that way towards any group that desired to change their definition of marriage.\r  S2 disagrees and believes that arguments made against homosexual marriage are based upon a bias against homosexuality as a whole. They argue that these peoples' opinions are definitively against homosexuals in general.", "Natural_Summary_Text_3": "Two people are arguing gay marriage.  S1 states that resorting to name calling indicates the inability to resort to sound arguments.  He then states that the word bigotry is an ugly word, and its ignorant to automatically write off disagreements as \"bigotry\".  S2 rebuts by saying that he's calling it bigotry because that's what it is.  He then states that if it were another minority being challenged then it would clearly be bigotry. He states whenever gays are involved a group of people always opposes.  S1 refutes that by saying its all about motivation, if any other minority would try and change traditional marriage, they would be met with the same opposition.", "Natural_Summary_Text_2": "S1 believes referring to arguments of disagreement as bigotry is done because the accuser lacks factual information and believes S2 uses the statement for its effect since it is thought of as an ugly word.  S1 advises not all people who are against gay marriage are bigots but feel the way they do due to the way they view marriage.  S1 argues the issue is not always about excluding gays from different things but that it boils down to marriage.\r  \r  S2 invites the word gay to be replaced with another minority and the statements made to not appear to be bigoted.  S2 advises excluding gays from different pieces of society is the same as excluding any other minority and is just simply bigotry.", "Natural_Summary_Text_1": "S1 claims that it is inappropriate to label disagreement as bigotry, and that while someone might think an argument is bigoted, it may be motivated by something other than bigotry. He argues that many people's opinions are based on their view of marriage, not their dislike of homosexuals, and that they would be against any group wanting to alter the traditional view of marriage. \r  S2 claims that opponents of gay rights are discriminatory and bigoted. He suggests that if you replaced gays with another minority, then the arguments against them would appear negative (e.g., trying to exclude any other minority from getting married would not be acceptable). He believes that opponents of gay marriage are not protecting traditional marriage, but are discriminating against homosexuals."}, "Key": "1-6646_268_261_1_272_274_289_290_291_293_294_13"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 claim that he has been unjustly called a bigot for stating as a fact that AIDs is initially spread in the US primarily by gays. He feels that research to combat AIDs have consumed an inordinate amount of resources that could have been used to curing cancer and other diseases. He asserts that the majority of US population is paying the price for the promiscuity of the gay minority. \r  S2 asserts that gays are the first victims of the AIDS epidemic and acknowledges that gays are the first people to spread it. He argues that casting gays as spreaders of AIDs alone drives hate-speech. An example is Paul Cameron's statements that call for the extermination of gays.", "Natural_Summary_Text_4": "S1 believes that AIDS was initially spread among the United States through the homosexual male community and does not see sufficient evidence to refute these claims. They believe that homosexuals are a drain on resources because of this, and places the blame on homosexuals for introducing a new strain of virus that has drawn medical attention away from other pursuits like cancer. \r  S2 concedes that the homosexual community was one of the first places AIDS began to be spread through the United States, but also states that a large number of cases were because of blood transfusions. They believe that S1 is bigoted and turns their statement around by pointing out that it seems as if they are making those with AIDS unimportant to cure.", "Natural_Summary_Text_3": "Two people are discussing the spread of AIDS in the US.  S2 agrees that gay people were the first victims of AIDS and the first so spread it, but the blame partly lies with blood transfusions also.  S1 states that allot of medical resources that could be spent curing cancer and other diseases are being wasted because of the promiscuity of the gay community.  S2 refutes this by saying it is a bigoted statement; as it means the lives of gay people are less important.  To contradict, S1 states that the statement means that if the US didn't have this many HIV cases, the medical resources could have been put elsewhere, not that the infected should be forgotten.", "Natural_Summary_Text_2": "S1 wants to see an actual argument supporting AIDS was not spread in the United States by homosexuals.  S1 believes had AIDS not spread to the point of becoming and epidemic, the United States' medical research could have been more geared toward curing cancer and other diseases and blames promiscuity.\r  \r  S2 agrees in the beginning AIDS was spread primarily by gay men but also that blood transfusions played a big part as well an accuses S1 of being in support of Paul Cameron's 1985 statement advising of the extermination of the homosexual community.  Based on S1's argument in regard to medical resources, S2 accuses him/her of implying the lives of gay men and women are worth less than those of  heterosexual", "Natural_Summary_Text_1": "S1 claims that AIDS was initially spread in the US primarily be homosexuals and that no one argues with this fact. He believes that the resources spent fighting the disease could have been better spent on other diseases such as cancer if the homosexual minority had not spread AIDS to the heterosexual majority with their promiscuous sexual activity. He clarifies that now that AIDS does exist, he does not advocate ignoring AIDS research.\r  S2 agrees that AIDS was initially contracted and spread by homosexuals, but claims that its early spread was due to blood transfusions rather than sexual contact. He suggests that S1 believes that homosexuals are less important than heterosexuals based on his comment that other diseases are more important to cure than AIDS."}, "Key": "1-6646_150_144_1_151_152_154_156_161_11"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 questions to how equal marriages hurts the woman or any other heterosexual. The only person that gets hurt is S1. If equal marriage is incorporated into the law then nobody gets hurt. S2 talks about what if a proposed law hurt someone and that there are all kinds of laws that hurt all kinds of people. S1 says he is only concerned with the rights of gay people. He calls the woman evil and that she should admit that she is anti-gay and wants to protect her heterosexual privilege. S2 believes that S1 just cares about gay people but has not shown why anti-gay people should not be able to legislate their view. S2 says that S1 and the woman both have their own opinions. S1 asks whether the majority should have the right to enslave their fellow citizens or lock people up in concentration camps. S2 responds saying the majority did have the right to enslave fellow citizens until the 13th amendment took place and says that the majority wins in the united states.", "Natural_Summary_Text_4": "S1 asks S2 how equal marriage would hurt someone, \"her\", or anyone else. S1's way of equal marriage would not S1 or her. S1 is only concerned with gay rights and will talk people out of attending bible churches. S1 will try to legally disrupt any of the fundraising activities that they have going on, protest their weddings and their services. Once they crossed the line and enacted laws that hurt S1 and S1's family, then they have no place in society. The majority should not have the right to enslave their fellow citizens and send them to concentration camps. She should admit to her bigotry, discrimination and anti-gay views.         S2 is glad that S1 abandoned a silly argument about the violation of the first amendment right, but still does not see why only laws that do not cause harm should be enacted. S2 is surprised at S1's affinity for the harm principle given that S1 has expressed being at war with evangelical anti-gay christianity. S2 holds that people should be about to legislate their views, and wants S1 to explain why that shouldn't be so with anti-gay people. In a democracy like ours people use the democratic process to have views enacted into law. If she is free to do this, then so is S1.", "Natural_Summary_Text_3": "(S1) states how can gay marriage hurt politicians or anyone else? (S2) says that there are laws that hurt all kinds of peoples and argues about violation of the First Amendment by imposing someone's belief over another. (S1) argues that he is only concern with gay peoples rights and says that the politician wants gays to remain as second-class citizens. Argues that politician/she is discriminating and protecting her heterosexual privilege. He also argues that not accepting gay marriage is punishment to him, his family and others. (S2) He argues about the kind of democracy in where majority of the people decide what best for society and how being anti-gay is a right of the First Amendment.  Is a gay person is allowed to have the freedom, so does he who and others who may not agree. (S1) then gives the example that not just because majority rules it means that it's a good thing. For example, enslaving people was accepted in previous societies. (S2) argues that although previous societies had legal rights to enslave people but that doesn't mean that it makes those decisions all the time and that is like gay marriage.", "Natural_Summary_Text_2": "S1 does not believe S2 has answered her question of how equal marriage hurts any heterosexual.  S2 believes the point has been made because different laws affect different people.  S2 attacks S1 by calling their argument \"silly\" because it violates the First amendment rights. S2 remarks that S1 is only concerned with the rights of gay and the anti-gay Christianity. S1 specifically names a woman in particular to admit her discrimination. S1 expresses that the rights of gays is their first concern and protection from church. S1 threatens to respond with similar actions against the church, like protesting ceremonial events and church services.  S2 urges S1 to allow the democratic process to decide the issue, believing the anti-gay movement may also have legitimacy. S1 questions the majority rule ideology because of incidents in the past like slavery and concentration camps., and once again calls out the women. S2 ends by stating those would not be possible today because of the 13th amendment.", "Natural_Summary_Text_1": "S1 and S2 are talking about how Democracy is based on majority rule and whether or not its fair. S1 believes it is completely unfair that gay marriage be dismissed or disliked and S2 argues that no matter what S1 believes is right or wrong, the majority of people control what is normal in our society. That if S1 is only towards the rights of gay people it is completely understandable for this lady to be in belief that marriage as is is fine. S2 believes that S1's argument is not a legitimate viewpoint because S1 has no justification that this lady hates gays. S1 believes that because this lady is not in favor of gay marriage, the lady is anti-gay. S1 is taking an aggressive approach by saying they will talk to bible churches and disrupt them because she feels like she has no place in society. S1 thinks that the majority of people is enslaving their people by not allowing gay rights, but S2 argues that it happens that way and it changes over time."}, "Key": "1-6229_52_51__55_56_61_62_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 is talking about a female who is ignoring S1's religious freedom and barring his family from legal protections. S2 questions to how she is impeding S1 from his religious freedom and argues that she isn't trying to take away his right from a religious ceremony. S1 says the woman's religious belief is that marriage should be between a man and a woman, and S1's religious belief is that marriage can be between any two people that love each other regardless of their gender. If the woman's religious belief gets incorporated in to the law, S1 will not be able to marry the person of his choice but she will still be able to marry regardless of the law. The woman is just trying to keep gay people out of marriage to preserve her heterosexual privilege. S2 argues that either one of them can be impeding on the others religious freedom. S1 does not give in and keeps arguing that she is trying to turn her religious belief into law and bar him from getting married.", "Natural_Summary_Text_4": "S1 says that someone, \"her\", is trying to put their religious beliefs into law that goes against the religious beliefs of S1.  The law would bar the family of S1 from legal protections but would not affect her. S1 believes that she isn't protecting marriage but preserving her heterosexual privilege. Her religious belief is that marriage should be between a man and a woman but S1 believes that marriage should be between two people in a loving relationship regardless of sex. If she put her religious belief into law it would hurt S1 but if the religious views of S1 are put into law she would still be able to choose who she wanted and S1 would be able to choose whomever. She is trying to keep gay people out of marriage.         S2 understands the perspective of S1 but does not think it is a valid argument. S2 holds that either if either religious belief were put into law that it would infringe on the other's beliefs. S2 claims that S1 has not shown how the religious beliefs would be taken away from such a law. It can be argued in other ways but the idea of not giving gays marriage benefits is imposing on religious freedom is an empty argument. S2 counters S1 by saying that it is impossible to know whether or not she is trying to turn religious belief into law. It is impossible to know or to police someone's real motives.", "Natural_Summary_Text_3": "(S1) says that his religious freedom is being ignored by a politician attempting to make her religious beliefs law.  This law limits legal protection of gay couples and it is not use to protect marriage but heterosexual privilege. (S2)  questions how the politicians view is imposing on (S1) religious freedom. (S1) responds that he believes that marriage should be between two people who love each other and not her/politicians belief that marriage should be between man and woman. However, (S2) says that the argument surrounding religious freedom is an empty argument because anyone can argue for his or her beliefs using religion. (S1) says that gay marriage doesn't violate her/politicians rights of heterosexual privilege, entitlement since she is not protecting marriage but her beliefs. (S2) questions how (S1) religious rights are taken away or harmed. (S1) and (S2) discuss about whose religious belief is better for society. (S1) responds that the her/politicians interest is not part of his interests and or society's and does not hurts him in any way.", "Natural_Summary_Text_2": "S1 and S2 are discussing gay marriage in the context of an unknown \"she\" that is pushing a law to ban gay marriage. S1 believes that her religious freedom is being persecuted from people against gay marriage.  S1 believes this will result in her family not having legal protection. S2 doesn't believe that S1's religious freedom is being persecuted because she is still bale to hold religious ceremonies. S2 believes the same argument can be made fro m her perspective. S1's believe of marriage is that it should be based on love and not on sex. S2 argues that the religious freedom argument could be used in any format to justify any action. S1 is angered that the religious freedom of another person will go into law and bar her from marriage so she can sustain her heterosexual privilege.  S2 disagrees and thinks \"she\" is doing what she thinks is before society. S1 and S2 seem to get annoyed with each other by the end of dialog.", "Natural_Summary_Text_1": "This is about gay marriage. S1 seems to believe that someone is making religion into law by saying marriage should be between a heterosexual couple. S2 is arguing that S1's point is not very valid because S1 is not understanding that they are not using the persons perspective. S1 believes that that person is trying to hurt them, while S2 is saying that the person may not necessarily be that way and that the person may be arguing for what they believe to be greater for society, based on their own perspective. S1's religious view of marriage is based on two people's love for each other, while the other person believes its between a man and woman. S2 says S1's argument is empty and that S1 is not showing how the other person is being hurt by gay marriage. S2 thinks S1 is not understanding the overall perspectives and just focusing on their own needs. S1 states that the person's religion put into law affects peoples ability to marry if they are gay, but that S1's religion on marriage put into law would not affect marriage for anyone."}, "Key": "1-6229_6_5__7_8_9_16_26_29_46_47_48_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 and S2 are talking about what marriage means to the government. S1 says his marriage has nothing to do with the government. S2 believes that marriage is one of the foundations of social stability. S1 and S2 are both not surprised if the government gets involved in marriage. S2 is upset that Christians are demanding the government to \"get out of marriage\" because gay people want to get in it. He believes the government does not need to get involved with the regulation and support of marriage and why the society should prevent it. S1 believes the government getting out of marriage is not a bad idea. S1 and S2 start arguing about marriage benefits between single people and married. S1 argues government support of marriage is unfair to single people and S2 argues single people do not have the same issues as married people. They give examples of their own married and single life. They both compare marriage to marriage to woods and trees.", "Natural_Summary_Text_4": "S1 Questions the role of government in marriage, maintaining that it should have a very limited one. S1 says that governments want to be involved in our lives as much as they can be, and that getting the government out of marriage getting the government out of marriage would be a good idea even if people are supporting this change for the wrong reasons. It is not necessary to have government in marriage and citizens should be vigilant in making sure that the government does not intrude where it is not needed. S1 believes that single people have the biggest stake in this issue.          S2 criticizes the new push for government getting out of marriage. S2 talks about marriage being an ancient tradition, based on the pair bonding that is natural for humans, and that is one of the foundations for social stability. It is thought that it would be natural for the government to want to support it and that it should because the government is the source of law. Replacing marriage would mean a plethora of minor and specific legal contracts to cover all the hundreds of rights and mutual obligations currently conferred by marriage. Legal issues such as inheritance, pension and social security rights, adoption, custody, and home ownership that would need separate contracts without the umbrella of marriage. Marriage is more convenient.", "Natural_Summary_Text_3": "(S1) Marriage is meaningful and should not be a concern of the government.    (S2) states that marriage is an ancient human institution, natural for humans and is one of the foundations of social stability. (S2) says that Christians are involved in the topic because they want the government to \"get out of marriage\" since gay people are becoming involved. (S2) says that Christians are hypocrites because before they had not complained. (S2) states the importance for government to get involved however, it is convenient and mentions Mr. WriteLA as someone who has eloquently talked about the topic. (S1) government desires to be involved in lives. Talks about the \"Healthy Marriage Initiative\" and how some mean-spirited hypocrites want the government out for the wrong reasons. (S2) Questions why is it in societies interest in preventing the government to be involved in marriage. Also mentions Mr. WriteLA who said that the government's involvement is inevitable. (S1) argues that the government should get out of the marriage business because it is not needed and the benefits of marriage are terribly unfair for single people. (S2) says single people do not have same issues as married people from experience.", "Natural_Summary_Text_2": "This discussion is about the government roll in marriage, specifically pertaining to homosexual marriage. S1 believes that the government should have no say in marriage. S2 believes that government should have a say in marriage because it is more practical in today's world. S1 believes that individual contracts by lawyers  rather than the government being involved would be the fairest compromise. S2 encountered problems with this view in their personal life when their partner died, and they were unable to sort out all of the legal issues involved in death, like inheritance, or social security rights.  S2 believes there will be privileges that come only in government recognized unions. S1 comments best way to go about solving these problems is to take them one issue at a time rather then facing the problem as a whole. S2 thinks that you need to look at situations in from different perspectives like trees in the woods.  Both S1 and S2 have previous experience with married life and single life.", "Natural_Summary_Text_1": "S1 and S2 are debating the topic of what marriage should mean to our government. S1 Believes it is not a bad idea because they think it is not necessary for the government to be involved in most aspects of our lives, while S2 is questioning why it's necessary to try and remove government involvement when it is unavoidable. S1 brings up that because several people are against the government due to gay marriage and not because it's just marriage altogether, it doesn't mean it's not a bad idea to remove government intervention. S1 mentions the \"Healthy Marriage Initiative\" and how it isn't necessary. S2 says that there is too much legal work and documents behind marriage in the government, such as inheritance, pension and social rights, etc., and that it would be a lot more work if the government didn't intervene, also stating that removing marriage from government will only benefit lawyers. Both S1 and S2 have had experience with marriage, S2 states that marriage benefits are good because of government intervention."}, "Key": "1-8376_58_41__59_68_69_70_71_73_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 is not bothered by the inconsistency of one supporting gay rights but not gay marriage, but if one supports gay marriage they would be bothered by it. S2 doesn't see the inconsistency and doesn't understand why S1 keeps calling it that. He says that S1 hasn't shown an inconsistency yet and gives an example of how it is like saying \"Frank is inconsistent on the abortion issue\", but would be showing inconsistency if is Frank said \"I am against all abortion\". S1 doesn't know what else to say and that it would be different if S2 didn't think gay marriage would be a right. S2 argues that S1s' position is inconsistent and that S2 can see a person for gay rights and against gay marriage. He thinks Biden is wrong but his view is consistent. S1 says he doesn't care about the inconsistency of one supporting gay rights and not gay marriage. S2 says to push hard on Biden about the \"gay marriage opinion\" a few weeks away from election day and balance the response.", "Natural_Summary_Text_4": "S1 one believes that it is inconsistent to support gay rights but to be against gay marriage. S1 does not have a problem with such an inconsistency but knowing that S2 supports gay marriage it would make sense that S2 would be bothered by it. S1 doesn't believe that S2 understands the concept of inconsistency. S1 thinks that S2 would be troubled by Biden's position on gay marriage.  it would be like someone saying they are for reproductive / abortion rights, but yet being against it being legal for women to get an abortion at an abortion clinic. \r   \r   \r   S2 does not see an inconsistency in not supporting gay marriage but being for gay rights. S2 explains that  there is not an inconsistency in being against gay marriage, but for gay rights in every other way. Showing an inconsistency would be like Frank saying he is against abortion rights but has no problem with his wife getting one. Just saying that Frank is inconsistent on abortion issues is not enough to show what is inconsistent. S2 is arguing against the position regardless of who is holding it.", "Natural_Summary_Text_3": "(S1) states that one who supports gay right but not gay marriage brings an inconsistent problem. (S2) says that he does not sees any inconsistency, and compares it to the issue of abortion and how one can be against such issue for society but for ones position it may be possible. (S1) tells (S2) that it seems like he does not understand the concept of inconsistency. (S1) also says that he hopes that (S2) did not think of gay marriage to be a right. They keep arguing about positions in the matter and who is inconsistent. (S2)  says that many people often times say things such as \"I don't believe gay marriage is a right\" but they also believe that gay people should have equal rights. He argues that Biden's opinion is consistent and Biden is not lying about what he believes. (S1) says that he know that there is inconsistency but he does not care. (S2) says that people weight the ay marriage opinion issue against politician's weeks before elections and balance the responding approach.", "Natural_Summary_Text_2": "In this discussion S1 and S2 are addressing the inconsistencies of the position of being for gay rights, but against gay marriage. S1 believes that Biden saying this is inconsistent, and it should bother S2 because S2 is for gay marriage. S2 does not believe this is an inconsistent statement and attributes Biden's view to S1, making it seem like S1 is calling his own view inconsistent. S1 and S2 begin arguing about the meaning of \"inconsistent\" and eventually starting fighting. The example of abortion comes up to try and prove inconsistency, but both use it in different ways so it does not stop the argument. S1 believes that S2 should be more concerned with Biden being inconsistent, while S1 is just trying to address the issue as a whole. S2 claims to only have brought up Biden to address the lack of political action due to social pressures. S2 claims that if given the opportunity, they would express the same concerns with Biden on a one on one conversation.", "Natural_Summary_Text_1": "It seems like they are discussing the inconsistency of each other's arguments. S1 is getting annoyed and seems to just be arguing because they are \"venting\" while S2 is saying that the inconsistency is present and making all arguments invalid without proof. Both S1 and S2 are for gay rights, S2 is stating that S1 isn't being consistent and \"admits\" to being inconsistent, while S1 is saying they don't care about the inconsistency because of the point they are trying to get across. They bring up Biden and abortion in ways that dont exactly fit the discussion, but just to show the inconsistency in each others opinions. S2 is saying they would handle this same situation with Biden the exact same way because S2 is simply talking about perspective. S1 believes S2 is stating that S1 believes in gay marriage but not gay rights, which seems contradictory to S1's point. This argument does not have a set topic."}, "Key": "1-8171_71_70__72_73_74_75_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 says the topic of gay rights has become a poisoned topic because of efforts of religious right and conservative republicans. It will cost more votes than it will gain. S2 questions if S1 is saying the Biden was lying when he said he doesn't support gay marriage so he could keep from losing votes. S2 prefers political candidates to be honest about their views on topics, whether its popular or not. S2 believes a candidates view should be accepted that it is really their view and S1 says that politicians are going to tell some lies and consumers should not take politicians at their word. S1 believes it is important to figure out how often they lie and how big their lies are. He gives an example of how Biden says he doesn't support gay marriage, it can because he knows that open support could cost him the White House. S2 believes they should put the expectation on them to be honest about what their views are and political cynicism is no excuse to not put expectation on their candidates to be honest.", "Natural_Summary_Text_4": "S1 is of the opinion that a certain level of dishonesty is understandable and expected in politics. In regard to gay rights, the religious right and conservative republicans have made it a poisoned topic such that politicians won't say the right thing because it will cost them votes. Democrats have had to be moderate on the issue in order to still be in a position to do something. It's too naive to expect to a politician to give their view on matters, and so it is necessary to figure out how often they lie, what they lie about, and how big their lies are.  In this particular case, if Biden says he doesn't support gay marriage S1 is just as likely to think it's because he knows that open support could cost him the White House as any other reason.           S2 believes that as political consumers we should expect honesty of the politicians. It isn't too much to demand honesty. Without that expectation it is pointless in asking a politician a direct question. S2 understands that politicians lie but holds that if words of politicians mean nothing then there is little point in having political discourse. Political cynicism is no excuse to not put expectations on our candidates to be honest with the American people.", "Natural_Summary_Text_3": "(S1) argues that overtime-religious politicians, conservative republicans have made the effort to make gay rights a poison topic. According to his democrats want to do the right thing however, they are force to moderate their opinions for public approval. (S2) says that politicians lie about their opinion to not loose votes. He says that he would prefer if politicians were honest. (S1) says that it is common knowledge that politicians are going to lie because they can not simply say things, they have to be careful for the judgment of other. The particular case of Biden who stated that doesn't support gay marriage. He also states that it might be because Biden did not wanted to risk his support and his position in the White House. (S2)  argues that (S1) is misunderstanding him because according to him people need to put expectation for politicians to be more clear and honest about their opinions. He says that people need to pay close attention to politicians and not excuse politicians cynicism so that the American people can have politicians to be honest.", "Natural_Summary_Text_2": "S1 begins the dialog by attacking conservative republicans for the lack of gay rights in America, and claims democrats have been trying to progress gay rights but are afraid to loose their political position. S2 responds by commenting that Democratic Vice President Joe Biden stated he was against gay marriage. S1 believes he was lying to attract votes. S2 expresses desire for a candidate who stands behind their beliefs regardless of popular opinion, and not lie to get votes. S1 calls S2 naive for believing that lying does not happen in politics today. S1 believes it is the responsibility of the public to decipher political language to know when politicians are lying or not.  S2 believes that the public should demand honesty but not assume it.  There is no point is questioning candidates, if it is known they are going to lie. S2 addresses that S1 also believes that honesty should be demanded because their earlier statements insinuated that they thought this practice was wrong", "Natural_Summary_Text_1": "This is about politics and whether or not the lie in order to get more votes. S1 believes politicians sometimes may lie as long as its what is the majority, while S2 is saying that S2 is more concerned with the honesty of the candidates rather than whether they are lying or not. S2 says we should expect them to be honest, because that is what we should want from politicians. S1 argues that politicians seem to lie in order to get the position they want or sway people to become popular, while S2 thinks that we should rely on them to make the right decision. S1 seems to think that S2 is making an argument for their belief, but S2 is just trying to be honest and show the other perspective. They argue about politicians lying through discussing when politicians are asked questions and how they answer them. S2 finishes by telling S1 we should not label politicians and expect them to do and say the right, honest thing."}, "Key": "1-8171_3_2__4_5_7_11_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 says we benefit from families with adopted children, step children, or families with no children at all. Marriage has nothing to do with the bible and everything to do with the slippery slope logical fallacy. S2 believes a married couple as the head of a home is considered a nuclear family because is already that the question of legality. He questions S1 if he is trying to say because gay marriage is less acceptable than incestuous relations that it is okay to grant gay marriage but not sibling marriage. According to S1, incest and polygamy doesn't relate specifically to gay legal marriage. S2 questions to what exactly does the social acceptance of any type of \"taboo\" relationship have to do with their right to be legally married. S2 believes  that gay marriage will change the definition of marriage from \"a legal union between man and woman\" to \"a legal union between any parties that love each other\". He poses the question if it is okay for two people to tie the knot then how could incest be  taboo.", "Natural_Summary_Text_4": "S1 thinks that we don't just benefit from what is often considered the common, nuclear family. We benefit from families with adopted children, step children, families with no children at all. S1 believes that marriage has nothing to do with the bible. Then what may lead to incest and polygamy doesn't relate specifically to gay legal marriage at all. S1 is trying to show that people who are against gay marriage try to dissuade others by attempting to incite fear by spouting off a parade of horribles that have nothing to do with the issue of gay marriage. S1 holds that love applies to straight marriages as well as gay marriages and that love is not exclusive to gay marriages. It is fallacious to believe that love will lead to a slippery slope. Those against gay marriage use logical fallacies.         S2 does not see the logic in bringing up sibling marriages and is curious to know how S1 would respond to such movements. S2 does not believe that what people do in their private lives is anyone else's business. What may lead to incestuous marriage is if siblings or related people who love each other and want to live together under the legal union of marriage. What may lead to polygamous marriage is 3 or more people who love each other and want to live together under the legal union of marriage. Gay marriage was considered just as much a taboo as incest or polygamy just a few years ago. S2 does not understand why it is  ok to deny incestuous relations the right to marry on the grounds that it is considered taboo, but ok to approve gay marriage on the same grounds.", "Natural_Summary_Text_3": "(S1) begins talking about how we benefit from what is considered common, such as a nuclear family and how it is composed. He also says that it's right it has nothing to do with the bible however; it has everything to do with slippery slop logical fallacy. Then, gives the example of how incest and polygamy is less socially accepted in comparison to gay marriage. And so, it rebuttals the argument using both issues with equal weight because it scares some people away who might not have much knowledge about the topics.  (S2) states that a married couple is considered a nuclear family and that marriage is a legal institution. (S2) poses the question of weather it's acceptable for gay marriage to be accepted but not the other because they are less popular and if so why? (S1) answers that those issues do not relate specifically to gay legal marriage and that many attempt to use those issues similarly to argue against gay marriage.  (S2) brings up the question of what is socially accepted and the types of taboo relationship and legality. (S1) says that love is not exceptionally for gay people but also others. Also that taboos are constructed on the basis of peoples reasoning, indications and practices. (S2) keeps arguing why is anestrous taboo and not gay marriage?", "Natural_Summary_Text_2": "S1 and S2 discuss same-sex marriage. S1 is for gay marriage, and opens the discussion by showing logical fallacies used by the opposition to deter people from believing gay marriage is an extension of equal rights.  S1 believes that modern families are not traditional families and are often better off for it. S1 specifically points out the comparison of gay marriage to incest or polygamy. S1 says this is a scare tactic to turn people away. S2 believes that homosexuality, incest, and polygamy are all related because they are all taboos of society. S2 wants to draw the line as is so the definition of marriage does not change. If it does change then there would be no limit to who could marry.  S1 explains that love is present in all marriage so the claims made by S2 about gay marriage leading to incest, could be used for straight marriage as well. S2 attacks S1 and thinks that if the other parties mentioned went and paraded their lifestyle then they would also have an equal opportunity to make their marriage a social issue.", "Natural_Summary_Text_1": "S1 and S2 are debating whether making gay marriage legal will open opportunities for other \"taboos\" in our society. S1 believes that in opening this opportunity for gay marriage, the definition of marriage will change and it will allow other issues like incest and polygamy to become legal. S2 accuses S1 of hypocracy. In a sense, they believe gay marriage will have a sort of domino effect for other issues. S1 is arguing that using these other issues to be evidence for why gay-marriage shouldn't be allowed is not a valid argument. Then S1 goes on to say that this tactic is used to instill fear to those who do not support those other issues. S1 understands the other issues, but doesn't see the relationship between those and that of same-sex marriage. S2 keeps arguing that it shouldnt be different figuring out whether one can approve gay marriage but not incest since they believe the two to be somewhat related."}, "Key": "1-4350_46_31__54_59_66_69_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 is upset with Matt about making an assertion that Republicans would send gays to concentration camps and about a statement by psychologist Paul Cameron. Instead he should have linked someone in the Republican leadership saying those things. Paul Cameron is a frequent target of gay pride movement for demonization. S2 says that Paul Cameron is the most frequently quoted \"expert\" cited by GOP in all their attempts to limit the rights of gay people. S1 says the point is that Matt commented that someone who may not even be a republican hates gays, and that republicans hate gays. He says it's not about Paul Cameron but about Matt's ridiculous comments and that no republican in leadership would call for the extermination of gays. S2 argues that Paul Cameron's research is cited in almost every single attack on gay people in state after state legislature. S1 says to S2 that he is making a ridiculous generalization while S2 replies that he said S1 is probably right to assume that some people were anti-religion.", "Natural_Summary_Text_4": "S1 believes that there's a big difference between possibility and likelihood. S1 finds fault with the stance that republicans would ship gay people to concentration camps. S1 objects to bringing up  a statement by Paul Cameron, as if Paul Cameron has anything to do whatsoever with Republican politics or leadership. Matt is pulling some wild point out of his hat, saying that because someone who may not even be a republican hates gays, that republicans hate gays. I might as well have said that since John Lennon attacked religion, then Democrats hate religion.  It's about Matt's ridiculous generalizations and comments and S1 holds that there is NO republican in leadership that would call for the extermination of gays. S1 believes that S2 is making ridiculous generalizations.         S2 believes that S1 is defending Paul Cameron and states that he is the single most frequently quoted \" expert \" cited by the GOP in ALL their attempts to limit the rights of gay people. Paul Cameron's research is cited in virtually every single attack on gay people in state after state after state legislature. It was presented in the \" debate \" about same-sex marriage in the U.S. friggin ' Senate. His name appears in the citations of virtually every legal brief filed by opponents of same-sex marriage. S2 is surprised that reasonable people talk about Paul Cameron. S2 finds it laughable to try to defend the GOP when one of their admittedly most effective propaganda campaigns is to rally the \" family-values \" crowd against gay rights.", "Natural_Summary_Text_3": "(S1) starts talking about how it's ridiculous to think that republicans would send gays to concentration camps like the Germans practiced in the Holocaust.  He talks about Paul Cameron a psychologist having nothing to do with politician's ideas or decisions. He tries to assert that republicans do not cite or reference Paul because he is not a reliable source. However,(S2) argues that Paul is frequently referenced as an expert on the issue of gay marriage and rights. He talks about the moral behind Paul's \"research\" and how it's fraudulent.(S1) then asks (S2) to stay on point and not divert the conversation. He also states that someone who may not be republican may hate gays and that Republicans platform or party leadership does not has to do with Paul's views.(S2) says that Paul's \"research\" is present in the debate over gay marriage.(S2) also says that Paul has been cited in virtually every legal brief filed opposing gay marriage.(S1) says that (S2) is generalizing while (S2) talks about family values.", "Natural_Summary_Text_2": "S1 and S2 enter a discussion about gay rights, but more specifically on the claims made by a certain Republican Party member: Paul Cameron. S1 is angered that S2 is making wide generalization about the Republican Party, and agrees that Cameron is eccentric party member. S2 believes that since Republican Party members often use Cameron as citation for research and therefore most share his views that gays are bad for the world and must be exterminated, like the Jews in the Holocaust.  S1 thinks S2 is making a generalization on the entire party's based off one person. S2 thinks this unfair because Cameron is not apart of the Republican Leadership, and that the views of Cameron are outdated with the views of Republicans today.  S1 compares this to quoting singer John Lennon against religion and attributing it to the entire Democratic Party. S2 responds by connecting Cameron with George W. Bush, and believes that if a party constantly uses the research of single person, then they must share the beliefs of that person.", "Natural_Summary_Text_1": "This seems to be an argument about gay rights and generalizing the political beliefs of people. According to S1, S2 talks about Paul Cameron and makes it seem as if he is the voice of the Republicans. S1 argues that it is not the case and one person who sides with a specific party doesn't represent the party. S1 uses John Lennon as an example of this not being a proper way to generalize political views of parties, in his case the Democratic party. S1 accuses S2 of making an assertion including the Republicans creating another Holocaust, because of the generalization that S2 made. S2 believes that Paul Cameron's views are cited and used in many cases against gay rights because most people do share the same views, which S1 thinks otherwise. S2 says that most attacks on gay rights have cited Paul Cameron, even within the US Senate, showing that he has a strong opinion in the Republican party, or at least it seems so."}, "Key": "1-5342_11_8__13_16_21_22_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 says he served Uncle Sam and fought for his freedom of speech right unlike other people. S2 is amused at S1's statement yet he doesn't feel gays should be able to serve in the military of have freedom of speech. S2 also says S1 didn't actually fight for his freedom of speech but was guaranteed it by the constitution which applies to all Americans including gays. S2 questions S1 to why there should be consequences on earth because S1 believes it is wrong according to his religious book. S2 tells S1 that he has no evidence of what he claims but asks S2 why all Americans should believe S1's book. S2 says the power of the government comes from the people and his fight is again bigots who feels that they can use their personal beliefs to dictate what other may or may not do. S1 questions S2 as to who is he to decide what religious-minded people can and cannot do and says S2's personal bigotry is getting to him.", "Natural_Summary_Text_4": "S1 differentiates himself from others around here who live off the service of others by saying that he has served for Uncle Sam and fought for freedom of speech. Sodom and Gomorrah liberals are a scourge to decent people everywhere. Gay people can serve and say whatever they want, but they need to stay in the closet or else they're out of here. There's consequences on earth and in the hereafter for the stiff-necked crowd. S1 believes S2's position is stupid and that S2 is in denial. S1 doesn't believe that a New Testament person, place, or event should be considered to be fiction.S1 thinks that the personal bigotry of S2 is getting the better of S2.         S2 finds it amusing that S1 believes that he fought for the right of free speech but that S1 does not believe that gay people should have it. S2 points out that free speech is inherently protected through the constitution. S2 finds that gay people under S1's view do not have freedom of speech because if gay people say the wrong thing then they get kicked out.The constitution applies to all Americans, even the gays. Not everyone believes S1's religious book, and as such, not everyone feels obligated to abide by that book. Thankfully, you and your like-minded crowd of bigots are a dying breed. S2's fight is not against S1 specifically, but against bigots who feel that they can use their personal religious beliefs to dictate what others may or may not do.", "Natural_Summary_Text_3": "(S1) states that he has served Uncle Sam and fought for his freedom rights. (S2) responds that (S1) does not thinks that gay people should have the opportunity to serve in the military or have freedom of speech. (S2) also stated that (S1) did not fight for his freedom of speech because that right is guaranteed in the constitution. (S1) accuses (S2) about lying about what other have said. He says that gays can serve but they need to stay in the closet. (S2) challenges (S1) to show him where he lied and states that gays can not say whatever they want to because they'll get kicked out and says that is not freedom of speech. (S1) charges (S2) of being in denial but (S2) defends himself by saying that he never said he was in denial and that the religious book is only a philosophical fiction. (S2) says that his fight is not directly or only with (S1) but with others who think that they can tell people how they need to live their lives based on religious beliefs.", "Natural_Summary_Text_2": "S1 and S2 enter a discussion on gay rights and religion impact of legislation. S1 served in the military and they believed they have earned their right to have freedom of speech. S2 points out that gays should be able to do the same but are unable to due to prejudice due to policies that keep gay people from being open about their sexuality. S2 explains to S1 that the right to freedom of speech is guaranteed by the Constitution and gay are not being protected.  S1 is fine with gay serving in the military as long as they stay in closet or they should be kicked out. S2 argues that it is unfair to have laws based on religious text that does serve as everyone's religious text.  S1 responds angrily and with homosexual slurs, and requests that S2 take his comments up with Obama. S2 explains his goal is too preach to the public and not to any specific person.  S1 believes S2 is being prejudice against religious-minded people.", "Natural_Summary_Text_1": "S1 and S2 are debating the issue of freedom of speech and gay rights. S1 is against gay rights and believes they earned their freedom of speech through serving in the military. S2 believes everyone has the freedom of speech and is against speaking out towards other kinds of people. S1 is very rude and constantly being immature towards S2. S2 states that we are granted freedom of speech by the constitution, and S1 responds with immature remarks and questions. S2 points out that S1 has no evidence of any sort for his arguments and that believing in the bible should not be a reason to dictate everyone else's rights. Also, S2 adds that he doesn't need to prove his beliefs the same way S1 shouldn't dictate his beliefs. S1 seems to be ignorant to the actual context of the conversation while S2 is in belief that S1 shouldn't use his beliefs to dictate the rights of other individuals."}, "Key": "1-9989_18_14__25_26_27_29_30_32_33_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 says when a pre-birth child dies it has a \"real\" body. S2 thinks that S1 is trying to get people to talk to him about abortion. He tells S1 to couple a \"general welfare\" claim with the research that shows abortion has caused lower crime. S2 believes that boundaries do exist and he could easily argue that those people who wanted to prevent gay marriage could just as easily want to prevent inter-religious or inter-racial marriage. S1 poses a question if Maine's results have any bearing on the scotus look at overturning the 9th.  S2 says Maine's results were about how voters feel about gay marriage and the \"9th\" is about how federal constitution applies to gay marriage. S2 argues that they are two entirely different issues and the S1 pointing to issue A does not refute issue B. S2 believes it doesn't matter how much \"desire\" the voters have, their law still has to be constitutional and meet the requirements of the 14th amendment. He ends the discussion with S1 until S1 can embrace an honestly open discussion on the topic.", "Natural_Summary_Text_4": "S1 believes that dead \" potential \" lives don't have \" real \" or \" actual \" dead bodies. When a pre-birth child dies ( either naturally or by the hands of a ' doctor ' paid to kill it ),... it has a ' real ' body. S1 states willingness to debate the matter further with S2. S1 questions is Maine's voting results will overturn the 9th amendment. California's ban ( being reviewed by the 9th ) is likewise about \" the voters \" and their desired definition. S1 anticipates the responses of S2 and questions S2's ability to learn from the debate.\r   \r   \r   S2 dislikes that S1 brought up abortion rights in the forum and thinks that S1 would lose abortion arguments by the arguments you have raised here. S2 believes that S1  flubbed up stating what you wanted to say trying to argue that the abortionists could have no qualms exterminating Jews in another Holocaust. It could  could just as easily argue that those people who wanted to prevent gay marriage could just as easily want to prevent inter-religious or inter-racial marriage. They could supposedly just as easily have wanted slavery back, if they're willing to deny people rights because of their differences. Maine's results were about how voters feel about gay marriage not about the federal constitution.  Bowers rationale does not withstand careful analysis. In his dissenting opinion in Bowers Justice Stevens concluded that ( 1 ) the fact a State s governing majority has traditionally viewed a particular practice as immoral is not a sufficient reason for upholding a law prohibiting the practice, and ( 2 ) individual decisions concerning the intimacies of physical relationships, even when not intended to produce offspring, are a form of liberty protected by due process. LAWRENCE V. TEXAS The fact that a majority want a law is not enough to satisfy a constitutional challenge of that law.", "Natural_Summary_Text_3": "(S1) begins talking about the death of a child either by natural or in the hands of a doctor. (S1) also mentions that there are photos in the web and offers to debate about the topic. (S2) questions if (S1) is beginning to debate about abortion. (S2) also indicates playing devils advocate to also talk about gay rights in relation to abortion. (S2) compares abortion to the extermination of Jews in the Holocaust. (S1) bring to (S2)'s attention the overturning of the 9th in Maine's results. (S2) then states that the 9th is about hoe the FEDERAL CONSTITUTION applies to gay marriage. This means that the results reflect how the voters feel about gay marriage. (S2) talks about State's majority has traditionally seen an issue as immoral it is not enough to prohibit the practice and that intimate relationships are no one else's concern and it is a liberty by due process. (S1) talks about the desire of the voters and so brings up the decision made in California. To that (S2) says that he cannot trust the intellectual honesty discourse of (S1) because of his flawed arguments.", "Natural_Summary_Text_2": "S1 and S2 are in unfriendly argument about gay marriage. The argument originally starts in a tangent of Abortion.  S2 thinks that S1 is trolling the thread and briefly comment on abortion playing the devil advocate to shows the misuse of logic is S1's thinking for issues in gay marriage. S1 continues to antagonize S2. S2 continues to discuss the necessity of drawing boundaries in reason and the importance staying on track. S2 says they should use familiar comparison of attacks on inter-racial marriage where if you are against interracial marriage, you are for slavery,  to show his support of gay marriage, just to show S1that type of discourse is not logically accurate. S1 brings the \"9th\" from Maine and \"Prop 8\" from California as example of states that have showed that their majority was against gay marriage, but yet people in those states are still trying to get them overturned. S2 compliments S1 for clever banter. S2 ends the discussion by accusing S1 of repeating his points, which pertain to two separate issues.", "Natural_Summary_Text_1": "This debate is about the 9th and how the federal constitution applies to marriage. S1 and S2 begin by talking about trolling and potentially starting a new debate on abortion, which doesn't really have a lot of purpose in this conversation. S2 says that in saying people who want to get rid of gay marriage may have wanted to prevent inter-racial and inter religious marriage. S2 states that Maine's vote on gay marriage was an opinion on gay marriage, rather than the 9th being how the Federal Constitution applies to gay marriage. S2 also says that Bowers Justice Stevens doesn't have the evidence to withstand his analysis. They also bring up Lawrence v. Texas and S2 states that even when majority wants a law it isn't enough for the constitution challenge of the law. S2 goes back to saying how S1's arguments are flawed and that its too repetitive for this conversation, because S1 hasn't disproved anything. They go back to talking trash to each other and they end the conversation."}, "Key": "1-9331_169_167__172_179_183_185_191_206_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 asks S2 if he knows that the gay marriage debate is not synonymous with someone condoning violence against gays. S1 agrees that gays shouldn't experience violence and name-calling. S2 says that on Archie's post that Archie regularly denigrates gays with a variety of slurs. S1 finds it funny that the whole violence thing gets used as a means-to-an-end tool by those who argue against religious people on this. People shouldn't have to stop standing up for their principles just because of other people. S2 says telling people that gay marriage will makes their kids have to be taught about gay marriage is a threat, as well as telling people that gay marriage will require churches to have to perform gay marriages. S2 thinks S1 is ignoring him but S1 says he is not rather S2's tone has changed. S1 says name calling and violence were the things Jason conflated with opposing gay marriage. S2 asks S1 to quote exactly what he said because he thinks Jason did no such thing.", "Natural_Summary_Text_4": "S1 points out that the gay marriage debate is not synonymous with someone condoning violence against gays. S1 thinks that anyone here would with S2 that gays shouldn't experience violence and name-calling. S1 doubts that anyone would be satisfied if every religious person who genuinely disagreed with gay marriage because of their religion added a ' but-no-violence! ' addendum to everytime they weighed in on it.People shouldn't have to stop standing up for their principles just because of nutcases out there. S1 is not trying to ignore S2 and defends not attacking S2 due to the change of tone of S2. Namecalling and violence are wrong, REGARDLESS of where people fall on the issue of gay marriage. In fact, more importantly, they're always wrong no matter what the issue.          S2 points to another author Archie who regularly denigrates gays with a variety of slurs as someone who uses inflammatory language. There are people  who put out junk that makes people feel threatened by gays. It's built up toxicity from all the anti-gay rhetoric that reaches a boiling point. When the rhetoric inflames, it's obvious where it starts when somebody gets burned. S2 thinks that S1 throws arbitrary arguments out there, belittles the claim of S1 and demonstrates an ulterior motive for ignoring the statement.", "Natural_Summary_Text_3": "(S1) is talking about how gay marriage is not synonymous with violence. (S2) argues that there is regular denigration of gays and mentions politician's unhelpful views on gay marriage. (S1) also says that it's funny how violence is used to end an argument against religion. (S2) is talking about bad things that people make/talk about gay people to influence fear on others. For example, that gay marriage means that children will have to know about it, churches to perform gay marriages, and that the adds on Proposition 8 the adds were insightful. (S1) says that there is an anti-gay rhetoric and inflated statements to scare people. Then both (S1) and (S2) argue about how they are not so interested in arguing with each other but they are invested in defending their ideals. (S1) says NAMECALLING AND VIOLENCE were things commonly use at the same time to oppose gay marriage. (S2) states that (S1) use boring passive-aggressive attacks when talking about the issue of gay marriage.   Both (S1) and (S2) keep referring to other's views on the issue and choose sides.", "Natural_Summary_Text_2": "S1 and S2 are talking about the views of gay marriage in our culture. S1 is against gay marriage but thinks it is unfair for supporters of gay marriage to link his view with violence towards gays. S1 thinks violence towards gays is used as launching point for gays to preach gay rights.  S2 makes reference other poster and homophobic slurs that be frequently used on the thread. S2 believes that violence towards gay stem from slanderous representations of gays, and produces a toxic environment where people will act in violence out of fear.  S1 is once again gets angered by the generalizations used by S2, because it does not represent his point.  S2 is happy S1 is no loner attacking him. S1 believes he was only responding to the attacks by S2.  S2 becomes angry with S1 for avoiding the main topic at hand.  The discussion diverges into S2 quoting previous posters and showing hateful speech.  S2 believes this dehumanizing talk in responsible for hate against gays.", "Natural_Summary_Text_1": "This is about the use of arguments of violence towards gay-marriage. S1 starts off saying there is a difference between being anti-gay and someone condoning violence against gay people. S2 talks about how violence is used to make people feel threatened to feel a certain way about a topic or debate. S2 used the example of kids being taught about gay marriage in school as a threat. S2 also mentions someone named Archie who posts include a variety of slurs towards gay people. S1 brushes on the topic, but goes off track from the topic quite a bit. These two people start referring to each others \"attacks\" on each other towards the end. S1 says they were referring to namecalling and violence from the original post that was opposing gay rights. These two aren't really in opposite positions/beliefs, but they are more trying to discuss the ways they argue for or against gay marriage and how it may be portrayed by others."}, "Key": "1-8228_94_93__95_96_97_101_103_105_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 argues that group marriages would not make sense under current marriage laws, as they only account for two individuals in a legal marriage. They state that opponents of homosexual marriage tend to argue that a change to marriage law would make it too open ended. This person does not believe that to be true, and argues that homosexuals are not trying to broaden the scope of marriage, but only change the law to be inclusive of themselves. They believe that bringing up hypothetical arguments to the contrary is a distraction.\r  S2 argues that an effect of homosexuals being allowed to legally marry would lead to even more changes to marriage laws that would include more than simply homosexual relationships. This person believes that allowing homosexual marriage is a case that broadens marriage and if allowed, can open basis for future arguments to broaden the law further. They firmly believe that marriage as an institution is between a heterosexual male and female and that changing that in any way gives legal grounds to continue changing it.", "Natural_Summary_Text_4": "S1 (Kronos) and S2 (Jyoshu) are discussing the fact that there are other groups besides the gay community who may want marriage equality rights, such as polygamy advocates or 17 year olds.  Jyoshu sees the changes in law that would be required as an attack on social and legal precedent that can get out of control or be difficult to implement.  Kronos complains that this is a frequent tactic of anti-gay marriage advocates who unfairly claim  that gays want to \"make marriage an open ended institution.\"  Jyoshu notes that whatever the intent, the result is the kind of change the anti-gay advocates warn against.  Kronos asserts that specific laws could accommodate specific groups.  He also argues that the motivation of gays who wish to marry is sincere and the same as the motivation behind opposite sex marriages, and therefore the broadening of marriage is a side effect and not the goal.  Jyoshu says she understands but complains that gay marriage would open the door to further broadening of marriage.", "Natural_Summary_Text_3": "S1 believes changing the law to outline group marriages would be a tedious task.  S1 believes transforming to open ended would open the door for other issues such as children being allowed to marry.  S1 believes those who practice other types of unions are using same sex marriage to open the door for other types of unions to be accepted and recognized as well. S1 believes this is the reason most people do not want to broach the subject of polygamist unions advising the goes is not to broaden marriage.\r  \r  S2 feels laws will need to be changed to tailor to same sex marriages and the same courtesy should be extended to polygamous marriage.  S2 argues that society can deal with the issue of polygamy without opening the flood gates to include groups such as children, family members, and animals. S2 argues if the institution of marriage is to be changed to include same sex couples, there is no choice but to also face the subject of other types of unions as well.", "Natural_Summary_Text_2": "Two people are discussing gay marriage and its possible consequences.  S1 contends that our current marriage benefit laws are set up for two adults running a household, so recognising group marriages is a huge task. He points out that even though its for one man and wife, that is not a necessity and would be a much easier task than allowing group marriages.  He argues that the purpose of what gays are trying to do is to get married, and a side effect is that people will see it as the scope of marriage being broadened.  But, broadening marriage to include polygamy and other types of marriages is a side effect that doesn't need to be accepted.  S2 contends that cultural and legal precedent is very real, and that intent is irrelevant.  This is because by seeking gay marriage, the boundaries of what defines marriage is widening to include more than opposite-sex couples and because that, gays are broadening marriage, which inevitably leads to broadening in the other areas.", "Natural_Summary_Text_1": "S1: Opposers to gay marriage often jump to conclusions about who can get married -why not cousins, group marriages, children, dogs? Polygamous marriage raises legal concerns that are not currently covered in traditional marriage laws, for example. The goal of gay marriage supporters is to be able to get married - not to broaden marriage. Broadened marriage is a side effect of legal gay marriage.\r  \r  S2: Gay marriage supporters want marriage laws changed to accommodate gay marriage. Broadened marriage could change the current traditional marriage laws. Polygamy, for example, would require more marriage laws changed than gay marriage would, as more people are involved. But if enough people wanted legal polygamous marriage, the laws would be passed. Marriage would be broadened if gay marriage is made legal, whether that is the goal of gay marriage or not."}, "Key": "1-6331_5_4__7_9_12_13_15_20_32_34_37_38_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes that in 1909, the stance against homosexuality was based on a moral obligation and not prejudice because homosexuality at that time was viewed as behavioral and not genetic. This person parallels the treatment of women and blacks during that time period and state that it was viewed, back then, as morally right. They argue that since most people viewed homosexuality as a behavior and not a state of being in 1909, it couldn't have been prejudiced. This person does not believe that there was a social identity among homosexuals in 1909 because society viewed it as morally wrong.\r  S2 argues against the idea that ignorance is a reasonable excuse for prejudice. This person also uses the parallel of treatment of blacks and women, but argues that morality was an excuse to hide the prejudice. They argue that ignorance is what led to a distinct prejudice towards certain lifestyles and people, and argues against the idea that there wasn't a social identity for homosexuals in 1909 when there was obvious disapproval aimed in their direction.", "Natural_Summary_Text_4": "S1 and S2 are discussing society's attitude toward homosexuality in 1909 in reaction to a court case addressing a 1909 issue.  It is not clear when the opinion was issued, but S2 suggests that the unanimous opinion of 6 judges implies that a ruling in 1909 against homosexuality was not based on prejudice because the act of homosexuality was viewed more as a crime rather than membership in a group.  S1 asserts that there have always been homosexuals and prejudice against them, citing Oscar Wilde for example.  S2 argues that genetic causes were not considered at the time, that homosexuality was deemed misbehavior, and in the past were repressed enough to not constitute a known community which could be discriminated against.  S1 likens historical discrimination against the gay community to historical discrimination against blacks with slavery and women with misogyny.  S2 differentiates the latter two by arguing that nobody openly supported slavery or misogyny as a good and moral thing, whereas the prosecution of sodomy was considered a routine legal proceeding.", "Natural_Summary_Text_3": "S1 sides with the court's argument that in 1909 there was no prejudice toward gays as they didn't know what this was at that time and this makes it a moral standpoint, not a prejudice against.  S1 feels S2 does not have a firm grasp of historical facts due to the points made.  S1 rejects the point of gays having been forced to conform to society and cites that hetero-society did not believe in sodomy and due to this would not support relationships between two males.\r  \r  S2 compares the treatment of homosexuals in that era with the oppression of the black race and the belief women were a lesser gender.  S2 believes the morality of the era was based on ignorance and prejudice as it is today. S2 advises the moral system used in that era was prejudice based on ignorance and society is plagued by the same ignorance and non-morals. S2 also believes gays were not thought of as human.  Free to be gay as long as they weren't openly gay.", "Natural_Summary_Text_2": "Two people are discussing a the perception of homosexuality in 1909.  S1 makes the argument that in 1909, homosexuality was viewed from a moral standpoint instead of being about prejudice and bigotry, since they didn't realize that homosexuality was a state of being and thought it was purely behavioral.  S2 contends that it was once moral to have racial and gender inequality based on prejudice, so prejudice against gays was around even then.  S1 retorts  by stating that there's little historical backing to the idea that racism or misogyny was doing good, and the issue in 1909 was understood behaviorally and therefore morally.  He states that 1909 society had to little understanding of homosexuality to be prejudiced.  To contradict, S2 states that people hatefully used the term \"Sodomite\" to refer to gays, were put in prison and kept out of everything in Society.  S1 rebuts by stating that it is because Sodomy wasn't approved, not because they were gay, as there was no social identity.", "Natural_Summary_Text_1": "S1: In 1909, being homosexual was morally wrong, and people could be prejudiced about something that they did not recognize as innate. There was little historical evidence to prove that people in 1909 believed that it was \"right\" or \"good\" to oppress black people or women, and this sentiment extend to homosexuals. In 1909, people knew that gay sex occurred and they understood its occurrence to be entirely behavioral, and therefore, immoral. Homosexuality was not understood as a social identity back then, so there was no \"gay lifestyle\" to be prejudiced against. Sodomy was criminalized, not being gay.\r  \r  S2: There was prejudice against gays in 1909 just as there is now. The immorality of homosexuality in 1909 is based on ignorance. As long as gay people \"lived straight\", they could be as sexually non-normative as they wanted to be. There were terms for gay men back then, like sodomite and molly, so there was a clear identity for people to be prejudiced against. Men who \"acted gay\" were punished for it in 1909."}, "Key": "1-5811_33_29__35_38_40_41_43_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes that people can be prejudiced without having a true religious or moral reasoning behind it, and that sometimes those that do are claiming that they do falsely. This person believes that anti-homosexual sentiments are based on prejudice and that those who oppose homosexual lifestyles use religion and morals as an excuse to say that they aren't actually prejudiced. This person voices a displeasure in those who would press their own personal biases upon others, especially when using morals or religion as reasons for doing so.\r  S2 believes that people can have a strong moral or religious belief and not be prejudiced. This person does not approve of a homosexual lifestyle and argues that it is not because of prejudice but because of his or her personal religious beliefs. He or she, however, states that they have no desire to impose such beliefs on anyone else. This person believes that what they personally believe is not what everyone else does, and agrees that people can falsely claim a moral or religious opposition to homosexual lifestyles.", "Natural_Summary_Text_4": "S1 and S2 are discussing anti-gay bias and the nature of prejudice versus valid religious beliefs.  S1 believes it is prejudicial to hold anti-gay opinions, whether based on religious values or otherwise, and use them to impose ones views on another. S2 agrees that religious belief can be improperly used as the pretext for acts of prejudice against the gay community, but proposes that only people who are lying about having religious values against homosexuality should be accused of being prejudiced.  S2 asserts vaguely that her belief that \"Christ is a resurrected being\" somehow absolves her of prejudice in being generally opposed to homosexuality.  S1 seems inclined to grant her leeway based on such a religious objection, but requests more specifics as to why a Christian must oppose homosexuality and admonishes S1 not to actively agitate against the gay community or advocate for public policies which are discriminatory.  S1 is opposed to groups such as \"Focus on the Family\" (may be a misnomer) who attempt to impose their views on others.", "Natural_Summary_Text_3": "S1 believes it is prejudice as opposed to religious or moral beliefs which fuel the anti-gay agenda; advising a moral-bases system does not allow for the intentional targeting of another and also religion could be cited but is not based upon dictating how another should live.  S1 believes all religious based arguments regarding gay issues eventually circle around to prejudice and invites S2 to support the religious argument without this happening.  S1 advises there is no issue with people who do not try to push their views on others.\r  \r  S2 concedes religion is not to blame in and of itself and eludes to the point that often times people who are claiming a religious or moral reason for their actions are doing so after having gone against the premise on which their belief is based.  S2 also advises he/she is against same sex relationships because the Bible says it's wrong but does not impose his/her beliefs on others and is not prejudice.  S2 refuses to give the summary of their religious argument.", "Natural_Summary_Text_2": "Two people are discussing gay marriage.  S1 believes that the anti-gay agenda is based on prejudice, and that simply calling something moral or religious does not mean it can't be prejudice at the same time.  He contends that people who justify the anti-gay agenda claim a moral or religious stance without having one. He also states that he has never seen someone justify an anti-gay agenda based solely on morals or religion. S2 retorts by stating that when people claim religion in doing prejudice they are actually abandoning their morals, and prejudice is not what's behind people's opposition to gays being in romantic relationships.  He states that the simple reason is because it's Biblical; the Bible says it shouldn't be done so it shouldn't be done.  S2 then points out that if that is someone's belief then that's fine, but banning someone else from doing it due to that belief is imposing their views on others, which is wrong.", "Natural_Summary_Text_1": "S1: Religion is a good tool to guide one's own actions, but not for telling others how to live. People have been prejudiced against homosexuals for a long time. Moral or religious prejudice is still prejudice. A person can claim a moral or religious stance without having one. You cannot justify an anti-gay agenda on morals or religion. An anti-gay stance on the grounds of religious belief is prejudice. Prejudice based on religious belief implies that a religious person's acts of prejudice could have a negative impact on homosexuals, because they believe that being gay is morally reprehensible. \r   \r  S2: Prejudice is a fact of human existence. Christianity is a moral system. When people claim religion in morals, they abandon that moral system. It is religious belief - not prejudice - that makes one take an anti-gay stance. The Bible says that homosexuality is wrong, so if you believe in the Bible as your moral canon, then you believe that homosexuality is wrong as well."}, "Key": "1-5811_79_77__80_84_87_91_92_95_96_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes that new England and New York will have gay marriage within the next few years and that the west coast might come soon after. They argue that after this time period, gay marriage legislation will stop for the next twenty years or so and that thirty states already define marriage as between one man and one woman. They do not believe that the supreme court would overturn gay marriage bans as unconstitutional and believes that states will ultimately be the ones to recognize whether it should be legal or not. They argue that current marriage laws are disputed between states and have been for decades and believes that the courts will be unable to intervene.\r  S2 believes that a federal recognition of gay marriage will be soon coming, and argues against S1's claims on the basis of Roberts and Alito being constitutional literalists. They believe that there is enough support in the Supreme Court to follow the constitution as written and that it will find any laws prohibiting gay marriage unconstitutional as a result.", "Natural_Summary_Text_4": "S1 and S2 are pondering the future of gay marriage laws in the United States.  S1 posits that States on the East and West Coasts will have gay marriage laws, but that mosts states will be able to prevent them with laws of their own which define marriage as between a man and a woman.  S2 is optimistic that the Supreme Court will find State laws that ban gay marriage unconstitutional if Congress acts to remove DOMA [Defense of Marriage Act].  S1 questions why the Court doesn't find DOMA unconstitutional, to which S2 asserts it has not had the opportunity to do so yet.  S2 also argues that choice of law rules in the various States will result in gay marriages not being recognized in States where there is no gay marriage, and that States have historically already done so on that basis.  He further asserts that resort to choice of law rules means that the FFC [Full Faith and Credit Clause] of the Constitution is not addressed in this context.", "Natural_Summary_Text_3": "S1 believes New England and New York will pass gay marriage and the West Coast will as well; however, S1 also believes the influx of states to recognize the unions will drop off for as many as 30 years.  S1 also believes the removal of DOMA will not effect the outcome nationally advising each state has a right to pass or not pass in the state as well as the fact one state does not have to recognize another state's laws; meaning, just because someone is married in New York does not mean Pennsylvania would have to recognize that marriage. S1 feels courts will rely upon choice of law doctrine for guidance.\r  \r  S2 does not agree with this information and believes if DOMA is removed gay marriage will be passed nation wide.  S2 also feels the majority of Justices will vote pro gay marriage should DOMA be removed from the equation.  Also, there is a belief each state will eventually recognize the unions entered into in states which do allow gay marriage.", "Natural_Summary_Text_2": "Two people are discussing gay marriage.  S1 states that in the next 20 years the wave of gay marriage legalization will be over, to which S2 states that if Congress removes the Defense of Marriage Act, the full faith and credit clause is a clear constitutional mandate.  S1 rebuts saying that even without the federal DOMA, the choice of law doctrine means that states can choose not to recognize gay marriage, or even be forced to recognize another state's gay marriage.  He also states that the full faith and credit clause has never been used in that way, and due to the lengthy legal argument involved it is unlikely to be used.  To contradict this, S2 states that each Justice will vote to side with gay marriage, and there is a current tradition of one state respecting another's marriage license when it comes to heteros, a tradition that will be kept if gay marriage laws are passed.", "Natural_Summary_Text_1": "S1: Legally, it is complicated to legalize gay marriage in all states, as DOMA is in place and states have chosen not to recognize other state's marriages for decades.  Attempts abide by the FFC clause to in respect to marriage (even before DOMA) require such lengthy legal arguments that they are rendered prohibitive. The choice of law doctrine must be considered and DOMA could be found to be unconstitutional by vote of the SCOTUS. How will states use the choice of law doctrine so that the FFC clause does not apply? \r  \r  S2: If Congress removes DOMA, a vote for legal gay marriage will pass quickly, and certain justices of SCOTUS already approve of gay marriage. DOMA has yet to be declared unconstitutional because there has yet to be a case made to challenge DOMA in the courts, so it has not been decided upon by SCOTUS. The choice of law doctrine trumps the FFC clause in cases of marriage contract and there is a current tradition of respecting other states marriage licenses for"}, "Key": "1-8834_7_6__8_9_10_11_13_15_18_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes that since support for marriage equality is growing, it is only a matter of time before the majority votes in its favor. This person uses the DC council votes as evidence to support this as well as the fact that five states have passed gay marriage legislation. They state that any step towards viewing homosexuals as normal people is a good thing, and that even viewing civil unions in a positive light would and could be enough.\r  S2 does not believe that marriage equality is something that the majority of the voters wish to see enacted. This person argue that any legislation put into motion has been pushed around the voters, and never accounted for on an actual ballot. They refute S1's argument that five states have passed gay marriage legislation on the grounds that it was not done via the voters, and never actually put on a ballot. They argue that if homosexuals were willing to simply accept civil unions that are equivalent to marriage, they might find stronger grounds for legal acceptance.", "Natural_Summary_Text_4": "S1 has posted news of the DC Council voting to authorize gay marriage and is celebratory about it.  S2 (JP) asserts that the politicians will pay a price and that the matter will be overturned when it is put to a vote.  He argues that a majority of people, including himself, would support laws providing rights and benefits for gays who elect to enter into civil unions, but not gay marriage.  He asserts no electorate would vote for gay marriage.  S1 refutes the suggestion by noting that 5 States had already approved gay marriage.  He also notes that gay marriage laws would not force heterosexuals to enter into them or attend gay weddings.  S2 seemingly corrects S1 by noting that the States in question had not put the issue to the general public for a vote.  S1 states that he would be happy with civil union laws, and each of them agree that the gay community has a PR problem and that many homosexuals are actually boring and inconspicuous.", "Natural_Summary_Text_3": "S1 announces the vote to support gay marriage in DC and congratulates the District.  S1 feels the majority of society does support marriage equality and will vote for it advising five states had already voted for and passed same sex unions.  S1 advises they would be happy to accept the title Civil Union as long as the same rights were extended which are given to hetero couples.  S1 also acknowledges the negative image gays have received is part of the reason some will not accept the concept of gay marriage an advises work is needed to change these stereotypes in order to move forward.\r  \r  S2 believes once brought to a public vote, marriage equality will not be passed and believes a majority of people would support civil unions but not marriage of same sex couples due to insurance benefits and other benefits afforded to married couples.  He/she does not support the argument of five states having voted on gay marriage but instead believes these were passed without a ballot vote. S2 agrees.", "Natural_Summary_Text_2": "Two people are discussing gay marriage.  S1 states that people in support of marriage equality is growing, and he contends that equality will soon stand on the side of the majority.  S2 retorts that gays lose every time gay marriage is put to a vote in a ballot, and that gays need a better PR strategy.  He also states that majority of people will support civil unions with the same benefits but not marriage and there will be repercussions due to the efforts to give tax money to federal employee's same sex partners despite the Defense of Marriage Act.  To contradict, S2 states that so far 5 states have passed gay marriage laws, and that gay people pay their taxes just like everyone else.  He also states that the gay community is not a bunch of promiscuous sex crazed people.  S1 rebutts by stating that in those 5 states, gay marriage was not put to a ballot, but forced through the court or legislature.", "Natural_Summary_Text_1": "S1: Washington DC' s city council recently legalized gay marriage. People's support of gay marriage has been growing steadily in the past ten years, and will soon be the majority opinion. Five states have already legalized gay marriage. Those opposed to gay marriage may view gays as promiscuous and sexual deviants, but most gay men are assuredly quite normal. Civil unions will not be accepted in place of marriage, as they do not allow the same legal rights as marriage.\r   \r  S2:  Councils and legislatures may vote in favor of gay marriage, but it has yet to be the majority vote of the people. Gay marriage should be played in a positive light by its supporters, because the current public perception of gay men is that they are promiscuous and lead a \"gay lifestyle\" that is offensive. Anti-gay marriage supporters will support civil unions in lieu of gay marriage, and homosexuals should be satisfied with that."}, "Key": "1-9522_9_1__12_13_32_36_49_52_53_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 supports gay marriage. He states that at least two men in a committed relationship practice fidelity unlike heterosexuals with more than one wife. He believes fidelity to be part of the normal American attitude, or at least of Christians. He thinks opposition to gay marriage goes beyond party lines and wonders why people are so opposed to it. S2 believes those with more than one wife can still be committed. He gives the results of a poll in which 59 percent of Democrats are against gay marriage. He questions if Democrats are extreme Christians. He views those that favor gay marriage as forcing it upon others and believes homosexuals for gay marriage to be heterophobic as those against gay marriage are seen as homophobic.", "Natural_Summary_Text_4": "Two people are discussing gay marriage.  S1 states that two men in a loving, committed relationship practice fidelity, unlike the man who has one wife for each day of the week.  He questions what S1's problem with gay marriage is and why he opposes it.  S2 questions how S1 knows that the man who has 1 wife for each day of the week isn't committed to them and vice versa.  He also references polls that state that a majority of Americans and even democrats do not think that marriages between homosexuals should be legal.  He also states that heterophobes, who are the people who oppose the banning of gay marriage, want to foist gay marriage upon the rest of America.", "Natural_Summary_Text_3": "S1 argues that two men in a monogamous homosexual relationship is more normative than a man in a heterosexual relationship with multiple women, citing fidelity as a normative attribute of relationships in America. In response to the poll cited by S2, S1 claims that opinions regarding homosexual marriages extend beyond political party lines.  S2 cites a Harris Interactive poll from 2003 showing that 62% of Americans did not think homosexual marriages should be recognized as legal. He claims that advocates of homosexual marriage are heterophobes trying to force homosexual marriage onto America. He claims that if people have the right to support homosexual marriage, then  other people have just as much right to oppose gay marriage due to the freedoms described in the US Constitution.", "Natural_Summary_Text_2": "S1 said that when it comes to the word \"normal\", fidelity should be looked at and many gays have fidelity in their relationshipso. Isn't fidelity part of the american attitude of \" normal \"?, he said. He questioned S2's labeling of gay people as heterophobes. He asked S2 what his problem was, why he personally did not want gay marriage.    S2 quoted a CNN poll which found that many people do not want gay marriage, includingm.  He said that when people are opposed to gay marriage  they are often called a homophobe. When a person is opposed to the banning of gay marriage, they must therefore be a heterophobe. He said that he has a right be against gay marriage.", "Natural_Summary_Text_1": "Two people are discussing gay relationships.  S1 is in favor of these unions while S2 does not support them.  S1 compares homosexual relationships to those of men who practice multiple marriage contending homosexuals are more committed to fidelity than those who believe in multiple marriage.  S2 begs the question of how anyone can say that a man who believes in and practices multiple marriage does not love all of his wives.  S2 cites a 2003 study advising at that time, 62% of Americans were not in favor of gay unions.  S1 believes the roots are deeper than that particular poll.  S2 feels he has a Constitutional right to be opposed to gay marriage as well as gay people themselves."}, "Key": "1-788_17_16__19_20_21_22_23_26_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes marriage to be both a legal contract as well as a religious ceremony and thinks the government and society is stuck in this duality. He thinks the courts must deal with this and different religions may do as they wish. Winning argument from states that declared banning gay marriage unconstitutional, he says, are based on state constitutional provisions that closely follow the federal constitution. He thinks gay rights are a real test of the constitutional system. S2 thinks that violating a state constitution has nothing to do with the federal one and that many state constitutions give rights, such as prohibiting discrimination against gays, that the federal one does not grant. He thinks it should always be clear which constitution is being discussed.", "Natural_Summary_Text_4": "Two people are discussing gay marriage and the Ccnstitution.  S1 contends that eight out of nine state supreme courts that have taken up the issue has ruled banning same-sex marriage unconstitutional, based on their state constitutions that closely parallel the federal one.  He states that the nature of marriage is both legal and religious, and that the courts only deal with the legal aspect.  S2 states that the Massachusetts ruling was based on a specific provision in their constitution that prohibits discrimination based on sexual discrimination, which is not founded in the federal constitution, to which S1 states the ruling was on the equal protection grounds.  S2 then states that many state constitutions guarantee rights that aren't in the federal constitution.", "Natural_Summary_Text_3": "S1 states that the majority of the supreme court cases which have addressed a ban on same-sex marriage have deemed the laws unconstitutional. He recognized the difficulty imposed by the fact that marriage is both a legal contract and a religious ceremony. He claims that although the cited cases involved state constitutions, the ruling were based on provisions very similar to the federal constitution.   S2 argues that supreme court decisions regarding violations of state constitutions are irrelevant to the federal constitution. He claims that the Massachusetts ruling was based on a provision prohibiting discrimination based on sexual preference which is not found in the federal constitution, but later admits that he was in error and that it was based on prohibiting discrimination based on sex.", "Natural_Summary_Text_2": "S1 stated that eight out of nine state supreme courts have found that disallowing same sex marriage is unconstitutional and these states had constitutions which are similar to the U.S. Constitution. There continues to be the dual nature of marriage with the courts having to decide about it legally. Now the religions have to interpret it as they will. He closed with, \" Gay rights is a real test of our constitutional system, and, so far, we're not passing with flying colors.\"  S2 questioned if they found that it violated their State constitutions alone or if it was the violation of the Federal Constitution that mattered in these cases. Many state constitutions guarantee rights that aren't in the federal constitution.", "Natural_Summary_Text_1": "S1 and S2 are discussing the issue of marriage equality.  Both subjects seem to be on the fence with the issue.  S1 cites that eight of nine supreme courts have contended same sex marriage to be unconstitutional.  S2 questions how gay marriage would violate someone's constitutional rights.  S1 advises the bulk of the arguments were based on state constitutions which mirror the federal constitution.  S2 uses the example of Massachusetts' allowing gay marriage under its state constitutional law prohibiting discrimination based on sexual orientation.  S1 contends there is no such piece to the Massachusetts constitution.  S2 then concedes he was incorrect about the citing and the law actually banned only discrimination based on gender and not sexual orientation."}, "Key": "1-5320_25_16__33_34_35_36_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 talks about gay marriage leading to polygamy and that's why the push for the Constitutional Amendment banning gay marriage has a provision banning polygamy. S1 thinks King David having more than one wife was based on Old Testament law and Jesus believed in having one wife. He thinks if it's right wing to support a ban on gay marriage/polygamy then it's left wing to oppose it. He states some Democrats wanted to spend more than Bush. S2 thinks if it was okay for King David to have more than one wife it should be fine for him, and brings up that Jews don't follow the New Testament. He believes anything opposed to one wing must be the other. He thinks conservatives spend more money.", "Natural_Summary_Text_4": "Two people are discussing gay marriage and law. S1 states that gay marriage will ultimately lead to a marriage bill for polygamists.  He states King David had multiple wives under the Old testament, and that divorce laws were granted by Moses because of the hardness of people's hearts. In addition, he states that the left wing aren't against deficits, since numerous Democrats want to spend more than Bush.  S2  states that America already has serial polygamy due to the liberal divorce laws. He doesn't remember Jesus saying polygamy was wrong, and even though he referred to a single wife, basing a whole social convention on one word out of the book is absurd. He also states that even conservatives criticize Bush's spending.", "Natural_Summary_Text_3": "S1 claims that legalizing homosexual marriage would eventually lead to the legalization of polygamous marriage, citing a proposed constitutional amendment that bans both gay marriage and polygamy. He cites a passage from the Bible where Jesus said a man should be cleaved to his wife.  He claims that if people on the right wing support a ban on gay marriage, then the left wing must oppose a ban on gay marriage.  S2 cites instances of God supporting polygamy in the Bible. He claims that we already practice serial polygamy because of America's liberal divorce laws. He also points out the logical fallacy in S1's argument about the left and right wing, stating that one wing supporting something doesn't mean the other wing opposes it.", "Natural_Summary_Text_2": "S1 stated that the legalization of gay marriage would lead to polygamists getting the right to marry so many laws against gay marriage also outlaw polygamy.  He then said that the Right Wing was against both gay marriage and polygamy while the left wing was for it. He then said that many Democrats were bigger spenders than the Republicans.  S2 said that it was funny to him that those for less laws on the books and a return to the Old Testament practices including polygamy are now considered left wing.  He said that he does what he thinks is right and believes that Jesus is not against polygamy. He said too that the past Democratic presidents left far fewer deficits than the Republican presidents.", "Natural_Summary_Text_1": "Two people are debating the topic of gay marriage rights.  S1 believes allowing gays to marry will open up the door to legalize other types of marriage such as polygamy.  S2 holds to the theory that if King David was able to have multiple wives, why then should the common man not be able to, especially if religion is to now be the basis for all laws.  S1 contends that practice was of the Old Testament and is no longer considered commonplace.  S2 feels S1 is too left wing to entertain the thought of allowing gay marriage, but uses religion as the basis even though there are so many contradictions between the Old Testament and what is considered the New Testament."}, "Key": "1-788_12_9__15_31_35_40_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 compares gays to Sodom and justifies it by saying there are bath houses in San Francisco with 100 men performing unprotected sex on each other. He doesn't think it is homophobic, but rather, a fact. He believes they were closed down when AIDS came about but are being opened again. He states it can be found by Google search. S2 thinks this is rumors and misinformation. He questions if S1 got the information from Focus on the Family. He thinks there is no proof of that and it's a homophobic opinion. He believes one should have proof of any claims they make. He furthermore believes that the things that went on in the 80's are not relevant to what today's society has going on.", "Natural_Summary_Text_4": "S1 thinks a better comparison is Sodom. He argues that 100 men in a daisy chain performing unprotected sex on one another would be in comparison to Sodom. Everyone else should condemn it. He informs S2 of the bathhouses that can be looked up, they were shut down when AIDS first came out and are flourishing once again. He then asks S2 to go to a cite link to see how gays are trying to reopen bath houses in San Francisco.  S2 argues that S1's comments make him a bigot. He then proclaims that he just doesn't believe anything that S1 is saying. He determines that S2 is making claims without any proof and he wants the claims justified or taken back, then calls S1 irresponsible.", "Natural_Summary_Text_3": "S1 and S2 are discussing gay marriage and S2's opposition to it.  S1 feels remarks made by S2 point more to his being a bigot rather than simply opposing gay marriage.  S2 makes reference to a Yahoo search producing information of gay bath houses operating in San Francisco saying 100 males in these places are practicing unprotected sex on one another and this is wrong.  S1 contends the remark pertaining specifically to 100 men shows this information is based more on opinion than fact.  S1 urges S2 to read the article he cited to which S2 responds what is being done in one community to re-open gay bath houses has no bearing on whether or not gay marriages should be permitted.", "Natural_Summary_Text_2": "Two people are discussing gay rights.  S1 compares the behavior of the gay community to Sodom.  He references how in the 80s bath houses in San Francisco were closed down when AIDS first came out; in these bath houses 100 men in a daisy chain performed unprotected sex on one another.  S2 retorts that S1 is relying on rumors and misinformation, and since he doesn't have proof of the claim he shouldn't make it.  He states that its comments like these that characterizes a homophobic bigot, where the actions of a small group of gays in California are being equated to the behaviors of all gays.", "Natural_Summary_Text_1": "S1 is against gay rights apparently because of the biblical story of Sodom, and the sexual activities S1 perceives to have occurred in San Francisco bath houses, which S1 asserts the current gay community is trying to re-open.  He argues that the gay community is going back to unprotected sex and that a daisy chain of 100 men perform unprotected sex on each other in the bath houses.  S2 challenges the assumptions, specifically finding the daisy chain of 100 men a less than credible assertion and admonishes S1 to use facts to support his arguments, not opinions.  S2 also notes that S1's apparent fascination with bath houses is not relevant to the gay rights topic under which the posts are being entered."}, "Key": "1-3134_11_10__12_13_14_28_43_47_60_62_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 does not agree with the comparison of gay rights and gay marriage to African American civil rights. He believes it is an insult to all African Americans. He asks for references of Coretta Scott King and Julian Bond being for gay marriage and is surprised to get them. He then amends his statement from all African Americans to most African Americans. He goes on to wonder what MLK would have had to say on the subject. He considers MLK to have far more credibility than either of the two people referenced. S2 doesn't agree all African Americans are against gay marriage or that it's an insult and posts two different reference links to both Coretta Scott King and Julian Bond being for gay marriage.", "Natural_Summary_Text_4": "S1 doesn't want people to compare a race of people's fight for equal rights to a class of people determined by their sexual orientation. She then asks for a cite link that says African Americans are for gay marriage. S1 claims that S2 can't come up with a reference link. Then, she turns her question to African Americans and asks how Martin Luther King Junior would have felt about this issue- he has more credibility than all of her examples.  S2 argues that Coretta Scott King and Jillian Bond are against gay rights. She lets S1 know that cite links have been shared many times. She then shares a couple of links for S1 to see and then replies that no one will ever know for sure.", "Natural_Summary_Text_3": "S1 and S2 are calmly discussing gay marriage and the comparison between the gay community and African Americans and their struggle for equal rights.  S1 believes it is an insult to all of African American society to compare these two plights.  S2 provides a website containing information advising Coretta Scott King supports gay marriage equality. S2 also advises he/she has given this website example several times in the past.  S1 changes his statement of the comparison's being an insult to all African Americans to some but also poses the question of hour Reverend Martin Luther King would feel about gay marriage advising his opinion would mean more than either of the examples cited by S2 which also included Jullian Bond.", "Natural_Summary_Text_2": "Two people are discussing whether or not the civil rights activists are for gay marriage.  S1 states that the comparison of a race of people's fight for equal rights and a class of people determined by their sexual orientation should not be made, as it is an insult to all African Americans. He also wonders how Rev. MLK would feel about the gay rights issue.  S2 retorts by saying that Coretta Scott King and Julian Bond are both for gay marriage.", "Natural_Summary_Text_1": "Prior to this dialog, S2 apparently likened the gay marriage movement to the Civil Rights movement of the African American community.  S1 is offended by the alleged analogy, finding a material distinction between race and sexual orientation.  She suggests that to view it otherwise would be an insult to all African Americans.  S2 points out that two presumably prominent African American figures, Corretta Scott King and Jullian Bond, are pro-gay marriage.  S1 questions whether they do in fact support gay marriage, and S2 provides links to support his assertion.  S1 accepts the evidence and concedes that some African Americans may not be as insulted by the analogy and wonders how Martin Luther King felt about the issue of gay marriage."}, "Key": "1-3124_9_8__11_12_15_16_19_25_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 agrees that when a husband is part of a heterosexual relationship a gay husband is not legally recognized in the same category. His statistics support the fact that 60,000 gay couples would get married if they were allowed. The equal rights aren't there when it comes to same sex marriage. Welfare is referenced when making a point about political muscle. American freedom never existed and no one can't argue that FDR's public opinion on the role on the federal government. S2 thinks that it is a problem because same sex marriage has never been legally recognizes is a big problem.  The debate is more for straight couples than it is about gay relationships. He notes that there are logical reasons for marriage discrimination.", "Natural_Summary_Text_4": "Two people are discussing the legal definition of marriage.  S1 contends that terms such as gay husband, gay wife, and gay spouse are not legally recognized because they do not meet the legal criteria of one man, one woman.  He compares it to the fact that a cat doesn't meet the legal definition of a dog, and questions if we should change the legal definition of a dog just to appease the cat.  S2 contends that they are not legally recognized simply because they're gay, and it's circular reasoning.  He states that stating that marriage is heterosexual completely ends any debates, and he questions the logical reasons for marraige discrimination against gays and lesbians.", "Natural_Summary_Text_3": "S1 and S2 are discussing the topic of gay marriage.  S1 feels the term husband is not recognizable in a same sex relationship nor is the term wife.  S2 feels the only reason these terms are not recognized is because the couple is gay and gay marriage is not yet recognized legally.  S1 holds that the marriage is viewed legally as one man and one woman, not same sex; comparing the theory that a cat is not a dog simply because one chooses to call it so.  S1 also cites that according to the CBO, 600,000 gay couples would want to wed if legislation were passed to allow it.  S2 wants logical reasons for now allowing gays to marry.", "Natural_Summary_Text_2": "S1 claims that gay husband, gay wife, and gay spouse are not legally recognized categories because homosexual unions do not meet the legal criteria for marriage, namely that it occurs between one man and one woman. He claims that because of this, many people view the term gay marriage as an oxymoron. He uses the example that a cat cannot be called a dog just because someone wants to. He admits, however, that there is a possibility that gay unions might eventually be recognized with the same rights as heterosexual unions. S2 asks why a homosexual union is not legally recognized. He claims that appealing to the traditional definition of marriage is circular reasoning and therefore insufficient to explain why homosexuals are being discriminated against.", "Natural_Summary_Text_1": "S1 does not believe that anyone outside of a heterosexual marriage should be considered a husband, wife or a spouse because legally they are not. This person believes that the term gay marriage is an oxymoron because marriage, legally, to them, is only between one man and one woman. They believe that prior to Roosevelt, society did not accept the idea of state welfare as constitutional, but because people were willing to sacrifice freedom for security, they eventually caved to his ideas.  S2 does not believe that marriage is simply between one man and one woman, and that the entire reason behind the debate is so that homosexual marriage can and will be legally recognized. They do not see a reason for discrimination against homosexual marriage."}, "Key": "1-2583_34_32__51_56_62_65_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S2 thinks that most Christians in this country oppose civil marriages for gay rights. Evangelical Christians have been opposed and do speak out against gay marriage. They go on to announce that a state constitutional amendment is being passed to preclude same sex marriage and civil unions. That means that same sex couples will be seen in the same light as straight couples. S1 defends the Christians by stating that they do not try to discriminate on gay marriages, and says that they aren't trying to ban gay marriage. the GUEST thinks it is laughable to think that they are that united in one particular event or fight together for good. They think that the GUEST has blown the whole conversation out of proportion.", "Natural_Summary_Text_4": "Two people are discussing whether or not Christians want to ban gay people.  S1 contends that most Christians are not trying to ban the decriminalization of same-sex, it was just an accusation made.  He contends that evangelicals are rarely united for anything, let alone banning gay people.  He also states that gay lobbyists have long stepped over the line of simply counter-attacking with their defense.  S2 retorts by stating that a majority of self-identified Christians in the U.S. oppose civil marriage for gay people, among other things such as civil unions, gay adoptions and anti-discrimination laws.  He states that in Spain, they don't do that, and he points out a state constitutional amendment trying to prevent same-sex marriage.", "Natural_Summary_Text_3": "Two people are discussing gay marriage.  S2 feels Christians are trying to, in a sense, ban gay people by banning all activities pertaining to gays such as marriage, civil unions, and gay adoption.  S1 feels this is not the case and that most Christians don't treat gay people in this fashion.  S1 also feels the issue at hand is not being discussed as the forum began with speaking about the gay pride industry.  S2 supports his theory by citing the constitutional amendment to ban both gay marriage and same sex civil unions.  He feels this is the Christian equivalent of banning gay people by oppressing their lifestyle.  S1 feels this is a weak argument which gay lobbyists have overused.", "Natural_Summary_Text_2": "S1 claims that most Christians are not actively attempting to ban homosexuality and supports this claim by citing the fact that Evangelical Christendom as a whole is rarely ever united on anything, so they could not all be opposed to homosexuality. He proposes that gay lobbyists have crossed the line from counter-attacking to simply attacking Christians. S2 argues that most Christians do oppose same-sex marriage, civil unions, gay adoption, and anti-discrimination laws. To support this point, he cites the various state constitutional amendments that ban same-sex marriage and civil unions. He also suggests that this opinion on the topic of homosexuality is unique to America, claiming that Evangelical Christians in Spain are not actively opposed to civil unions despite sharing the same religious belief systems.", "Natural_Summary_Text_1": "S1 does not believe that most Christians are trying to ban homosexual unions, and that those accusing them of doing so are doing so falsely. They believe that homosexual lobbyists have gone beyond being defensive and are actively attempting to attack evangelical Christiandom falsely in order to justify their arguments.  S2 believes that the majority of self-identified Christians in the United States in fact, do oppose civil unions for homosexual citizens. However, they point out that in other countries such as Spain, they might not, but in general, the belief is the same globally. They refute S1's claims that they are not trying to ban homosexual unions by pointing out that the state constitutional amendments being passed are intended to preclude same-sex marriage and civil unions."}, "Key": "1-35_148_147__149_151_152_155_156_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 thinks that the divorce rate among the young in the U.S. is actually dropping instead of rising, despite what everyone thinks or says. He admits that young people get divorced because they eventually realize that they made a mistake. Gays are all promiscuous which lead to high divorce rates, plus you can't compare gay couple relationships with straight relationships. The debate is ceased by stating that no one can actually know what percentage of the population of the U.S. is gay. S2 disagrees with the statements made and gives links to info which is related to. The GUEST thinks that heterosexual marriages end in divorce nearly fifth percent of the time and thinks straight couples are no better at staying together than gays are.", "Natural_Summary_Text_4": "Two people are discussing the divorce rate in the US.  S1 contends that the high divorce rate is due to the high rate of young people who get divorced.  He states that the rate of people who get divorced who have been married over five years drops dramatially, and he states that statistics prove that gays in general are much more promiscuous then straight people.  S2 retorts by stating that young people and young marriage are not the same, and that couples in general who divorce do so more often in the first five years, regardless of age.  He also states that the heterosexual divorce rate is 50%, and heterosexuals are not better at staying together then people expect homosexuals to.", "Natural_Summary_Text_3": "Two people are discussing the rate of divorce among heterosexual couples versus that of gay couples.  S1 feels the divorce rate in the United States is severely overestimated while S2 adheres to the statistics that show heterosexual marriages end in divorce almost 50% of the time and of those divorces, most are in the first five years.  S1 feels the numbers are warped due to the large number of young couples who get married and then decide it was a mistake and get divorced.  S1 feels gay people are more promiscuous than heterosexuals.  S2 provides several cites several websites which show most divorces of hetero couples are due to adultery.  S1 refuses to view the articles calling them propoganda.", "Natural_Summary_Text_2": "S1 suggests that statistics on divorce rates are skewed by the high proportion of young people who end up getting divorces. He claims that the divorce rate drops significantly if you focus only on couples who have been marriage more than five years. He also claims that statistics show that homosexuals are more promiscuous than heterosexuals and that this would lead to a higher divorce rate for same-sex marriages. S2 argues that the age of the spouses is irrelevant and that more than half of all heterosexual marriages end in divorce and suggests that it would likely be no difference for same-sex marriages. He also rejects the comparison of promiscuity between heterosexuals and homosexuals by pointing out that only heterosexuals are legally allowed to marry.", "Natural_Summary_Text_1": "S1 believes that the divorce rate in the United States is blown out of proportion by the rate of very young people who get divorced and states that the percentage of people who have been married over five years drops dramatically. They also believe that homosexuals are more promiscuous than heterosexuals.  S2 believes that young people and young marriages aren't really the same thing, and that the real facts are that those who divorce do so more often within the first five years of marriage, regardless of age. They refute S1's argument by pointing out that heterosexual marriages still end in divorce around 50% of the time. They don't believe that homosexual relationships should compare to heterosexual marriages because only heterosexuals are legally allowed to marry."}, "Key": "1-3358_14_11__16_18_19_24_26_28_32_36_45_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 apologizes for jumping the gun and misreading the one billion dollar surplus link. He/She admits that the civil debate issue about gays didn't have such of a a negative financial impact as they first thought. He then proposes concerns about what the moral and health concerns would be if we continue to do this with civility. S1 is more flexible with accepting societies standard of behavior and is also willing to let society as a whole determine what the limit of same sex marriage is. S2 was hoping to talk more about the fiscal concerns, and he also wants to know how same-sex marriage benefits society in practical ways. He also thinks that same sex marriage does, in fact benefit our U.S.", "Natural_Summary_Text_4": "Two people are discussing the benefit to society that same-sex marriage has.  S1 concedes that same-sex marriage does not have the negative financial impact that he thought it would.  He states his wish to move past fiscal concerns and move ont the the moral and health concerns of same-sex marriage.  S2 contends that he wishes to discuss the practical benefits.  He states that the discussion of \"morality\" is a safe ground because morality is relative and subjective.  S1 retorts by stating that he does not feel the need to impose his morality on anyone; he is willing to let society determine its own limits.  He also states his wish that S2 inform him of the benefits of same-sex marriage.", "Natural_Summary_Text_3": "Two people are discussing the financial effect of allowing for gay marriage.  S1 originally believed allowing gay marriage would have a negative financial impact on society as a whole.  He has since amended that belief due to information found in the CBO.  His reasoning for still supporting the ban on gay marriage has changed over to moral and health related concerns.  Although S2 is pleased with the concession of S1's former opinion, he believes jumping to the moral high ground still ignores other issues.  He would like to discuss the positive impact that allowing gay marriage would have on the country practically.  S1 advises while he is a defender of the Constitution, he does feel society should decide.", "Natural_Summary_Text_2": "S1 admits that he previously misrepresented a statistics, claiming that a particular study actually predicted a $1 billion surplus as a result of legalizing same-sex marriage. He claims that although this alleviates his fiscal concerns on the topic, he still objects to same-sex marriage on the grounds of moral and health concerns. S2 suggests that if S1 was wrong about the surplus he might also be wrong about other aspects of the issue of same-sex marriage. He suggests that it would be useful to discuss the ways same-sex marriage could benefit society instead of moving on to a discussion of morality since it is relative and subjective. S1 responds that he doesn't want to impose his morals on others, but believes in defending the Constitution.", "Natural_Summary_Text_1": "S1 concedes that there would be little financial impact on support for homosexual marriage, and would in fact supply a surplus. However, this person still desires a debate on moral and health concerns of the issue. They do not view themselves as someone who imposes their moral beliefs on others, and is willing to let society determine its own limits. While they vocally defend the United States Constitution as written, they also desire to be more flexible with public determined acceptance of behavior.  S2 would like to see this concession as a means to lead to a discussion on the societal benefits of same-sex marriage, however, they believe that S1 is attempting to hide behind their moral grounds because S1 sees it as relative and subjective."}, "Key": "1-2583_84_74__97_104_106_107_108_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing gay marriage.  S1 states that marriage is recognizing a family unit based on a natural heterosexual contract.  S2 counters by asking about artificial insemination.  S1 states that it is not about the way children are created but about the nature of the relationship, which remains natural. S2 then questions which god would enforce marriage when the ceremony is done by a judge, and he states that polygamy is a way for bisexuals to stay under the radar.  He states that the US has been dealing with polygamy for years, with very few prosecutions.  S1 contends that polygamy wouldn't count because it is one man or women married to multiple members of the opposite sex.", "Natural_Summary_Text_4": "S1 thinks marriage is recognizing a family unit based on natural heterosexual contact. When questioned about artificial insemination by S2 he replies that it is not the way that the children are created that is important. It is the nature of the relationship. He thinks that values are what guide people and everyone thinks theirs are correct. He believes allowing gay marriage forces values on society by forcing them to accept it. S1 questions what God enforces marriage rules if it is performed by a judge. He states that there is a Congo tribe in which warriors marry other warriors because being with a woman may make them less feared. He thinks that not allowing gay marriage is discrimination and forcing morals on other people.", "Natural_Summary_Text_3": "Two subjects are discussing the issue of gay marriage rights.  S1 is anti-marriage redefinition while S2 is pro-gay marriage.  S1 feels marriage is classified by a heterosexual contract and is not legal or natural if it involves couples of the same sex.  S2 challenges the religious aspects of S1's belief because God is not involved in the ceremonies performed by a judge and not in a church.  He also offers information in regard to a tribe in the Congo which required its warriors to marry other warriors as they believed relations with women would soften them.  S1 advises values are always believed to be correct by the person or group who practices them. S2 doesn't think morals should be forced.", "Natural_Summary_Text_2": "S1 views the marriage arrangement as society recognizing a family unit based on a natural heterosexual contract. He explains that natural means between a man and a woman. He accepts that everyone has their own values but it is unreasonable to expect that all values are socially acceptable. He believes legalizing gay marriage is a form of forcing society to accept gay behavior.  S2 questions the validity of using the term natural to define marriage. He uses an example of same-sex marriage in a Congo tribe to show that marriage is defined by the needs of the social group. Banning gay marriage is forcing one set of believes onto others. He argues that legalizing gay marriage does not force gay values onto anyone.", "Natural_Summary_Text_1": "S1 makes the claim that marriage is defined as a family unit based on natural heterosexual contact, and suggests that it is the heterosexual nature of the relationship that is important, not how the children are conceived within the relationship. He argues that homosexuals are attempting to force their morals on others by legalizing same-sex marriage, claiming that legalizing a behavior is a tacit form of acceptance that will affect society. S2 questions the religious basis of a civil ceremony like marriage, suggesting that the stipulations based on religious reasons would vary depending on the chosen religion. He also compares homosexuality to polygamy, claiming that polygamy has been unofficially accepted for years, and argues that maintaining the current same-sex marriage bans should be considered discriminatory."}, "Key": "1-1281_13_12__20_22_27_30_34_36_40_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing politics and gay marriage. S2 contends that modern liberalism has strayed from what Jefferson believed.  He states that Jefferson believed that liberty was threatened by a centralized government, and he would have opposed over-regulation.  Instead, the liberalism embodied by the Democratic party is opposite in stance, becoming anti-religion, over-regulatory and taken over by extremist interest groups, much like the Republicans were taken over by the religious right.  S2 states that he supports equal opportunity for people regardless of sexual behavior, but not the redefinition of marriage.  S1 contends that S2 is doing the same thing by effectively stating marriage is only for heterosexual people who use sex only for procreation.", "Natural_Summary_Text_4": "S1 supports gay marriage and thinks S2 is being hypocritical by saying he agrees with fairness and honest advocacy but excluding gay people from it. He implies with sarcasm that S2 thinks marriage is only for heterosexuals that wish to reproduce and  only uses religiously approved positions. S2 wishes modern liberalism were more like Jeffersonian liberalism. He states decentralization was a big theme for Jefferson and he would have opposed over-regulation. He says he agrees with taking care of the elderly, fairness, and freedom. However, he does not support redefining marriage, and thinks modern liberalism has been taken over by special interest groups, such as the gay lobby, in the same way the Republicans were taken over by the religious right in the 1980's.", "Natural_Summary_Text_3": "Two subjects are discussing liberalism and its similarities or lack thereof to the Jeffersonian belief system.  S2 believes they are nothing alike while S1 believes they have many similarities.  S2 advises Jefferson believed liberty would be threatened by a centralized government.  He also advises liberalism is not based on the same theory.  S1 believes the opposite stating the opinion that the group believes in fairness for all, except the gay community.  S2 advises he supports equal opportunities for all people despite their sexual preferences; however, he does not support the redefinition of marriage to allow for gay unions.  S1 feels this is a double standard because it is basically saying equal rights for all but gays still cannot marry.", "Natural_Summary_Text_2": "S1 asks S2 to clarify his statement about Jeffersonian liberalism. He believes that S2 is hypocritical about supporting Jeffersonian values on \"making sure there is fairness\" and \"honest advocacy\" for the people while opposing gay marriage.   S2 believes that the term \"liberalism\" has a different meaning different compared to the time of Thomas Jefferson. He said that Jefferson is for decentralization of government which is the opposite stance taken by the Democratic Party. He believes that liberalism has been hijacked by extremist special interest groups such as the gay lobby. The Democratic Party today is favoring special interest groups instead of engaging in honest advocacy for the people. S2 supports equal opportunity for gay people, but not the redefinition of marriage in the US.", "Natural_Summary_Text_1": "S2 suggests that he would be liberal if modern liberalism was actually Jeffersonian, meaning that democracy is viewed as the power of the people. He cites Jefferson's beliefs that war can be necessary in order to maintain liberty and that centralized government is a threat, and points out how these beliefs are the opposite of modern liberalism. He further claims that the current Democratic party is anti-religion, over-regulatory, and controlled by the gay lobby. S1 interprets S2's argument as a claim that fairness should exist for all people except homosexuals. S2 clarifies that he does support equal opportunity for all people regardless of their sexual behavior, but that he is still opposed to redefining the traditional view of marriage by legalizing same-sex marriage for homosexuals."}, "Key": "1-2844_35_33__36_37_38_39_41_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing whether a radical Christian group called the Dominionists exist.  S1 states that Jerry Falwell or Pat Robertson can confirm their existence, and questions whether they care about people or just about power.  S2 asserts that the only evidence are from radical left leaning groups, which he believes are making them up to generate fear.  He states that S1 cannot produce one objective or source by the Dominionists themselves that states their intention.  He challenges S1 to stop making assertions without evidence, and he states the left wing must lie and cheat to win because the truth is foreign to them, and that he can post that they are Satan Worshipers but that doesn't mean it's true.", "Natural_Summary_Text_4": "S1 believes there is a group called Domionists that care only about power  and not about people. He thinks one can learn about this group by looking at Jerry Falwell or Pat Robertson. S2 was unable to locate any information on the group other than articles by liberals. He believes radical leftists created the group as a way of promoting fear of Christians. He asks for objective evidence and thinks S1's lack of evidence proves there is none. Also, he thinks it is corrupt to post an article but withhold the source link. S2 says he could post an article stating that Democrats are really Satan Worshipers but that would not make it true, and any assertions made should be backed up with evidence.", "Natural_Summary_Text_3": "S1 and S2 are discussing Domionists.  S2 believes there is no such group and this has been made up to promote fear of Christianity.  S2 believes this because he is unable to locate a viable website or any other information supporting the group's being real.  S1 feels the group is real and that they are more concerned with the acquisition of power rather than people's interests. S2 feels these fears are being instilled by \"radical left\" wingers.  S2 also advises that earlier, S1 had posted an article related to the group; however, failed to cite the link so others could look at the whole thing for themselves.  S2 believes posting something on the internet does not make it be true.", "Natural_Summary_Text_2": "S1 implies that the Dominionist as a group is not interested in people's well-being but want to control people's lives. S1 believes that the Dominionists exists. He cites Jerry Falwell and Pat Robertson as sources that refer to the Dominionists. He tells S2 to do his homework in verifying the existence of the Dominionists.  S2 asserts that the Dominionists is a fictional group created by radical left-leaning groups to demonize Christianity. S2 said that he looked up Dominionist websites on Google but can only find articles about them on websites that promote liberal views. He challenges S1 to either produce the link to the source of a Dominionist article that S1 posted or delete the post as a lie.", "Natural_Summary_Text_1": "S1 suggests that a Christian sect known as the Domionists are focused only on gaining power, citing Jerry Falwell and Pat Robertson as his sources. S2 claims that he was unable to find any evidence of Domionists practices online except from left wing groups. He suggests that the Dimionists are not a real religious group, but rather are a group invented by left wing groups to make people fear Christianity, and further argues that left leaning individuals rely on lying to achieve their goals because they are unfamiliar with the truth. He also presents an absurd story about people on the political left being Satan worshipers in order to demonstrate how posting information without evidence to back it up does not make it automatically true."}, "Key": "1-6493_297_295__300_306_311_315_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing gay marriage and politics.  S1 states that no one in western society has recognized marriage rights for polygamists, to which S2 rebuts, stating that marriage is recognizing a family unit based on heterosexual contract.  S1 then states that in many anglo countries, it is not for a heterosexual contract, and in marriage with couples who cannot have children, it's not for a family unit either. He also states that single families is not natural.  S2 contends that European countries have many laws different than the US, but the world majority views it as about the traditional families.  He states that single parent is natural as husbands die early and gay rights is more about politics.", "Natural_Summary_Text_4": "S1 states that all sex is behavior. He points out that it is not just about heterosexual contact in many countries. He says there are many married heterosexual couples who either choose not to have children or can't, so marriage is not simply about having a family. He states the US is more similar to Anglo nations and in many of those gay marriage is legal. He says something isn't judged as good just because it is natural. S2 thinks marriage is recognizing a family unit based on natural heterosexual contact. He says that there are many laws different than the US in other nations. He thinks family is a basic unit traditionally consisting of two parents raising children. Homosexuals, he believes, are more political.", "Natural_Summary_Text_3": "Two people are discussing gay marriage issues.  S1 is in favor of gay marriage while S2 is against.  S2 cites the fact that gay marriage is already allowed in many countries and feels it soon will be in the state of Massachusetts.  S2 feels the US will not pass the laws so easily citing the fact that Hawaii has already banned the practice.  S2 also feels the issue of gay rights is more political.  He disputes S1's comparison between gay marriage and polygamy, which he fees could be the next thing allowed should gay marriage become commonplace.  S2 holds to the idea that it will be passed and passed soon.  S1 feels any headway will take many years.", "Natural_Summary_Text_2": "S1 asserts that polygamous marriage is not recognized by governments in Western societies and is unlikely to be recognized in future. S1 points to the trend to legalize gay marriage in western countries such as Netherlands, Belgium, and most of Canada. He points to high support for gay marriages among the 18-29 year-olds in the US. He argues that these show that legalizing gay marriage may happen in the future.   S2 asserts that marriage is recognizing a family unit based on a natural heterosexual contract out. He argues that even though some European countries allow gay marriage, 90% of the world bans gay marriages. He argues that the US is not Europe and is unlikely to move in the same direction on legalizing gay.", "Natural_Summary_Text_1": "S2 claims that marriage is defined as a family unit based on a heterosexual contract. S1 refutes this assertion, citing a number of countries which recognize same-sex marriage and compares the lack of reproductive potential for homosexual couples to a heterosexual couple that chooses not to have children or is unable to have children. He also argues that single parent families are not considered traditional and references a poll showing support for gay rights among the 18 - 29 demographic. S2 claims that a traditional family is composed of a husband and wife and that the laws of other countries are irrelevant to the laws of America. He argues that single parent families are natural and suggests that time will decide which side is right."}, "Key": "1-1281_12_11__15_21_23_25_26_28_6"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing the economics of gay marriage.  S1 states that gay marriage poses a tremendous new tax on the economy as it would create a new dependent class that doesn't presently exist.  He compares same-sex marriage to single couple roommates and states that if it isn't in the definition of marriage, it isn't marriage.  S2 states that since gay people pay into the same system, they should also benefit from it.  He states that by not allowing gay marriage, if a divorce occurs the state would have to care for the dependent partner, instead of the richer partner as in heterosexual marriages.  He also states that a federal marriage amendment to the constitution is a long shot.", "Natural_Summary_Text_4": "S1 believes gay marriage is about economics. It would create a new dependent class and be a large new tax on businesses, Social Security, and healthcare. He thinks same sex partners living together are roommates. Roommates are single and should not have marriage benefits. S1 states he is a Jeffersonian liberal and believes in the Constitution as written and the people's will. Most Americans, he thinks, are against gay marriage. S2 states that gay people pay into those same systems and believes they should also benefit from them. He believes there is an economic burden when same sex couples break up without legal recognition of the marriage. He states that same sex couples are not single and they are not the same thing as roommates.", "Natural_Summary_Text_3": "S1 and S2 are discussing the issue of gay marriage and the financial effect it will have on society.  S1 is against gay marriage due to the effects he believes passing such a law will have on society while S2 is in favor.  S1 feels allowing gay marriage would cause a dependent class needing more benefits of one kind or another.  S2 questions why gay citizens who pay into the economic system should also not benefit from them.  He also provides an analogy based on a marriage break up to support this, advising if gay marriage were recognized and there was a divorce, the spouse making more money would have to pay alimony instead of the other going to the state.", "Natural_Summary_Text_2": "S1 asserts that the push for gay marriage is driven by economics. Gay marriage can bring in new taxes. S1 describes himself as a Jeffersonian Liberal who believes in the application of the Constitution as it is written. He believes that the majority of Americans are against gay marriage. He believes that the majority will support less ambiguous laws that ban gay marriage.   S2 argues that legalizing gay marriage will alleviate the state's burden on support for the dependent spouse in the case of a break-up. Without gay marriage, the state has to support the dependent spouse. S2 feels that a federal amendment to the US Constitution is unlike over the next few years.", "Natural_Summary_Text_1": "S1 claims that the issue of same-sex marriage is an economic issue because it would have negative effects on businesses, social security, and the healthcare systems. He compares homosexual partners to roommates and and demonstrates that you can not make marriage mean whatever you want by explaining that he is not legally allowed to marry his dog. He makes it clear that he believes same-sex marriage is wrong and claims that the majority of Americans are also against same-sex marriage. S2 suggests that homosexual partners would not be a burden on the mentioned systems because they would be paying into the systems as well as receiving benefits from them. He cites the legalization of same-sex marriages in various other countries in Europe and North America."}, "Key": "1-1281_294_292__295_296_297_298_299_300_4"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 notes a provision in law that makes performing marriage ceremonies by sanctioned marriage officers non-mandatory when it comes to same sex couples and marriage as long as performing said ceremony would conflict with that person's conscience, religion and belief. S1 believes that forcing them to do so against their beliefs would infringe on their religious freedom.   S2 feels that it is unfortunate if that applies to public officials, as they believe that public officials must serve the public in its entirety, equally, under the law. He or she feels that if one cannot perform the job, then that person should look for another job. This person believes that it is an impediment to the public servant performing his or her job if it's true.", "Natural_Summary_Text_4": "S1 said that in South Africa it seems as if marriage freedom does not trump religious freedom as public officials do not have to perform a gay marriage ceremony if they believe that doing so would be against their values. He said that if a public official did not want to marry him in a heterosexual marriage he would want to go elsewhere rather than force him to do it.   S2 said that public officials should serve the public equally under the law as that is what they are supposed to do. He said that they should have to look for another job if they do not want to do their jobs. He expressed his gladness at being in Canada where there are more rights.", "Natural_Summary_Text_3": "Two people are discussing marriage freedom and religious freedom.  S1 quotes a provision that states that marriage officers do not need to perform a ceremony between same-sex couples if it conflicts with their conscience, religion or belief.  He states that he would not want someone to be forced to do something against their religious beliefs, as if it were the case with his heterosexual civil ceremony, he would find someone else to do it.  He then states that marriage freedom shouldn't trump religious freedom.  S2 believes that all public officials are there to serve all members of the public equally under the law, and if one cannot do the job then he should look for another job.", "Natural_Summary_Text_2": "S1 and S2 are discussing the situation in which a marriage officiant may be requested to perform a gay marriage but have personal religious beliefs against homosexuality or gay marriage.  S1 defends and respects the personal religious beliefs and notes that the provision they are discussing (which is either a law or a proposed law) provides the marriage official with the ability to opt out of performing the ceremony if it violates his or her religious beliefs.  S2 finds that offensive, reasoning that if the person is licensed by the state to perform marriage ceremonies that person should do so for all marriages, not just heterosexual marriages.  S1 asserts that South Africa takes his view, while S2 claims Canada sides with him.", "Natural_Summary_Text_1": "S1 cites a key statement in the same-sex marriage legislation that allows marriage officers the right not to perform a same-sex marriage if it conflicts with their conscience, religion, or beliefs. He believes this is a good caveat, claiming that forcing officials to perform same-sex marriages would be infringing upon their religious freedom. He argues that if a public official had a religious objection to heterosexual marriages, then he would not expect that person to perform his marriage and would instead seek out someone who would. S2 believes it is inappropriate for public officials to be able to deny services based on their personal religious beliefs. If they are unable to do their job, he suggests, they should not be able to hold that position."}, "Key": "1-6319_4_3__5_8_9_12_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 notes that the number of earthquakes outside Israel has increased I the last one hundred years exponentially. He or she quotes the lists of \"World's Most Dangerous Earthquakes and Selected Earthquakes in the United States\" from the Citizen's Guide to Geologic Hazards. He or she notes about twenty large earthquakes globally in the latter half of the century compared to about fifteen for the first half of this century and only seven large earthquakes recorded in the entire nineteenth century. They believe that the United States Government is ruled by the majority until it violates the constitution.   S2 refutes this by stating that technological advances in earthquake tremor detection has improved greatly since the nineteenth century, and that S1's argument purposefully excludes this fact.", "Natural_Summary_Text_4": "S1 discussed the increase in earthquakes outside of Israel in the last 100 years and said it is \"love waxing cold.\"  He noted that there have been 20 large earthquakes just in this part of the century that were easy to detect even without a seismograph. He said he did other research which showed the same results even when that was taken into account. He said that he knows that he differs with S2 as he believes that the majority rules in the United States  unless it violates the constitution. S2  said that he felt like shaking something at S2 and then asked S1 about the advances in the recording of the earthquakes and challenged his source and his statistics. He also challenged S1's earthquake argument.", "Natural_Summary_Text_3": "Two people are discussing the increase in frequency of earthquakes.  S1 contends that the amount of earthquakes in the last century is increasing exponentially.  He contends that there has been 20 large earthquakes in the latter half of this century, compared to about 15 for the first half and about 7 in the entire 19th century. S2 retorts that the method used to detect and record earthquakes have been taking exponential leaps forward, and he states that S1 is taking statistics from one source without critical thought an accepting it as fact.  S1 rebuts stating that the new methods detect minimal or localized earthquakes and that major ones can be detected without a seismograph.", "Natural_Summary_Text_2": "S1 argues that the number of earthquakes has been increasing in recent times, citing statistics for larger earthquakes suggesting the frequency of large earthquakes increased five fold from the 19tyh to 20th centuries.  The context of the discussion may be religious as S1 mentions Israel as well as the U.S. Constitution and rights of minorities versus majority rule.  S2 seems exasperated with S1's comments here and in prior posts and suggests that advances in detection technology and increases in recording practices could explain any seeming increase in the frequency of earthquakes, and that S1 is merely looking at statistics unscientifically to support the assertion.  S1 is confident she accounted for the variables mentioned by S2 by limiting her argument to large earthquakes.", "Natural_Summary_Text_1": "S1 claims that the number of earthquakes occurring outside of Israel has increased in the last hundred years, comparing 20 large earthquakes in the latter half of the 20th century to only 15 large earthquakes in the first half of the 20th century, and only 7 large earthquakes in the entire 19th century. S1 argues that this information is clear evidence that the frequency of earthquakes is increasing over time. S2 refutes S1 claim of increasing earthquake frequency, suggesting that the greater number of earthquakes detected could be a matter of increases in our ability to detect earthquakes rather than an actual increase in the number of earthquakes occurring. S1 takes this point into consideration, but claims that the evidence still supports his original claim."}, "Key": "1-1281_472_466_1_476_486_577_586_628_11"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing the spread of AIDS.  S2 states that no one knows how AIDS got to the US.  He also states that those who made AIDS a major health are the people who didn't clean their needles while doing drugs, those who don't practice safe sex, and those giving blood transfusions before it was a known form of transmission.  S1 rebuts, asking S2 to provide evidence to back up his claim.  S2 then quotes a recent post from S1, stating that any debate will start when S1 owns up to his own requirements and defend his statements, to which S1 guaranteers that he can prove his assertions, as long as S2 accepts his challenge to a debate.", "Natural_Summary_Text_4": "S1 said that he continues to \"stand by\" and adhere to his previous post. He challenged S2 to show proof that this was not the case (seeming that gays caused AIDs to be a major health concern) and to stop making empty arguments and/or attacking him. He impatiently waited for the proofs he wanted.  S2 stated his belief that it remains a mystery about how AIDs reached the United States and that IV drug users who exchanged needles without cleaning them and those who did not practice safe sex and those who gave blood for transfusions before AIDS was known about spread the disease. He said that he would not debate S1 until S1 starts himself giving the proofs that he requests of others.", "Natural_Summary_Text_3": "S1 and S2 are discussing the onslaught of AIDS in the United States.  S1 believes the disease was made into a huge health concern as the result of the homosexual community. S2 contends no one really knows how AIDS originally arrived in the United States and the fault of the spread lies with the folks who used dirty needles when taking drugs and people who didn't practice safe sex.  S2 also cites the practice of untested blood transfusions before it was discovered how AIDS could be spread.  S1 argues that S2 has provided no substantial proof to back his/her arguments in regard to how the disease actually rose to concerning levels in America and asks for a debate between he/she and S2.", "Natural_Summary_Text_2": "S1 believes that gay people are the ones that made AIDS a major health concern in the US and asks for proof to the contrary. He thinks S2 is simply giving opinions and not facts and when he quotes him S1 says he is flattered that a quote from him is the best intelligent statement he could come up with. He wishes to debate S2. S2 believes no one knows how AIDS came to the US and states that people using dirty needles, those participating in unsafe sex, and those involved in blood transfusions before they knew how it was spread were the ones that made it a health concern. He quotes S1 as evidence of his hypocrisy in requesting evidence when he offers none.", "Natural_Summary_Text_1": "S1 challenges S2 to debate the cause of the spread of AIDS in the United States and encourages S2 to attempt to challenge his claims with proof that they are untrue. He accuses S2 of attempting to change the debate and making personal attacks rather than addressing the question at hand. He suggests that if the debate occurs, he will prove his assertions true.  S2 claims that the origin of AIDS in the United States is unknown and that the spread of AIDS was caused by unclean needles, unprotected sex, and contaminated blood transfusions. He rejects the requirement that he should provide proof for his claims by citing S1's failure to do so. He suggests that once S1 begins to debate appropriately, then he will too."}, "Key": "1-6646_124_123_1_126_128_130_131_134_136_137_10"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing diversity and gays. S1 contends that his family represents the norm, not a deviation from it.  He calls gays a perversity, then states that he doesn't hate gays but rather believes that  marriage should not be redefined for them.  S2 contradicts, stating gays are a diversity, not a perversion, and that S1 hates gays.  He questions how S1 can claim that he doesn't hate gays when he clearly calls him and his family a perversion.  He then states that although he is younger than S1, he wasn't born yesterday, to which S1 replies that he (S2) can believe what he wants, no matter how wrong he is.", "Natural_Summary_Text_4": "S1 expressed his opinion that his family and other heterosexual families are the norm and that homosexual families (like S2's) deviate from the norm. He called such families \"perverse\". When this comment resulted in a challenge from S1 he denied hating gays. He then stated his opinion that that marriage should not be redefined for gay people... He continued to deny his hate for gays. S2 stated his belief that deviations from the norm are diverse. He said that he knew that S2 is not against all diversity but seems to be very much against gays. He bristled against S1's definition of his family as \"perverse\" and pointed at the use of that word as being illustrative of S1's hatred of gays.", "Natural_Summary_Text_3": "S1 and S2 are discussing gay relations and the possibility of redefining marriage to include the gay community.  S1 believes gay relationships are a perversion of the normal thought of society.  S2 contends that S1 hates gays and is basically prejudice toward gay people based upon some remarks being made.  Particularly the label of perversion.  S2 contends that S1 is not against all diversity, just gay lifestyle which in S2's opinion makes him/her hateful toward gays.  S1 contends he/she does not hate gays but doesn't feel marriage should be redefined to allow for them to wed.  S2 feels S1's objection to gays and the family's they would make is prejudice.  S1 contends S2 is wrong in his/her beliefs.", "Natural_Summary_Text_2": "S1 thinks he and his family represents what is normal. Homosexuality in his opinion is a deviation from the norm and is perverse. He rejects the idea that he hates gay people and says he simply doesn't think we should redefine marriage for them. He states S2 may believe as wishes even if it is wrong. S2 questions what is perverse. He equates the word perverse with diversity. A deviation for the norm in his opinion is diversity. He doubts S1 is against diversity so he thinks he simply hates a form of it, gay people. He views calling something perverse ad evidence of this hate and does not believe S1 when he says that he doesn't hate gays he is simply worried about marriage.", "Natural_Summary_Text_1": "S1 points out that his heteronormative family represents the norm and suggests that deviation from the norm in the form of homosexual families is perverse. He clarifies that he doesn't hate gays, but he simply doesn't believe that the definition of marriage should be changed to include homosexual unions. He claims that S2's beliefs do not make him correct.  S2 suggests that deviation from the norm is simply a form of diversity and is not necessarily perverse. He accuses S1 of hating homosexuals. In response to S1's claims that he does not hate homosexuals, S2 points out that calling homosexual relationships perverse is clearly a form of hate, and that it is clear from S1's language that he does in fact hate people who are homosexual."}, "Key": "1-6646_280_267__281_288_324_348_351_8"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing gay marriage rights.  S1 states that gays don't have the right to shared health care because they're not married.  He states that gays do have the right to marry members of the opposite sex, but not the same sex, which is the same has heterosexuals.  He also states that there will never be a federal law allowing gay marriages in the US, as there is allot of backlash going on lately.  S2 contends that gays don't have the right to marry who they love, which is what they are fighting for.  He states that they will win, just as what happened with slavery and women voting, to which S1 states where entirely different issues.", "Natural_Summary_Text_4": "S1 said that if gays want healthcare they can marry someone of the opposite sex just like straight people do. He said that there never will be a federal law allowing gay marriage in the United States. He said that he believes that S2's is wrong in his assertion that the gay marriage issue is similar to the issues of slavery, women's right to vote, etc. He said that gay marriage is not an unalienable right.   S2 said that S1 probably liked segregation and was most likely against women voting too. He said that gays do not now have the right to marry  who they love but eventually will. He compared the struggle for gay marriage to conquering polio and getting the vote, etc.", "Natural_Summary_Text_3": "S1 and S2 are debating gay marriage and healthcare benefits.  S1 is against gay marriage as well as shared healthcare between gay couples.  S2 feels this objection points to S1's being in support of things such as segregation and prohibition.  S2 argues that gays do have the right to marry in order to qualify for healthcare, they just have to marry someone of the opposite sex, advising straight people and gay people have the same rights due to this.  S2 contends that due to the fact gay people cannot choose to marry someone they love, of the same sex, they do not have the same rights as heterosexuals and this is prejudice.  S2 believes gay marriage laws will be passed.", "Natural_Summary_Text_2": "S1 believes the two gay people living together should not expect healthcare since straight people that aren't married can't get it. He thinks gays can marry members of the opposite sex just as heterosexuals do and heterosexuals can't marry members of the same sex. He thinks gay people have the same rights as heterosexuals and does not view marriage as a right. Therefore, slavery and women's rights are bad comparisons. S2 thinks S1's argument is ridiculous and gays lack rights. He says gay people can't marry who they love and compares it to people protesting interracial marriage, slavery, and women's rights. He believes gay people are in the process to overcome and they will win the right to marry and to have healthcare as well.", "Natural_Summary_Text_1": "S1 claims that homosexual partners shouldn't expect shared healthcare in the same way that an unmarried couple shouldn't. He suggests that homosexuals are not being denied any rights, that they have all the same rights as heterosexuals. He points out that nobody can marry someone of the same sex, not just homosexuals. He rejects the idea that homosexuals will succeed in legalizing same-sex marriage, citing several cases where homosexual marriages were banned.  S2 accuses S1 of accepting that some people should not receive the basic right to marry the person they love. He likens this to slavery, prohibition, and women's suffrage. He claims that the proponents of same-sex marriage will eventually be successful, just as human rights advocates were with slavery, voting, and interracial marriage."}, "Key": "1-1875_21_20__22_24_25_27_30_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing marriage benefits.  S1 states that healthcare usually applies to spouses, so in order to get the benefits of any health care provided by a spouses job the requirement is marriage.  Since gays can't get married, they cannot share in each other's health care, and he hopes that gay marriages will be sorted out so he doesn't have to hear them complain about health care. He then uses an example of a straight guy who has a girlfriend who can't get any health care because they're not married, and he asks S2 if she hould get benefits.   S2 contends that legally if they cohabitate for a prescribed period of time or have children, by common law they can.", "Natural_Summary_Text_4": "S1:1 started his comments by talking about the fact that typically only spouses are eligible for health care and that if it is illegal for gays to marry in VA then of course there would be no health care coverage for them in VA. He then compared this to what happens with the girlfriend of a straight guy who cannot get his healthcare benefits. He then said that he hopes that gay marriage stay out of VA so there will not be trouble and that gay marriage will be outlawed everywhere so that gays will stop complaining about the lack of healthcare.   S2 pointed out the fact that the straight guy can marry or have a common law relationship so his girlfriend can get benefits.", "Natural_Summary_Text_3": "Two subjects are discussing Virginia's unwillingness to allow gay couples to marry.  S1 is using the basis that the request for legalizing gay marriage is mostly based on the want and need for healthcare benefits one's spouse in entitled to using the example that if a gentleman and his girlfriend are not married, the girlfriend would not be eligible for healthcare under the boyfriend either.  S2 contends this is not a singular subject and is more based on rights as the heterosexual couple S1 uses as an example has the right to get married if they choose, while a gay couple does not have the option to make that same choice to.  S1 holds hope that gay marriage will be banned everywhere.", "Natural_Summary_Text_2": "S1 says that healthcare applies to spouses, so if it is illegal for gay people to get married in VA they can't share healthcare. He goes on to say it works the same way if a straight man has a girlfriend. She can't get healthcare through his job. He hopes gay people upset by VA leave and that gay marriage gets outlawed everywhere so he doesn't have to hear gay people complain anymore. S1 corrects S2's grammar when he types common law. S2 states that a straight man can marry his girlfriend and she can get healthcare, but gay people are prohibited from getting married. He believes that if two people cohabitate for awhile or have children they should get healthcare because of Common law.", "Natural_Summary_Text_1": "S1 claims that because healthcare is generally extended to spouses, homosexuals will not be eligible to receive healthcare through their partner because same-sex marriages are not recognized in Virginia. He likens this situations to a heterosexual male with a girlfriend who would not receive his healthcare benefits. He presents his opinion that homosexuals should move out of Virginia and his hope that same-sex marriages will be made illegal everywhere.  S2 argues that the cases presented by S1 are not equivalent because the heterosexual male has the right to marry his girlfriend if he chooses, at which point she would be eligible for his benefits. He also points out that after cohabitating for a certain period of time, the woman would be eligible under common law marriage."}, "Key": "1-1875_13_11__14_16_31_39_1"}]