[{"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing laws and politics.  S2 states that homosexual sex is a sin and a crime, and there should be a huge fine on the behavior.  S1 retorts that while Christianity states its a sin, it is not a crime anymore.  He states that the US is not a theocracy, and the freedom available in the US means that the responsibility of appeasing a Christian God cannot be forced on the population.  S2 retorts that liberal tolerance is contradictory, dogmatic, intolerant and coercive as it only allows for one correct view.  To contradict, S1 states that the \"liberal\" tolerance still allows for the free practice of religion.", "Natural_Summary_Text_4": "S1 believes while homosexuality was considered a crime in earlier times, it is no longer a crime today.  S1 feels S2's argument of liberal persecution can't hold water due to the fact that liberal tolerance is what allows for S2 to worship as he/she chooses and state openly his/her opinions.\r  \r  S2 believes homosexuality should still be considered a crime and those who participate in it should be punished by law along with those who support them.  S2 also believes liberal tolerance is as a whole, not actually tolerant.  Feeling also people with other views from liberalism are persecuted for non-acceptance publicly.  S1 advises gay marriage was voted on and lost there they live and feels it is mostly based upon religious values.", "Natural_Summary_Text_3": "S2 thinks homosexuality is a sin and should be a crime along with heavy fines. S2 believes liberals are hypocritical in talking about tolerance and justice. He thinks liberals think only they are right, push the liberal way as social norm, and ridicule anyone that doesn't agree. S2 points out this isn't a theocracy and that if someone wants to live in a society based on religion there are other places that have that. S2 thinks Christians are hypocrites because they claim to be persecuted because they can't force their religion on others. He says they may practice as they wish, but they can't force others to do so.", "Natural_Summary_Text_2": "S1 claims that Thomas Jefferson did not recommend the negative behaviors that are targeted toward homosexuals, and that although homosexuality is a sin according to Christianity and may have been illegal in the past, it is not anymore. He points out that America is not a theocracy and that Christians are not persecuted, citing the fact that they are free to practice religion as they choose. \r  S2 claims that Thomas Jefferson was correct in labeling homosexuality as a sin and a crime. He believes that there should be heavy monetary fines for engaging in or advocating homosexual behavior. He argues that liberal tolerance is just as dogmatic as Christianity, and that it is no more right to base laws on this perspective over any another.", "Natural_Summary_Text_1": "S1 does not believe that what Jefferson recommended be done to homosexuals is okay. They point out that according to the Christian faith it is sinful, but not to modern law. They argue that the country is not a theocracy, and allows everyone equal rights to practice their religious beliefs as they see fit, but likewise does not allow for one to exert control over another.\r  S2 believes Jefferson was correct in stating homosexuality as being a crime. They believe that since they personally think it is a sin, there should be a penalty against homosexuals and those that advocate it. They argue that liberal tolerance assumes a mindset that advocates its own views on conduct at the exclusion and dismissal of those that do not."}, "Key": "1-9745_48_46__49_50_53_54_55_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are arguing about religion.  S2 states that the homosexuals and their supporters are close minded to what the bible teaches about gay sex. He states that the gay community is saying their sin is ok, and that he is looking for their best interests by asking them to repent to Jesus Christ for the remission of their sins.  S1 states that he figured out right from wrong by treating people with kindness and respect, not by a book.  He states that the bible also says to stone children to death so it is not a resource to be trusted.  S2 states that only believing in Jesus Christ gets you to heaven, anything else leads to Hell.", "Natural_Summary_Text_4": "S1 feels the posts he/she has read are bigoted statements.  S1 also asks that the Bible be stepped out of to see how these statements are treating people.  S1 feels the statements are not looking out for the best interests of gay people but actually degrading them.  He/she advises people should not trust the Bible as a viable source because it also advised to stone children who don't behave.  \r  \r  S2 advises he/she (along with others) are speaking based on their religious beliefs.   S2 feels the gay community as well as those who support them should read the Bible, pray, and get saved to learn right from wrong also stating religious beliefs should not be given up for political correctness.", "Natural_Summary_Text_3": "S1 thinks people need to stop being bigots and open their minds to the fact that not everyone is going to be like they are. S1 thinks political correctness is good and that you learn right from wrong on your own by being kind to people and treating them with respect. S1 thinks the Bible is a cruel book that shouldn't be used as an example. S2 thinks the Bible is right and how people learn right from wrong. He also thinks nothing outside of the Bible is important. S2 thinks he is helping gay people by saving them from hell even if it does hurt them while they are here.", "Natural_Summary_Text_2": "S1 attacks previous posts for their bigotry and argues that the differences between people are not a bad thing. He suggests that S2 should make their decisions without reference to the Bible. He claims that the Bible is not an appropriate source for morality, citing the proscription that misbehaving children should be stoned to death. He argues that we should instead treat people with kindness and respect. \r  S2 claims that their views on homosexuals are defined by the Bible and that he will not listen to those who ignore God's Word. He argues against sacrificing one's religious beliefs in favor of political correctness and suggests that homosexuals repent their sins so that they can go to Heaven. They claim that homosexuality will lead to Hell.", "Natural_Summary_Text_1": "S1 believes it is important to look at how one treats others and not be close minded. This person argues that you can discern right and wrong by learning through how you treat people with kindness and respect. They do not believe the Bible is trustworthy as it advises against homosexuality while advocating stoning and other such punishments. \r  S2 believes that it is those who don't believe in the Bible that are close minded. They do not believe it is right to disregard the Bible out of political correctness. This person believes that you can only know right from wrong if you read the Bible, are saved, and that telling people they are living in sin is only done with their best interests in mind."}, "Key": "1-9989_63_61__65_74_75_78_4"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing the importance of gay marriage to society.  S1 states that gay marriage is not an essential component to the welfare of society.  He states that our society can survive without homosexual unions, polygamy and bestiality; without heterosexual marriage society would not survive long at all. S2 retorts that this is not an argument, as society could survive without giving many minorities the same rights as the majority. S1 states that the people through government has the right to draw the line on what is recognized as marriage, and the disagreement is to where that line is.  S2 states that the real issue at hand is banning gay marriage.", "Natural_Summary_Text_4": "S1 believes S2's statements exclude gay couples from the term marriage.  S1 feels the argument of society's survival is a way of saying it's alright to exclude a minority group from what is to be considered the social norm as homosexuals have been.\r  \r  S2 believes whether or not gay marriage impacts the public's view of marriage, that society could survive without it whereas society could not survive as a whole without heterosexual unions. S2 supports his/her statements with the argument that most people agree the government has a right to draw a line where marriage is concerned as in polygamy, incest, statutory, so it could be said the only valid argument is not that of inequality but more of where the line should be drawn.", "Natural_Summary_Text_3": "S1 thinks it doesn't matter if anyone is harmed by gay marriage it is different than the basic structure. He thinks society could not survive without heterosexual marriage but it can without gay marriage. He argues that the real issue is where to draw the lines on marriage laws. S2 argues that society could survive without many of the rights it has and that argument is really a way of discriminating against minorities, therefore it isn't an argument. S2 agrees the issue is where to draw the line but states you need reasons the line should be there and there isn't one for gay marriage.", "Natural_Summary_Text_2": "S1 claims that same-sex marriage is not the same essential component of society that opposite-sex marriage is. He clarifies by suggesting that society can function without same-sex marriage, but not without opposite-sex marriage, presumably due to the reproductive element involved. He redefines the argument to be whether the government has the right to decide which types of marriages it will recognize, suggesting that the debate is just about where the line is drawn.\r  S2 claims that same-sex and opposite-sex families have the same needs and responsibilities within society. He claims that S1 is correct that society could function without giving minorities the same rights as majority but that this is amoral, and that there is no good reason to deny people the right of same-sex marriage.", "Natural_Summary_Text_1": "S1 argues that same sex marriage is not the same essential component to people's general welfare that one man and one woman is. This person believes that society can survive without homosexual unions, polygamy and bestiality, and that it would not survive long without heterosexual marriage. He or she argue that S2 is simply disagreeing on where the legal line should be drawn for marriage, and that government has the right to impose a legal distinction somewhere.\r  S2 argues that homosexual couples and families all have the same basic needs, responsibilities to one another and society as heterosexual people do. This person believes that S1 is wrong by rebutting the idea that society could also survive without allowing many minorities the same rights as the majority."}, "Key": "1-9331_28_26__31_38_39_40_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing the Defense of Marriage Act (DOMA). S1 believes that the State Constitutional Amendment banning gay marriage is legal.  He states that the outcome of the courts ruling impacts all taxpayers, and he argues that the court cannot rule a California Constitutional Amendment unconstitutional because Federal Law gives states the right to ignore other state's gay marriage law.  S2 asserts that the state constitution cannot violate the federal constitution, and based on what DOMA does it  violates the 14th amendment.  He also states that gay people pay taxes too and he wonders why gays must pay for straight marriages while not being allowed to marry themselves and that DOMA doesn't prohibit states from recognizing gay marriage.", "Natural_Summary_Text_4": "S1 believes DOMA on a state level is unconstitutional.  S1 argues gay marriage has an impact on all tax payers in a negative way.  He/she believes the state ban on gay marriage in California was enacted legally additionally citing the federal ruling that each state must acknowledge the marriage laws of another state.\r  \r  S2 provides the argument that DOMA on a federal level could actually be found unconstitutional.  S2 also argues the impact on taxpayers advising gay couples pay taxes on heterosexual marriages and activities so they are impacted based on fundamental law thus making S1's observance incorrect, in S2's theory.  S2 also advises a state constitution cannot supersede the federal constitution. S2 argues that S2 is incorrect concerning each state's recognition.", "Natural_Summary_Text_3": "S1 thinks Prop 8 needs to be verified as being enacted legally. S1 believes that if DOMA isn't unconstitutional there is not point in fighting over it. He says it has a financial impact on all tax payers and that federal law (about DOMA) would have to be struck down before the California law could be considered unconstitutional. S2 says that the federal DOMA is unconstitutional and that the discussion of the California law could lead to this recognition. S2 points out that gay people pay taxes and pay for straight marriages while being denied the right to marry themselves. He believes the 14th amendment requires gay marriage.", "Natural_Summary_Text_2": "S1 claims that proponents of gay marriage legislation need only to verify that the state constitutional amendment banning gay marriage was enacted illegally, and that if the defense of marriage act is constitutional, then it is legal to ban gay marriage. He also argues that gay marriage has a financial impact on all tax payers. \r  S2 argues that the state constitution does not supersede the federal constitution, so the question is whether the state constitutional amendment violates the 14th amendment. He also suggests that the defense of marriage act will likely be ruled unconstitutional which leads to the question of the legality of the state amendments. Finally, he points out that the defense of marriage act does not prohibit a state from recognizing gay marriage.", "Natural_Summary_Text_1": "S1 argues that the proponents of Prop 8 need to verify that the California Amendment banning gay marriage was enacted legally. This person believes that if DOMA isn't declared unconstitutional than those arguing against Prop 8 don't have a valid platform. He or she argue that they would have to first strike down the federal law that gives states the right to ignore other states' laws before they could do the same to the California Amendment.\r  S2 argues that the California Amendment is being tried to see if it violates the 14th Amendment of the Constitution. This person believes that DOMA violates the federal constitution. This person argues that there is nothing in DOMA that prevents California's court from ruling the 14th amendment requires gay marriage."}, "Key": "1-9331_3_2__4_6_7_9_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are debating gay marriage rights.  S1 is pro gay marriage while S2 appears against.  S1 feels the constitution can evolve with changing times because it is a man-made construct while S2 cites the fact 26 states still consider the sanctity of marriage to be one man and one woman.  Also advising a key point to the nation is the basis of laws being voted upon.  S2 does not feel S1's statements are correct regarding whether or not marriage is a right.  S1 sites Loving v. Virginia in argument marriage is not a human construct. S1 also advises marriage is a fundamental right and should be a fundamental right for all not to be determined by each state individually.", "Natural_Summary_Text_4": "Two people are discussing gay marriage laws.  S1 states that since the traditional definition of marriage is human made, it can be changed to meet changing times.  S2 contends that the legal definition is human made and can change, but since we're in a democracy it must change by vote.  He also states that so far votes favor a \"one man one woman\" definition of marriage.  S1 states that the courts were designed to be an intermediate between people and legislature, and if same gender marriage can be banned by state action it must be proven that marriage is not a fundamental right.  S2 states that by allowing this the judiciary branch becomes the legislative branch, which is not so.", "Natural_Summary_Text_3": "The issue is here is the definition of marriage, and what government body/level has the right to change this definition.\r  \r  Speaker one believes that courts and federal government should be able to rule on the definition of marriage and cites several previous cases in the past where the federal government stepped up to introduce legislature. This speaker believes that \"fundamental rights\" are not subject to state votes and can be decided by government.\r  \r  Speaker two believes that each state should decide the definition of marriage and questions what \"fundamental rights\" have to do with the \"definition\" of marriage. This speaker believes that it should left up to a vote to decide the definition of marriage and that legislature should not be confused with judiciary.", "Natural_Summary_Text_2": "S1 thinks the definition of marriage is subject to change. As an example S1 points to an old definition of marriage in which a woman lost her identity into that of a man. S1 believes fundamental rights are not subject to vote and cites Loving v. Virginia as an example. He believes the courts are an intermediate body between the people and legislature; thus to ban gay marriage one must prove it isn't a right or give compelling evidence against it. S2 wonders what marriage being a fundamental right has to do with defining marriage. If marriage is subject to change then he asks how it is supposed to be changed if not by vote. He takes issue with the judiciary becoming the legislative branch.", "Natural_Summary_Text_1": "S1 and S2 discuss the United States Constitutional legal system and whether and how same sex marriage can be banned.  S1 believes the concept of marriage has evolved dramatically over time and can now be declared by the Supreme Court to be a fundamental right not to be denied to same sex couples.   S2 believes it is a legislative matter which should be left to voting.  S1 argues that fundamental rights are protected by the Constitution and are not subject to a plebescite.  S2 accuses S1 of believing in an activist judiciary and evolving Constitutional standards which usurp the role of the legislature.  S2 also criticizes Loving v. Virginia as incorrect in reasoning and an example of judicial activism."}, "Key": "1-7858_135_133__137_142_144_148_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 does not believe in Christianity and asks for proof of the resurrection of Christ. He thinks scientific evidence and human intelligence show that a man can't get up after being dead for three days. He sees no evidence of it being true and thinks it's all hearsay and fairy tales. Just because billions believe something it doesn't mean it is true. He believes faced with a lack of evidence Christians resort to name calling and he feels if the pit were real they would both be in it. S2 believes that S1 is a anti-Christ that likes to wine. He does not agree with S1's opinions and thinks there will be no Sodomites, meaning homosexuals, in heaven. He thinks S1 will go to hell.", "Natural_Summary_Text_4": "Two people are discussing Christianity.  S2 contends that there is no eye witness accounts of any resurrection ever recorded, and that everything in the Gospels is hearsay.  He states that not only is there evidence, but scientifically and logically no one can be dead for three days and get up and walk away.  He also states that the burden of proof instead lies with those who believe in the resurrection, and that based on the way Christians life their lives they would ironically end up in the pit also.  S1 states that it is all unfounded conjecture, full of left wing, antichrist dysentery.  He challenges S2 to find credible arguments that bust the resurrection of Christ.", "Natural_Summary_Text_3": "S1 claims that it is necessary for S2 to provide credible arguments and scholarship refuting the resurrection of Christ to be taken seriously. He accuses S2 of being a left wing Christ denier and suggests that S2 will go to Hell unless he repents.   S2 argues that the burden of proof should actually be on the people claiming the resurrection is true. He cites the fact that there are no eye witness accounts or other proof of the resurrection and that scientific evidence suggests that it is highly improbable for a man to be revived after being dead for three days. He suggests that even if the Bible were completely true, many self-professed Christians would also be condemned to Hell for their non-Christian behaviors.", "Natural_Summary_Text_2": "S1 attacked S1's lack of belief in the resurrection of Jesus. He said that until S2 presents credible scholarship and good arguments that burst the belief in the resurrection of Jesus he is nothing more than a Christ denier and might as well go into the Pit. And of course since he is gay and is a Sodomite he would not go to heaven unless he repented.   S2 called S1's reply lame and then proceeded to argue that there were no eyewitness accounts only hearsay, no evidence, etc. and that S1 should be the one to come up with proof. He said to S1, Ezridden, that if the pit really existed then Ezridden would be there too because of how he treats other people.", "Natural_Summary_Text_1": "Two subjects are discussing the issue of homosexuality versus religion.  S1 believes homosexuality is a denial of religion.  S2 believes everything written modernly in regard to religion is hearsay as there were no eye witnesses to things such as the resurrection of the portrayed Christ.  S1 feels believing as S2 does basically signs his entrance into Hell.  S2 challenges that if the teachings of the Bible which S1 continuously clings to are to be believed in, then those who profess to be Christians would also fall to Hell for violation.  S1 feels S2 is a sodomite and should repent.  S2 feels S1 clings to religion as a basis for his belief because he is unable to offer substantial proof."}, "Key": "1-10951_34_32__39_41_42_44_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 compares being against gay marriage to the Taliban and Sharia law. He sees no difference in those that oppose gay marriage for religious reasons and have laws against it and Muslims that pass laws based on religion. He finds it hypocritical for people to be against Sharia law when they are, in his opinion, doing the same thing. He believes marriage is a legal contract between two people and the state and he supports gay marriage. S2 does not agree with the comparison of Sharia law and being against gay marriage. He has not advocated for jail time or the death of homosexuals. They are free to do as they wish. He believes gay marriage pushes that relationship onto others, and he opposes it.", "Natural_Summary_Text_4": "Two people are discussing legal law and gay rights.  S1 states that by not allowing gays to have a civil government contract because of religious beliefs is equivalent to sharia law in the Mideastern countries.  He states that it is a religious belief that a civil marriage contract is between a man and a women, which is the current law and that religious beliefs should have nothing to do with civil law.  S2 contends that the execution, imprisonment or even mandatory therapy for homosexuals.  He states that it is the homosexual lobby who are trying to force people to recognize and support homosexuality in the public sphere.  He also states homosexual marriages haven't been banned by law, just not recognized.", "Natural_Summary_Text_3": "S1 claims that religious beliefs are preventing the recognition of homosexual marriages. He compares basing law on Christian beliefs to be the same thing as Islamists advocating Sharia law. He argues that the religious belief that marriage is between a man and a woman should have no influence on a civil marriage contract.  S2 claims that homosexuals are not being persecuted through things like execution, imprisonment, or mandatory therapy, and that it is actually the homosexual lobby who are pressing their beliefs about marriage onto everyone else. He cites the fact that homosexual marriage has not been banned in any state, it is simply not recognized, and that people are free to sign whatever contracts they want and to engage in intercourse with whomever they want.", "Natural_Summary_Text_2": "S1 labeled someone Mr Taliban and said that this person who is against sharia law is himself imposing that on gays through his religious belief that a civil marriage contract is only for a man and a woman. He said Mr.Taliban's religious beliefs should not have anything to do with civil law. S2 challenged S1's comparison of the man to the Taliban as he has not advocated the execution, jailing, etc. of homosexuals. S2 then stated that is indeed the gay lobby that is attempting to impose its view on the man. S2 concluded by asking S1 to stop complaining as there have been no real violations of S1's rights. S1 said he can have a contract and as much sex as he likes.", "Natural_Summary_Text_1": "S1 and S2 are discussing gay rights.  S1 is in support of gay marriage while S2 supports it.  S2 feels gay rights would impose gay families onto straight members of society while S1 believes S2's opinions are comparable to those of Taliban terrorists.  S2 is in support of comments made by a previous participant, contending he did not make remarks based on mandatory therapy for gays or anything of the like.  S1 believes the previous comments made center on religion and that civil law and religion are not synonymous.  S2 feels his religious beliefs are violated by just the consideration of allowing gay marriage.  S1 believes marriage is a contract between a woman and a man, not same sex."}, "Key": "1-10951_46_45__47_48_49_50_56_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 states that when gays start to lose an argument they imply the other person is a closet homosexual. S1 thinks that most people do not trust homosexuals and that they use people. He thinks just because someone is nice that is not a reason to allow them to marry or approve of deviant sex, which he considers gay sex to be. S2 believes that while most people don't support gay marriage they do support equal rights and don't care about the sex lives of other adults. She gives examples of her son's adoptive father, friend, and aunt who are all loving parents and good friends. She rejects the idea that most people do not trust gay people and that they are using other people.", "Natural_Summary_Text_4": "Two people are discussing gay marriage rights.  S1 contends that any sexual activity between two men is deviant sex, and laughs at how when a gay person loses an argument they imply the objector is a closet homosexual.  He also states that most people do not trust gays.  S2 states that most people don't care about the sex lives of other adults, and based on current states most people are for equal rights for gays save for marriage.  She also lists numerous accounts of good gay people she knows, from her son's adoptive father, who is a marvelous father, to her aunt and lesbian best friend, and states that people do trust gays.", "Natural_Summary_Text_3": "S1 believes that two men having sexual intercourse with one another is a deviant act and not approved by most people. They don't think that people trust the homosexual community and that it has nothing to do with religious beliefs. They don't think that because some people are okay with homosexual activity that everyone needs to be.  S2 argues that most people do not care about the sex lives of other consenting adults, and that people support equal rights for homosexuals as well as believe it is perfectly acceptable. They argue that denying that a child needs a loving parent to satiate one's own bigotry is wrong. They agree that there isn't wide support for the allowance of homosexuals to marry as much as general acceptance.", "Natural_Summary_Text_2": "S1 and S2 are discussing gay marriage.  S1 opposes not only gay marriage but homosexual relationships in general while S2 is in support of both.  S1 believes sexual relations between two men is deviant sex and compares the legalization of same sex marriage to pedophilia.  S2 advises she is a straight female who is, in fact, in support of gay marriage in answer to S1's theory that most people in society who are not gay do not support it.  S2 also advises her son has a day adoptive father who is a very good parent.  S1 adheres to the opinion that those in support of gay unions are the minority and most people don't trust gays.  S2 doesn't agree.", "Natural_Summary_Text_1": "S1 asserts that any sexual activity between two men is deviant behavior and that it is not generally accepted as appropriate. He complains that homosexuals respond to criticism by implying that their opponent is a closet homosexual. He suggests that if homosexual males were allowed to adopt children, they would sodomize them. S2 claims that most people support equal rights for homosexuals and believe homosexuality is acceptable. She cites several people she knows to demonstrate that homosexuals are not bad people, and claims that her son's gay father is a better father than her own heterosexual father. S1  claims that his approval of deviant sexual behavior should not be based on whether homosexuals are nice, and rejects the assertion that most people accept homosexuality."}, "Key": "1-9391_125_113__126_136_140_142_154_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 rejects the idea that homosexuality is a disease. He doubts the evidence by Cameron due to the fact that he was kicked out of the legitimate scientific community and has numerous scientists condemn him for misuse of research. S1 states that HIV will affect anyone and being gay does not put one at greater risk, but promiscuity and drug use do and are not exclusive to homosexuals. He believes the analogy of homosexuality as a disease is harmful. S2 gives a hypothetical situation in which a minister of public health has proof that part of a population has contracted a disease due to their lifestyle and questions what the proper response should be. S2 believes that granting gay marriage rights effects everyone else financially.", "Natural_Summary_Text_4": "Two people are discussing gay rights.  S1 challenges S2 to find real scientific evidence, as anything coming from Cameron doesn't apply as he has been kicked out and condemned publicly from the legitimate scientific community.  He also states that homosexuality is not a disease, and that HIV infects anyone; being gay does not put people at a greater risk, promiscuity and IV drug usage do.  S2 gives a hypothetical situation, where a minister of public health has proof that people with a certain lifestyle live shorter and he questions what S1 will do in that situation.  He also states that granting gays the rights and privileges of marriage affects everyone financially and negatively.", "Natural_Summary_Text_3": "S1 does not believe that any evidence coming from Cameron should not be viewed without suspicion on grounds that he has been kicked out of the legitimate scientific community and has gotten in trouble with judges and scientists that publicly condemn him for misusing their research. They argue that even if it were true, it does not legitimize anti-gay legislation or discrimination and that being homosexual does not hurt anyone, nor should it be counted as a disease. They believe that HIV can affect anyone, not just the homosexual community.  S2 believes that giving homosexuals rights and privileges affects everyone else financially. They believe that something should be done if a scientific study links a dangerous disease to the activities of a certain group of people.", "Natural_Summary_Text_2": "S1 and S2 are discussing gay marriage.  S1 is in favor of same sex marriage while S2 opposes.  S2 seems to believe that the gay community is singularly responsible for the spread of HIV and for that reason should not be permitted to marry.  S1 feels this is a way of saying homosexuality is a disease and S1 does not feel that is the case.  S1 wants scientific proof of the information S2 offers and does not feel Cameron is a viable source.  S2 adheres to the opinion that allowing homosexuals to wed would effect the rest of society financially.  S2 accuses S1 of chickening out because he/she does not want to answer the hypothetical question posed about HIV.", "Natural_Summary_Text_1": "S1 claims that the research demonstrating shorter lifespans for homosexuals has been discredited, and that even if it were true, it would not make anti-gay discrimination acceptable. He rejects the analogy proposed by S2 where a hypothetical disease is contracted by a small population due to their chosen lifestyle, arguing that homosexuality is not a disease. He explains that anyone is capable of contracting HIV and that the virus is spread by promiscuity and drug use, meaning that it is not exclusive to homosexuals. S2 reiterates his assertion that legalizing same-sex marriage affects the rest of the population financially. He then attacks S1's character, claiming that the strength of his own position has caused S1 to deflect the obviously accurate assertion that S2 has proposed."}, "Key": "1-9391_34_33__35_36_48_50_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 provides a link to a quiz to see where ones views line up with those of the Supreme Court and the American public. He thinks the problem with the quiz is that it is opinion based. S1 thinks the Supreme Court should not rule based on their opinions, but rather on their interpretation of the Constitution. Also, he thinks labels such as conservative are incorrect as they express a political view and not judicial interpretation. S2 dislikes the quiz. He thinks people are making courts a legislative body and if rulings are opinion based Congress should do it as they are voted in. He agrees that the rulings should not be considered liberal or conservative and gives an example of corporations running ad campaigns.", "Natural_Summary_Text_4": "Two people are discussing how Supreme Court Justices should rule on an issue.  S1 introduces the topic with a quiz by the NY Times that shows how a person's views line up with those of the current Supreme Court.  He states that its main problem is that it asks people's opinions of the issue, but doesn't address the constitutional questions involved and he states that the Supreme Court should rule on the constitution, not their personal beliefs.  S2 agrees, adding that rulings shouldn't be considered \"conservative\" or \"liberal.\"  He also states that people are making the court a second legislative body, and if the Supreme Court makes decisions based on opinions then Congress should do it because they are voted in.", "Natural_Summary_Text_3": "S1 does not believe that the Supreme Court should rule based on the majority's opinions of the issue, but on the Court's interpretation of the United States Constitution. They don't believe that court rulings should be reflective of the justices' personal political beliefs. They are against applying labels such as \"conservative\" or \"liberal\" to the court's decisions.  S2 believes that most people are using the Supreme Court as a second legislative body, and agrees with S1 that a ruling should be made in an unbiased manner and purely on their legality under the Constitution. They agree that the Supreme Court rulings should not lean to one political outlook or the other. They believe that those passing rulings do so regardless if their decision offends the public.", "Natural_Summary_Text_2": "S1 and S2 are discussing a quiz which was run on the New York Times website in regard to comparing views of the general public as compared to those of the Supreme Court.  S2 feels the the quiz is horrible as it, in S2's opinion, reinforces the point that people view the court as a legislative body.  S1 feels the quiz is useful but does have some issues.  S2 believes the rulings should not be considered conservative or liberal.  S1 agrees with this point.  S2 feels court rulings should not be based upon a judge's personal beliefs as they are supposed to be based on the constitution.  S2 uses the example of corporations being allowed to run campaign ads.", "Natural_Summary_Text_1": "S1 brings up a quiz from The New York Times that supposedly determines how you compare to the current Supreme Court Justices on Supreme Court issues. He claims that the problem with the quiz is that it is based on people's opinions and he does not believe that the Supreme Court should make rulings based on their opinions because they are supposed to be ruling entirely based on their interpretion of the constitution. S2 agrees with S1 that the Supreme Court decisions should not be described as conservative or liberal because political viewpoints should be irrelevant to interpreting the constitution. He also provides an example of one Supreme Court Justice who is known for making rulings that do not appeal to either political party."}, "Key": "1-9989_176_171__177_180_181_183_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 makes a comment about gerbils. He believes homosexuals have created sick and perverted sexual practices, such as those involving gerbils, and they are in a dangerous spiritual situation because of it. He denies joking. S2 laughs sarcastically and questions if sex is all some people think about. He thinks no one cares what people do in their bedrooms because it is private and not a reflection of who they are as a person. He states that people do not define their neighbor or mailman based on what they do in their bedroom and that if that were the case there could be many negative comments made about S1. Also, S2 says that heterosexuals have been known to have messed up sexual practices as well.", "Natural_Summary_Text_4": "Two people are discussing homosexuality.  S1 contends that S2 and Jake fails to comprehend the serious spiritual situation they are in, and they think that anything about their lifestyle is funny but its not.  He states that their practices are sick and perverted and also unnatural.  S2 states that it was sarcasm, and he finds it funny that S1 was making jokes about inserting Gerbils into someone's rectum.  He also claims that sex is all that S1 thinks about since that is the only argument he comes up with.  He then contends that people do not define their neighbor or the people around them by what they do sexually, and that Americans could care less about others' sex life.", "Natural_Summary_Text_3": "S1 believes that it is a dangerous spiritual situation that S2 is in, and to take homosexuality lightly or amusing in any way is proof that one doesn't care about it. They don't believe that anyone should be laughing or joking at what they think is a perverted and unnatural practice that homosexuals engage in.  S2 doesn't believe that sexual activity is what makes up the homosexual community, and that people don't, and shouldn't, care about what one does in the bedroom. They believe such activities should remain private and that it is no one else's business. They don't believe that what is done behind closed doors defines a person. They don't agree that homosexuals should be classified as deviant, as heterosexual activities can be likewise.", "Natural_Summary_Text_2": "S1 and S2 are discussing gay marriage and relationships.  S1 is opposed to the issue while S2 is for it.  S1 believes those who practice gay relationships are spiritually lacking and feels S2's sarcasm toward the issue at hand is proof of this.  S2 feels S1 is too literal and obsessed with the issue of gay sex rather than gay marriage.  S2 advises what happens in the bedroom is private and not the issue.  S1 makes some rude remarks in regard to gay sex involving gerbils.  S2 feels many heterosexuals also have a history of doing vulgar things as well and it is unfair to categorize only gay individuals in this manner.  S1 does not agree with this.", "Natural_Summary_Text_1": "S1 identifies the important spiritual situation that homosexuals are in. He suggests that it is inappropriate to make jokes about homosexual lifestyles, that no one approves of the deviant behaviors practiced by homosexuals, and that it would not be funny if homosexuality was discovered in your own community. S2 claims that sexual behaviors because we do not identify non-homosexuals by the sexual behaviors they engage in, we should not do so for homosexual individuals. He argues that a person's private behaviors are no one else's business, and that a sexual behaviors do not define who someone is as a person. He defends homosexual behaviors by referencing the deviant behaviors performed by heterosexuals, suggesting that deviant sexual acts are not the sole province of homosexuals."}, "Key": "1-9391_283_279__285_286_289_294_9"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes marriage is a contract between the state and two people. He compares it to forming a corporation. He finds it ironic Christians are against the religious aspects of marriage yet, because they are unable to stop religious marriage they want to stop the contract. He believes he is forced to recognize heterosexual marriage and others should recognize gay marriages. He does not believe rights should be voted on and gives an example of slavery. S2 does not think anyone is harmed by gay marriage but believes official policies are everyone's business. Heterosexual marriage is the status quo, so it is thus recognized. Any changes to the status quo should be justified. He doesn't see marriage as a right an example being unmarried people.", "Natural_Summary_Text_4": "Two people are discussing gay rights.  S1 states that marriage is a contract between the state and the two people involved and he finds irony that the Christians are opposed to gay religious marriage when the civil part doesn't affect them, but gays can have a religious marriage but not a contract with the state.  He states that someone's marriage is their own business, and just as he is forced to accept heterosexual marriages why shouldn't others accept homosexual marriages.  S2 contends that since everyone lives in the society, its policy is everyones business.   He also states that heterosexual marriages is the status quo, and the challenger to that is the one who has to justify the changes.", "Natural_Summary_Text_3": "S1 believes that the entire point of marriage is to create a contract between the state and the two people involved and that Christians believe that the only thing that counts is the religious ceremony of marriage. This person does not believe it is anyone's business outside of those involved whether they choose to make that contract or not. He or she believes that Christian organizations have been at the forefront of opposing instating homosexual marriage.  S2 believes that official policies are everyone's business since as a society we have to exist together and that what one does legally needs to be approved of by the majority. He or she believes that one needs to have a significant justification to change the way things are now.", "Natural_Summary_Text_2": "S1 and S2 are discussing gay marriage.  Both seem to be somewhat in favor, although S2 seems a bit indifferent to the issue.  S1 feels it is unfair for the gay community to be forced to recognize heterosexual marriages while gay citizens are denied the right to wed.  S2 believes things, including gay marriage, should be voted on and that right and wrong are personal judgments.  S1 then wonders if S2 feels all civil rights should be voted on.  S2 advises that civil rights are actually constitutional rights and cannot and should not be voted on and does not feel that unmarried people, gay or straight are not denied civil rights.  Two people with similar opinions but different views.", "Natural_Summary_Text_1": "S1 asserts that marriage is a contract between two people and the state and that it is not appropriate for religious institutions to be involved with that decision. He claims that because he is forced to accept heterosexual marriages, society should be forced to accept homosexual marriages. He accuses Christian organizations for supporting anti-gay legislation and claims that denying same-sex marriage is unjust, and that preventing same-sex marriage is a method of promoting heterosexual privilege. S2 argues that heterosexual marriage is the status quo, so it rests on proponents of same-sex marriage to demonstrate that this new definition of marriage is superior to the current definition. He argues that we do not actually have a basic right to love or to marry whomever we love."}, "Key": "1-9391_451_450__456_457_458_461_463_466_4"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 calls S2 a sodomite and racist. He rejects S1's husband as being his husband. He believes they are living in sin and they need to repent. He thinks hell awaits them both. S2 states that he has been married for ten years and that his husband isn't white. He states that he never lived in Sodom and is from Houston. He states he has documents from his MCCR church ceremony that was witnessed by hundreds to prove his marriage. He believes that S1's judgement of him is itself a sin. He does not believe that homosexuality is a sin and rejects what S1 has to say on the subject. He states that if he does not believe it then it is not the truth.", "Natural_Summary_Text_4": "S1 calls S2 unrepentant, racist and a sodomite. She furthermore adds that the other woman is without a husband and living in sin. She declares that hell awaits her and her illicit husband and S2 is too stupid to be saved.  S2 argues that she has in fact been married for the last ten years and she doesn't accept any gay sex proposals unless it's from her white husband. And adds that S1 needs to go back to English class and brush up on her vocabulary. She declares that she has documents to prove she is married. She then tells her to preach that mess to somebody stupid enough to actually listen to that. She adds that S1 doesn't have the power to save anyone she's", "Natural_Summary_Text_3": "S1 and S2 are having a heated discussion regarding gay marriage.  S1 believes those who are gay and practice gay intercourse are sodomites and should repent for their sins and refers to S2 as a racist.  S2 professes while he is not only married to a man, his husband is also not white and he; therefore, should not be referred to as a racist.  S1 does not feel S2 and his husband are married, but advises they are living in sin and should repent.  S2 advises his marriage was legally carried out in a church and questions S1's need for repentance due to his judgment and refusal to accept S2 and others like.  S1 feels S2 cannot be saved.", "Natural_Summary_Text_2": "Two people are in an argument.  S1 states that S2 is an unrepentant, racist Sodomite, who would hop on to any gay sex proposal.  He denies that S2 has a husband and says that they are both living in sin and need to repent of their illicit sexual activity.  S2 retorts by stating that he has a husband with the documents to prove it, as he was married in a mass ceremony witnessed by hundreds in a local MCCR Church.  He states that he doesn't accept gay sex proposals except from his husband, and he's not a Sodomite since he lives in Houston.  He also claims that S1 needs to repent of his judgements, as that is a sin.", "Natural_Summary_Text_1": "S1 accuses S2 of lying and calls him a racist sodomite.  S2 retorts that he is not a Sodomite but a Houstonian.  He was married to a black man in 2003 and recommends that S1 obtain a remedial education in the use of the English language.  S1 repeatedly chastises S2 and his husband for living in sin and their need to repent.  S2 states that he does not listen to people who preach like that, and challenges S1 to call to mind her own sins for which repentance would be appropriate.  S1 says that S2 and his husband are going to hell.  S2 replies he does not believe it, he suggests S1 preach to someone stupid enough to believe her."}, "Key": "1-10978_111_110__114_117_123_124_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 is not against gay marriage. Britain has it and he hasn't seen it have a negative impact on anyone. He thinks that gays do not have a right to marriage, but it should be allowed because it doesn't harm society. He wonders why there is not a positive approach to marriage by gay people. While he views homosexuality as a sin, he views other things as a sin as well. S2 talks of gay marriage in history and that it is false to claim marriage has always been a man and woman. S2 concedes it may not be a right, but thinks that also applies to heterosexuals. He does not view gay marriage as a threat to Christianity and asks how Britain got it.", "Natural_Summary_Text_4": "S1 is not against gay marriage. Britian has accepted gay marriage for a while and the sky hasn't fallen yet. He argues that gay people should be allowed to marry, not because they have a right but because it does not harm our society. He questions why there isn't a more positive approach to gay marriage by gays themselves. He adds that he believes being gay is a sin and everyone should be able to find their own path to hell.   S2 claims that gays have existed in our history and questions what S1 is even arguing about if he is for gay marriage. He argues that gay marriage isn't a threat to Christianity and that's not the reason people want to ban gay marriage.", "Natural_Summary_Text_3": "Both S1 and S2 are in favor of same sex marriage, but for different reasons.  S1 also is in agreement with the Christians who believe gay marriage is a sin.  While S2 feels gay couples should be granted the right to wed, S1 is of the opinion gay couples should be able to marry just because others are able to marry, even citing the fact that incestuous couples are permitted to marry and have children.  S1 wonders why gay people themselves are not taking a more positive approach to obtaining the right to marry advising the practice is accepted in Britain and has effected only the gay community.  S1 still does not feel gay marriage is a threat to Christian society.", "Natural_Summary_Text_2": "Two people are discussing gay marriage.  S1 states that US laws doesn't say man and woman because it presumes that marriage is between a man and a women.  He makes the argument that gay people should be allowed to marry not because of an automatic right, but because it does no harm to society.  He states that in Britain, gay marriage has had no impact to society, and even though Christians believe gay sex is a sin, many other people commit sins and are still allowed to marry.  S2 states that the fact that gay marriage in ancient Rome was allowed means historically it wasn't always between man and women, as claimed, and gay marriage does not threaten Christianity.", "Natural_Summary_Text_1": "S1 is in Britain where the experience with some years of gay marriages has allowed her to be comfortable that it is not a problem, although she believes gay sex is a sin. She argues that marriage is by definition between a man and a woman even if it is not stated, just as it would not be expressly specified to be between a man and a goldfish.  S2 sees S1 as being anti-gay marriage as a result and challenges her about it, but S1 is actually unopposed to gay marriage.  S1 and S2 also discuss the issue of whether possible production of handicapped children, such as in incestuous relationships or others involving genetically specific information should be barred on public policy grounds."}, "Key": "1-9391_332_324_1_335_338_339_341_343_347_14"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 favors civil unions and views marriage as a sacrament. He feels he is allowed to vote as he wants for whatever reason he wants. He believes he can mix religion and government if he chooses, but the government can not. He does not agree with S2's suggestion that states be allowed to vote on what other states do. S1 thinks granting gays the right to marry has a financial impact on everyone. S2 thinks if S1 favors civil unions he should for everyone. Heterosexual marriages should be changed to civil unions. He thinks the Bible has nothing to do with law. He views marriage licenses as a secular documents and thinks religion and government should not be mixed and rights shouldn't be voted on.", "Natural_Summary_Text_4": "S1 reminds S2 that he is in favor of civil unions, not just marriage. He also declares that he is a religious person and that the Bible is clear on homosexuality. He lets him know he won't vote in favor of civil unions. He argues that voters can do as they please. As a voter he chooses not to want same sex marriage included under the definition of marriage. S1 thinks that he has proven the fact that gay marriage does affect us financially.  S2 argues that the Bible has nothing to do with the law. He states that the Bible is nothing but a bunch of fairy tails. The government doesn't consider marriage to be a sacrament. Marriage licenses are contracts and not a religion.", "Natural_Summary_Text_3": "S1 contends he/she is in support of civil union rights for same sex couples but opposed to marriage rights.  S2 believes if a civil union is to be the only right given to same sex couples, then the same should be true for heterosexuals as well.  S2 also feels the Bible should have nothing to do with the law, advising the American government does not recognize marriage as a sacrament due to the separation of church and state.  While S1 agrees church and state are separate entities he/she believes voters can cast a ballot in any direction they so choose, which essentially boils down to each voter's religious beliefs. S1 contends marriage rights for gays effects the financial welfare of every voter.", "Natural_Summary_Text_2": "Two people are discussing civil unions and marriages. S1 contends that he favors civil unions for homosexuals but not marriage, since he is religious and views marriage as a sacrament.  He also states that he can vote using whatever criteria he feels, and though the government can't establish religion or give special consideration to certain groups as a voter he can.  S2 retorts by stating that civil unions are not equivalent to marriages.  He states that the US government does not consider marriage a sacrament and he states S1 is mixing religion and government.  He also states that the majority shouldn't vote on the civil rights of another group that will not affect them, which S1 states that financially it will.", "Natural_Summary_Text_1": "S1 is in favor of civil union laws for gay couples, but has a religious based objection to gay marriage because she deems marriage a sacrament and homosexuality a sin according to the bible.  S2 considers the bible to be a complete work of fiction, and makes the argument that a majority group should not deny a minority group a right when that right does not hurt the majority in any way.  He likens the situation of gay marriages being denied by a majority to the idea of California being able to vote to ban the citizens of Michigan from driving.  S1 says S2 should devote more time to perfecting civil union laws, and that gay marriage does hurt the majority population financially."}, "Key": "1-9391_22_20_1_30_31_32_45_46_47_50_12"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 says it is wrong for gay activists to compare public disapproval of homosexuality with race discrimination. He takes a jab at gay activists love comparing public disapproval of homosexuality with racial discrimination. He has complaints about the public's overwhelming disapproval of another human being's behavior. He notes that the two are two different entities and can't truly be compared. Furthermore, he states if you were fired it would be for being incompetent rather than being gay. He thinks that the questions that the GUEST is asking are not relevant enough to answer them. In the end S1 states that gay activist will soon find out why the behavior and thoughts are what they are. The both argue that each one's wrong.", "Natural_Summary_Text_4": "Two people are discussing the difference between homosexuality and racial discrimination.  S1 contends that one is a hatred or fear of another human being, while the other is a disapproval of someone's behavior.  He states that if a homosexual was fired, it would be for incompetence rather than for being gay.  S2 retorts by stating that it is perfectly legal in most places in the U.S. to fire someone simply for being gay, not for incompetence.  He also states that he is currently sitting in his pajamas being gay.  He then questions what behavior that he is exhibiting that warrants disapproval.", "Natural_Summary_Text_3": "Two subjects are discussing discrimination against homosexuals in the workplace.  S1 feels there is no comparison between racial discrimination and disapproval of homosexual relationships.  S2 advises it is currently legal to fire someone simply for being gay rather than their ability to complete the job correctly and feels this is discrimination.  S1 feels this is incorrect as discrimination is defined as a hatred or fear of another person or group while disapproval of gay relationships is due to not agreeing with another's behavior.  S2 doesn't feel being gay can be described as a behavior.  S1 feels there is no issue with this practice.  S2 wonders what behavior can be disapproved of if the person does his/her job correctly.", "Natural_Summary_Text_2": "S1 claims that it is inappropriate to compare opposing homosexuality with racial discrimination. He explains the difference that racial discrimination is the fear of a particular person and that opposing homosexuality is based on disapproval of a person's behavior. He proposes that if a homosexual were fired from their job, it would be due to their incompetence and not due to their homosexuality. S2 objects to S1's claim that homophobia is disapproval of behavior, questioning which behaviors warrant disapproval. He claims that being homosexual is in itself not a behavior. He also argues that homosexuals are frequently legally fired for their sexual preference with no regard for competence. Finally, he asks what a gay activist is and S1 responds by recommending S2 google the term.", "Natural_Summary_Text_1": "S1 believes that gay activists compare public disapproval of homosexuality with racial discrimination. This person does not agree that this is a viable comparison because they believe that racial discrimination is the hatred or fear of another human being, while the other is just disapproval of another person's behavior. They believe that employers base their employment on competency and not sexuality.  S2 does not agree that being homosexual is a behavior, and that it is within the rights under current states' laws for employers to let their workers go because of one's sexuality. They believe this is discrimination and not just disapproval because the law supports the right for employers to release employees solely on the fact that they are homosexual and not due to competency."}, "Key": "1-9390_2_1__3_6_7_8_10_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 does not believe that the Defense of Marriage Act is unconstitutional, and that the Supreme Court has not ruled on it stating that it is. He or she believes that public officials who make up their own laws that ignore what has been passed by the mass majority should be removed from office and that homosexual individuals should be educated or deported.   S2 believes that homosexuals are hard working, dedicated and talented people that serve to sustain the country just as much as anyone else. This person does not believe that their rights are dictated by the Bible or any religious texts, and that those who wish to enforce their beliefs on others invite a dangerous idea of a police state upon the country.", "Natural_Summary_Text_4": "S1 said that DOMA isn't unconstitutional as SCOTUS has not ruled on it and that Obama, Holder, and others should be impeached for not heeding the wishes of the majority. He said that those who are gay should be deported. He quoted scriptures, Romans, and said that S2 was lost and heading to hell.  S2 expressed his belief that gays are needed by the US and stated that they are hard-working and outstanding. He said he aced his Conductor's promotion and if he was deported the Bibles S1 loves so much would not ever get delivered on those box cars. He then said that S1s views are unproductive for the American people and that most people would like to shake their fists at S1.", "Natural_Summary_Text_3": "Two people are discussing marriage laws.  S1 states that DOMA is not unconstitutional, and believes that Obama should be impeached and the pro gay supporters should be educated or deported.  He then quotes Romans chapter 1, which states that God gave man over to shameful lusts and to a depraved mind.  S2 rebuts by stating that gay people are the life blood of the Country, and that his rights as an American Citizen are not dictated by the Bible or any holy book.  He states that S1 seeks to impose a Christian state, which does nothing positive and does not empower American Citizens.", "Natural_Summary_Text_2": "S1 cites bible verse to S2 in order to support his argument that homosexuality is depraved.  S2 argues that homosexuals are productive members of society, citing his career as a conductor with a railroad, and noting his rights generally as an American citizen.  S1 calls Obabma a little cretin and thinks he and Holder should be impeached.  He warns S2 that he is going to hell, having purported to cite lines 26 - 28 from Romans Chapter one.  S2 suggests that S1 is a reactionary who would bring back a McCarthy era.  He also notes the bible is not an official text relating to the laws of the United States and that S1's views are unproductive and only foment discord.", "Natural_Summary_Text_1": "S1 claims that the defense of marriage act is not unconstitutional, that the supreme court has yet to rule on it, and that President Obama should be impeached for his behaviors in office. He further suggests that proponents of same-sex marriage should be educated or deported. He then presents a quote from the Bible to justify why homosexuality is wrong. S2 argues that there is nothing wrong with homosexuals and that they are actually an important part of the country. He cites his own ability as a railway conductor and suggests that it would be difficult to find someone to replace him if he were deported for being a homosexual. He also argues that the laws of America are not based on any religious texts."}, "Key": "1-10354_4_3__5_12_13_14_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 does not believe the argument has to do with marriage equality, and has everything to do with redefining the very meaning of marriage to allow homosexuals to marry. This person does not believe that equality and discrimination are valid opinions in support of homosexual marriage. They believe that marriage was instituted for the purpose of a stable nuclear family to procreate and that homosexuals have no place in such an institution. This person does not believe homosexuals to be normal, and believe that heterosexuality is normal.  S2 argues that it is, in fact, discrimination, because they cannot marry the person of their choice, but a heterosexual person can. This person does not believe that this is equality, and that it is not fair to them.", "Natural_Summary_Text_4": "S1 states that allowing gays to marry redefines the meaning of the word marriage because marriage was created to be union between a man and a woman that leads to child rearing within \" a stable nuclear family\". He further said this has nothing to do with gays. It has nothing to do with guys giving each other rings and kidding themselves that they are \"normal like straight people. \"  S2  questioned S1 asking him why he believes that that redefining marriage is a bad thing. He then said that if he cannot marry who he wants but a straight person can, it is discrimination. He said that he could not define it as anything else. He said S1 was never in Los Vegas.", "Natural_Summary_Text_3": "Two people are discussing gay marriage.  S1 states that it has nothing to do with marriage equality, but an attempt to redefine the meaning of marriage.  He wishes that the gay posters would be honest and not use words such as equality and discrimination where they don't apply, since marriage is an institution created to be a union between man and woman that leads to the creation of children.  He states that marriage has nothing to do with two people giving each other a wedding ring.  S2 retorts by questioning how it is not discrimination if he can't marry the person of his choice but a heterosexual can. He also states that Las Vegas itself refutes S1's arguments.", "Natural_Summary_Text_2": "S1 maintains a fundamental view of marriage as being between a man and a woman and as having been create to have children in a stable environment.  Gay marriage, S1 believes, would change the very nature of the marriage relationship, while merely providing gay men the ability to wear wedding rings and delude themselves that they are normal married people, although he concedes the latter part is only his opinion.  S2 argues that excluding gays from being able to marry the person of their choice is discrimination.  S1 argues that discrimination and equality are inappropriate terms because the very concept of marriage excludes homosexuals.  He regrets that more gay posters in the forum do not agree with him on the point.", "Natural_Summary_Text_1": "S1 claims that the debate over same-sex marriage has nothing to do with marriage equality because allowing homosexuals to marry would require redefining the meaning of marriage which is unacceptable. He argues that marriage is an institution that was created to be a union between a man and a woman with the intention of creating children as part of stable nuclear families. He also suggests that homosexuals are abnormal and are trying to convince themselves that they are normal by changing the law to allow themselves to get married. S2 claims that redefining marriage might not be a bad idea and claims that preventing a homosexual from marrying the person of their choice is discrimination. He also suggests that S1's opinions do not match reality."}, "Key": "1-10073_26_23__27_28_29_79_85_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes that Vitter and Craig should be stones on the Capitol Steps as well as the people they slept with. This person states a hypocrisy with Fred Thompson, where he got his eighteen year old girlfriend, Sarah Lindsey, pregnant which prompted an immediate marriage that lasted for twenty-six years before a divorce was ordered. After remarrying, S1 points out that in addition to three children from the previous marriage, Thompson had two more with a woman who was younger than his oldest child. S1 states that James Dobson does not believe Thompson to be a true Christian.   S2 seems to partially agree with S1, though this person believes that a stoning would result in the arrest of those who perpetrated it on drug charges.", "Natural_Summary_Text_4": "S1 suggested stoning Vitter, his hooker, Craig and the man he was with on the Capitol steps. He talked about a \"Christian man\" who married young, had  children, divorced his first wife wife, married a  woman younger than his oldest child, and now, at the age of 65 has two very young children. This man says he is a member of the Churches of Christ but James Dobson says this man is not a Christian.  In regards to the stoning comment, S2 with humor said that those who did stone people on the Capitol steps could get arrested on drug charges. He asked if Dobson thinks the man is pretending to be a Christian and said that he believes Dobson is mostly self serving.", "Natural_Summary_Text_3": "Two people are discussing the sanctity of Christian marriage.  S1 expresses his wish that Vitter and Craig be stoned.  He then states a tale about a man named Fred Thompson who claims to be a member of the Churches of Christ.  He states that Fred married his pregnant girlfriend at 18 and were married for 26 years, having multiple children, until they divorced and he married a woman who is younger than his oldest child.  He then states that James Dobson says Fred is not really a Christian.  S2 questions if Dobson thinks the man is just acting, to which S1 retorts, asking if Dobson thinks period.  S2 states maybe about himself, but on issues its hard to say.", "Natural_Summary_Text_2": "S1 and S2 discuss several prominent individuals with respect to their sex lives.  S1 proposes that Vitter and Craig should be stoned to death along with Vitter's hooker and a gay partner of Craig's.  S2 jokes that stoning could draw drug charges.  S1 heaps opprobrium on Fred Thompson for having had a teenage pregnancy out of wedlock occur and then subsequent long term marriage and divorce.  He's critical of Thompson for having a second wife and young children at the age of 65, and for being only vaguely christian through identification as a member of Churches of Christ.  He notes James Dobson says Thompson is not really a christian, but it is clear neither S1 nor S2 respects Dobson either.", "Natural_Summary_Text_1": "S1 suggests that politicians should be stoned in public as punishment for their deviant sexual behaviors. He cites the story of Fred Thompson, a politician who was married at 17 and fathered three children with his first wife. He was then divorced and remarried to a woman younger than his oldest child with whom he fathered two more children. It is unclear why this is relevant. He goes on to claim that Fred Thompson is a member of the Churches of Christ which is a religious cult and that he is not really a Christian. S2 jokes that if you stone someone in public you might be brought up on drug charges and wonders if people think Fred Thompson is simply pretending to be religious."}, "Key": "1-7185_224_223__225_226_228_229_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "Two people are discussing whether or not being gay is a choice.  S1 contends that people are born black, but they can control their zippers to avoid gay sex.  He jokes that if gay people don't have a choice then S2 had to be on his guard in shopping malls and he states that gay sex is in violation of the Word of God.  S2 rebuts, stating that gay people do not have a choice, and refutes S1's joke by stating that they are discussing sexuality, not action.  He states that being gay or straight is something that happens, and based on S1's logic gay people should stay celibate simply because someone won't like what they do.", "Natural_Summary_Text_4": "S1 states that while a person may be born a certain color he  should be able to control his or her sexual behavior and not engage in \"gay sex sin\". S1 stated that if homosexuals cannot control this behavior, then public places are unsafe. He closed his comments by saying that homosexual sexual behavior is a choice and is against God's word.  S2 pointed out that people who are gay were born that way.They did and do not have a choice about their sexual orientation. They either like girls or or they like guys and that it the way it is.  He said that S1 believes that gay people should remain celibate all of their lives just because he doesn't approve of their behavior.", "Natural_Summary_Text_3": "S1 and S2 are discussing gay issues.  S1 feels gay people make a choice to engage in sexual relations with members of the same sex.  S2 supports being gay is not a choice someone can make, but instead is how an individual is born.  S2 poses the question that if what S1 says is true, then he/she must also believe that gay people can choose the gender of those they are sexually attracted to.  S1 believes engaging in gay sex is a violation of God's word and is; therefore, a sin.  S2 then asks S1 if he/she believes in support of hisher theory that gay people should then be celibate forever so as to not offend God and \"his word.\"", "Natural_Summary_Text_2": "S1 thinks that comparing homosexuals to black people is a bad argument because people are born black but gay people make a choice to have gay sex which he considers to be a sin. He thinks if it is not a choice then we should be on guard at shopping malls and street corners. The implication is people could be attacked if is isn't a choice. He views gay sex as a violation of the word of God. S2 laughs at the idea of homosexuality being a choice and says that he does not have a choice in being attracted to either males or females. He talks about sexual attraction verses the actual sex act. He rejects the idea gay people should be celibate forever.", "Natural_Summary_Text_1": "S1 suggests that homosexuals can choose to ignore their sexual impulses which is different than a person controlling their ethnicity. He claims that if homosexuals do not have a choice about whether or not to engage in homosexual fornication, then they would be sexually assaulting people.   S2 suggests that homosexuals do not have a choice about who they are attracted to. He clarifies that he is referring to the lack of choice regarding sexual attraction, that being straight or gay is not a choice, rather than the choice regarding whether to engage in homosexual acts. In response to S1 claiming that homosexuals should not engage in \"illicit gay sex,\" S2 asks if it is therefore appropriate for a homosexual to remain celibate their entire lives."}, "Key": "1-10073_176_174__179_181_183_185_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 argues that banning same-sex marriage is nothing like racial segregation. He claims that S2 is misrepresenting his argument and that he was not actually implying that the situation for homosexuals is completely unlike that for blacks. He argues that S2 does not understand the point he is trying to make, that S2 is simply wrong, and that S2 has only succeeded in discrediting himself.  S2 rejects S1's claim that banning same-sex marriage is nothing like racial segregation. He argues that it is exactly like racial or any other type of segregation that has ever occurred. He suggests that whenever a discriminatory behavior like racism, sexism, anti-Semetism, or homophobia is challenged, the perpetrators claim it is not the same as previous instances, but that all instances of discrimination are inherently the same. He interprets S1's argument as implying that it would not be as bad if society treated homosexuals the same way they treated blacks in the past. He also attacks S1, claiming that personal attacks are not an effective method of validating an argument.", "Natural_Summary_Text_4": "S1 makes the statement, 'It's nothing like racial segregation...' When questioned about this statement the speaker begins repeatedly asking what it was that he had contended. He claims that the other speaker has no idea what he meant by his statement and that he is just making unfounded assumptions. He insists that he made no position about what segregation means definitely. He insists further that he didn't imply the plight of blacks and gays were dissimilar.  S2 argues with S1 about what he believes the speaker actually meant from his statement. His first point is adamantly made, that the segregation of blacks is in actuality just like the segregation that is faced by homosexuals. He insists that the prejudice that they face is just like the previous prejudices, that in their time were also seen as as 'different'. He also claims that the statement implies that if the segregation of blacks were imposed on homosexuals, that it would not be less wrong. He concedes his assumption was made in error yet he has discredited the speaker.", "Natural_Summary_Text_3": "The text begins with S1 saying \"It's nothing like racial segregation.\"  But the statement he was responding to is not mentioned in the text.  The statement he was responding to is also not from the other writer (S2), but from someone mentioned later as Addison.  S1 believes the other writer (S2) has misunderstood his comment to Addison.  He doesn't believe his words had anything to do with denying the current plight of gay people is similar to the past plight of black people. He believes the other writer is jumping to conclusions, possibly based on information in other posts.    S1 is offended by the other writer's use of the phrase, \"It's nothing like racial segregation.\"  He believes the words are about the possibility of segregating gay people.  He the words imply that the segregation of gay people would either be nothing like the past treatment of black people, or would be less wrong.  He believes segregation throughout history is always the same, but people always deny the similarities.  This includes segregation according to race, religion, or sexual orientation.  At one point, he admits he may have interpreted the other writer's words incorrectly.", "Natural_Summary_Text_2": "S1 states that \"it is nothing like racial discrimination\", in regards to discrimination against gays, and denies saying it. He does not feel that his post implied that the plight of gays is nothing like the plight of blacks. He asks why S2 would think that he implied that, and calls the assumption that he did wrong. Several times he accuses S2 of not knowing what he is talking about. He says that S2 has only succeeded in discrediting himself.     S2 responds to S1 saying, \"it is nothing like racial discrimination\", with the argument that all segregation, throughout history, has been the same. That the perpetrators have used the same argument to support it, namely the claim that \"this is nothing like the last\" and that, without exception, it is. He contends that if S1 had not wanted to compare racial discrimination to discrimination against gays he miss-phrased his post, and asks S1 to explain himself. He accuses S1 of throwing a temper tantrum to validate his argument, and that the job of discrediting him is painfully easy.", "Natural_Summary_Text_1": "S1 does not believe that their argument has anything to do relating to racial segregation. They believe that S2 has either misinterpreted their argument or is ignorant of what was actually argued. This person argues that because S1 cannot answer what they thought they were arguing, that they cannot truly validate their argument. They also argue that because of this, S2 cannot prove what they said was correct or incorrect. They state that their argument was not meant to be taken that the plight of homosexuals is nothing like the plight of racial minorities.  S2 believes that S1's argument purports that racial segregation has no parallel to discrimination against homosexuals. They believe that every time prejudice, racism, sexism, anti-semitism or homophobia is challenged, the perpetrators always claim that it is nothing like the previous time but in truth it actually is without exception. This person believes that S1 is arguing that discrimination against homosexuals is different from discrimination against racial minorities. Eventually they realize that they may have been wrong and retract their statement and apologize."}, "Key": "1-9391_370_363_1_371_372_373_374_376_377_378_384_385_389_390_391_392_394_395_11"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 claims that homosexual couples are not eligible for marriage because there are rules for which relationships quality as a marriage and homosexual couples do not fall within those rules. He argues that this is the same as people being prevented from marrying someone who is already married, an animal, a minor, or a sibling. He claims that this is different from the previous rule limiting marriage to intraracial couples. He further argues that heterosexual relationships are more valid at the evolutionary level because they have a reproductive purpose.   S2 argues that gender should be removed as a criteria for marriage in the same way that race was because it is inappropriate and discriminatory. He claims that it is unfair for heterosexuals to be eligible for the benefits of marriage such as the ability to make important medical decisions, to cover each other under their insurance, to file taxes jointly, to purchase property together, to visit each other in the hospital, or to be a legal heir, when those same privileges are denied to homosexuals.", "Natural_Summary_Text_4": "S1 claims that because there are rules doesn't mean one group is barred from the custom. Argues that the denial of marriage between races as discrimination is not similar to argument based on gender. Based on the rules, the barriers of marriage are the same for both heterosexual and homosexual couples and therefore one group is not being discriminated against. Just as no one can marry someone that is already married, an animal, or a minor, there are rules. He concedes that there is nothing wrong with changing something that is commonly agreed upon as need changing, but as it's not the case, homosexuals cannot have a change just because they want it.   S2 is of the opinion that just like race was found to be a discriminatory qualifier for the criteria of marriage, so should a couple's gender be found discriminatory criteria also. He says that it is not just the custom that's denied, it's their rights as individuals in a relationship to obtain benefits, to visit in the hospital, or to purchase property together.", "Natural_Summary_Text_3": "S1 believes people are using some valid arguments for keeping homosexual couples from getting married, but he does not necessarily side with all of those arguments.  He suggests that couples of any kind, gay or straight, do not have rights.  Individuals are the ones who have rights, but those rights are limited by rules that cannot be changed just because somebody personally wants them changed.  For example, a person does not have the right to marry someone if they are already married, or someone who is a minor.  Further, he believes heterosexual couples can be viewed as more valid on an evolutionary basis.    S2 does not believe there any valid arguments to keep homosexuals from marrying.  He believes the issue of gay marriage is no different than than of marriage between different races.  He also disagrees with the notion that only individuals have rights.  The gay marriage issue is largely about the rights of couples, including the right to visit one another in a hospital, the right to inherit from one another, and the right to file taxes jointly.  He also believes the true reason for people being against gay marriage is disapproval of gays having sex.", "Natural_Summary_Text_2": "S2 feels that the right to recognition of two people to form a couple is being unfairly denied homosexuals. That a heterosexual couple is allowed to make life decisions, file taxes and be covered under insurance jointly, inherit property, and more. He compares the ban on homosexual marriage to the former ban on interracial marriage, and feels that having gender as a qualifying factor for marriage is equal to using race as a factor. He calls the arguments against homosexual couple semantic, and feel that they are being denied rights because some people don't like the idea of them having sex.     S1 denies the inequality of restrictions between homosexual and heterosexual couples and does not feel that they have the right to change this law. He denies that race and gender  are equivalent differences and says that there are no unshared barriers between hetero and homo sexual couples. He states that it is individuals that have rights not couples, and that no-one can marry; someone married, an animal, a minor, or a sibling. He uses evolution to validate the view that gay relationships have less meaning than straight relationships.", "Natural_Summary_Text_1": "S1 believes that there are more limits to marriage than just the limit to opposite sexes and that if you do not follow the rules you do not qualify for the benefits of marriage. They do not believe that just because there are rules, anyone is barred from the custom. They do not believe that homosexuals have the right to the changes they want when it comes to marriage as they argue that the rules are global and not unequal. They argue that racial inequality between African Americans and white Americans in which they cold not marry was unequal, but that the situation cannot be compared to homosexuals because they are dissimilar.  S2 believes that S1 is wrong and that the argument for equality can apply to homosexuals as well, since heterosexual couples can marry while homosexual couples cannot. They believe that just as race criteria from marriage has been removed upon the grounds of being inappropriate and discriminatory, so should gender. They argue that because of the rules, heterosexual couples have benefits that homosexuals don't."}, "Key": "1-9391_518_516__520_523_526_531_539_8"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 claims that people who support same-sex marriage and all other godless heathens will go to hell for their beliefs and behaviors and that God's mercy is the only thing keeping them out of Hell at the present time. He argues that if S2 believes the Gospels are fiction, then it should be simple to provide evidence against the resurrection, but that this evidence is not available because the Bible is true. He further claims that President Obama is a spiritual imbecile for supporting same-sex marriage and attempting to repeal the Defense of Marriage Act and that anyone who supports him is also a spiritual imbecile.   S2 accuses S1 of having poor rhetoric because he does not provide any evidence and resorts to using insults and threats and shifting the topic. He also attacks S1 for referencing Fox News as a source of information. He also points out that S1 claims he is going to Heaven because of his belief, but then cites several Bible verses suggesting that you must do more than just believe.", "Natural_Summary_Text_4": "S1 insists that all those supporting or belonging to the homosexual community are going against the teachings of God from the Bible. He labels S2 and others like him as heathens, warning them to immediately change their ways and recognize Christ's authority; or else, fall into the Pit. He provides a link to an article about Obama's gay-marriage stance calling it madness. He the resurrection of Christ cannot be disproved. He insists until the resurrection is 'busted' they remain whiners and deniers of Christ.  S2 believes that the belief systems of Christianity are unfounded and demands to be shown evidence of God and other biblical assertions. He refers to Christian belief as fairytale and delusion. He ridicules S1 for his predictable debate style claiming that S1 lack of valuable argument is typical for all Christians when confronted with reality, thereby his position's validity is made for him. He insists that when confronted with the fact that as a Christian, belief must be accompany good deeds, S1 returns only insult and threats of eternal damnation.", "Natural_Summary_Text_3": "S1 believes that all unrepentant homosexuals will spend an eternity suffering in Hell after they die.  He repeatedly cites Christianity and the Gospels as sources of information that back him up in this belief.  He challenges the other writer to prove the Gospels are fiction and that Christ's resurrection is false.  Failure to do so means failure to disprove that homosexuals will suffer forever in Hell.  He also says that President Obama's involvement with gay rights proves that Obama has no spiritual credibility.    S2 does not believe homosexuals will suffer forever in Hell after they die.  He does not believe proving his stance requires him to disprove the Gospels.  He suggests that whenever the other writer has no proof to offer, he relies on insults.  Further, he suggests the other writer's words and attitude are hypocritical in terms of Christian religious values.  In response to the President Obama reference, he focuses on the other writer's news source.  He doesn't believe Fox News is a credible news source, and sees its use as weakening the debate.", "Natural_Summary_Text_2": "S1 believes that all homosexuals are doomed to the fiery pits of hell, grouping them all together and calling them godless heathens. He is of the mind that it is his christian duty to inform them of this,as non of S1's brethren will. He feels that until some scholarly evidence is produced that refutes the resurrection of Christ, any non-believers are just noisy Christ deniers. He uses strong words, threats, and insults, to validate his argument, as well as a story on Fox news.     S2 calls S1's entire argument into question, does not believe that he will be going to Hell, that it doesn't exist, and that there is no proof to the contrary. He feels that if proof of the resurrection of Christ existed it would have already been produced. He accuses S1 of dodging the argument and attempting to reverse the burden of proof, he calls this tactic pathetic  and uses Fox as proof of this point. He says that he does not think that insults and threats are an intelligent or useful form of debate.", "Natural_Summary_Text_1": "S1 believes that homosexuality will be punished and believes that it is a sin. They believe that President Obama, who supports homosexual marriage and a repeal of the Defense of Marriage Act is just as at fault for doing so. This person does not believe that there is any solid proof that debunks the resurrection of Jesus Christ. This person does not believe that S2 has any evidence to support their argument that what they believe is untrue. This person calls for proof and believes that they have not received any. They believe it is their Christian duty to warn people of Hell and the consequences of their actions.  S2 does not believe that there will be consequences in an afterlife for homosexuality and calls for proof that it will actually occur. They believe that those who believe in a Christian Hell simply do so to threaten people and have no grounds to base their claims upon. This person believes that S1 dodges the argument and refuses to answer questions with actual proof of their validity."}, "Key": "1-10951_14_13__15_16_18_20_21_22_23_24_30_31_32_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 feels that Jim and MrWrite's argument has become a battle of insults, and that this is unfortunate, but that the comparison between the argument against gay marriage and that against interracial marriage is not baseless. He cites that opponents of gay marriage use many of the same arguments that were used to oppose interracial marriage, before that was outlawed. He believes that most opponents of gay marriage do so for religious or homophobic reasons. He argues that words get redefined on an ongoing basis, citing the word war being modified to suit political purposes. He does not believe that the justifications for the current war in Iraq have much merit, and that the same argument could be made for reentering Vietnam or Korea.     S2 doesn't feel that interracial marriage and homosexual marriage have anything to do with each other. He feels that separate-but-equal would apply to the records of gay couples but wouldn't justify any restrictions of there rights or privileges as a couple. He preemptively denies being homophobic, citing his having gay friends who know what his views on the word marriage are. He does not feel that the Iraq War is technically a new war requiring all of the congressional steps, rather that it was merely a continuation of the Gulf War, or that the same arguments could be applied  to those other conflicts.", "Natural_Summary_Text_4": "S1 cites an article by a law professor which notes that opponents of gay marriage use many of the same arguments that were used by opponents of interracial marriage.  S2 claims she supports interracial marriage, provided it is heterosexual, and notes that she has not made inapplicable separate but equal arguments suggested by the analogy.   She purports to have gay friends and to be sympathetic to gay rights and civil unions but opposes gay marriage on the grounds that it does not meet her understanding of the word marriage.  S1 points out that she is using form over substance, and that the meaning or definition of marriage can change over time, noting that the public universally accepts and refers to the Irag War, despite the fact that the U.S. never declared war against Iraq, or Viet Nam or Korea either.  He suggests accepting an undeclared war as a war does less violence to the meaning of the term war than substituting a Jack for a Jill on a marriage license does to the term marriage.", "Natural_Summary_Text_3": "S1 argues that in spite of the vitriol employed, comparing interracial and gay marriage is a useful analogy. Opponents of gay marriage use similar arguments as those employed by opponents of interracial marriage. S2 argues that this comparison is irrelevant, he has not mentioned religion or interracial marriage in his opposition to gay marriage. In fact, none of the tropes associated with interracial marriage actually apply. He has instead argued that redefining marriage would require redefining several other cultural practices as well. He has also proposed that those seeking to enjoy same sex marriage are doing so out of some form of self-shame. S1 argues that words and associated cultural practices are redefined all the time, providing the example of \"war\" to illustrate his point. In comparison to these major re-definitions, redefining what constitutes a valid marriage seems minor in comparison. S2 brings up a counterpoint to S1's argument about war. S1 clarifies S2's argument about war to illustrate how S2's example is in accordance with S1's original statement. S1 stands by his previous counter-example.", "Natural_Summary_Text_2": "S1 seems to agree with the comparison between interracial marriage and same sex marriage, citing that many of the arguments against them are similar.  He believes that words can be redefined including the word marriage and uses war as an example.  He brings up the fact that war has not been declared since WWII but the country has been involved in war-like situations and typically these are referred to as war.  He sees this as being off topic but this debate ends up dominating the remaining part of the text.  S2 does not agree that marriage should be redefined to include same sex couples.  He does not believe himself to be a homophobe and cites friendships with gay individuals to back up his claim.  His issue is not with rights or the actual relationships themselves, he believes in full rights for gay couples, but he does not believe that the relationships should be able to bear the label marriage because it is not between a man and woman.  When the topic changes to the use of the term war he does not disagree with S1 but gives information challenging previous statements.", "Natural_Summary_Text_1": "S1 believes there is some merit in the comparison of arguments against interracial marriage and those against homosexual marriage. This person points out that many opponents of homosexual marriage use many of the same arguments those who opposed interracial marriage did. They also argue that those who oppose homosexual marriage do so for both religious and homophobic reasons. This person argues that the definition of words get frequently modified in some way and uses the example of the use of the word 'War' when referring to the Iraq War when Congress gave no official declaration of War. They argue that today a lot of military operations are automatically grouped under the word 'War'.  S2 does not believe that using examples of interracial marriage protests has relevance to the argument over allowing homosexual marriage. They argue that any separate marriage provision for Homosexuals should be as inclusive as Heterosexual marriages, but that the two should remain separate from each other by definition. They do not believe that the definition of marriage should change to include homosexual couples."}, "Key": "1-2280_102_99__104_113_117_118_120_121_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 states that homosexual acts are very unappealing and immoral, and does not see any problem with denying the sanctity of marriage, to couples who engage in such behavior. He doubts whether S2 has ever had a lasting relationship, and states that he has been faithfully married for 31 years. He feels that there is a large amount of deviant activities taking place throughout the gay community, citing glory holes in highway restrooms (of which he says that any gay man will talk about if asked)  and a restroom on the I-75 highway being closed down due to gay encounters happening there.     S2 feels that the sanctity of marriage has been denied to loving and committed couples due to americans paranoia over homosexuality, and that those who vote away the rights of others lack moral character. He doubts how S1 (as an outspoken,  straight and conservative man) would have came by his information, and states that S1 must hang out with a very sexually liberal gay crowd. He states his own confusion as to why S1 has any interest in the private lives of homosexuals and further questions whether S1's wife is aware of the interest.", "Natural_Summary_Text_4": "S2 and S1 have had numerous previous discussions about homosexuality and gay rights and S2 is sarcastically suggesting that S1, despite his professed and vocal conservative stance, is actually a closet homosexual who is hiding that fact from his wife of 31 years based on the fact that S1 purports to know so much about what gays would think, i.e.- he obtained that information from his relations with other gays while engaged in secret homosexual relationships.  In a similar dig, S1 suggests that S2 is a closet homosexual because he purports not to know about the gay community's frequent use of highway rest stops as places to hook up.  S1 believes it is an exercise of moral character to use the political process to prevent marriage from becoming bastardized.  S2 argues that recognition of loving committed gay marriage would not be bastardizing the institution of marriage.  The two feel they have similar understandings of references to Ted Haggard and Sartre and use the term gloryhole with a meaning that is not entirely clear from this dialog.", "Natural_Summary_Text_3": "S1 argues that homosexuality is a disgusting habit. He uses certain sexual practices common in the gay community as evidence. Further, S1 argues that supporting gay rights shows the lack of moral character of supporters. S2 retorts that in fact opposing gay rights shows a lack of moral character and accuses S1 of in fact being in denial of his own homosexuality. He bases this accusation on S1's knowledge of aforementioned sexual practices and familiarity with gay cultural practices.  S1 argues that barring same sex marriage is an exercise of constitutional rights and that he has been happily committed to a heterosexual marriage for many years.  S2 argues that gay marriage was denied to married, loving gay couples and that being married to a woman is no indicator of one's true sexual preference. S2 argues that S1's familiarity with gay practices points to him possibly being in denial or hiding his true sexual preference.  S1's repeated mocking of S2, according to S2 does little to hide the evidence of S1's true nature or sexual preference.", "Natural_Summary_Text_2": "S1 is focused on the sexual acts of gay men and places in which they happened.  Within the text it is hard to pick out some of the issues he refers to in passing including HIV and voting.  He is mostly focused on rest areas and glory holes as well as assuming that S2 has never been in a long term relationship like he currently is with his wife of 31 years.  He continues to make insulting comments towards gay men but claims they are not directed towards gay men, just S2.  He refers to someone as a murdering drunk, however it is unclear who he is referring to.  S2 questions where S1 gets his information, having a hard time believing that gay men would open up to a man that he describes as \"Mr. Anti Gay Conservative\".  He accuses him of being gay on the downlow.  He brings up Pastor Ted Haggard twice, the second time mentioning meth in a comparison.  He brings up \"Prop H 8\" and the paranoia that surrounds homosexuality, making it easy for people to vote to lessen their rights.", "Natural_Summary_Text_1": "S1 believes that the amount of homosexual encounters at rest stops is very high and that rest stops are closing down because of them. This person has not found a reasonable refutation of this fact in their eyes from any gay supporter. This person does not see any lack of moral character exhibited by people who are exercising their Constitutional Rights to deny the sanctity of marriage, to what they believe as immoral associations, by not allowing the definition of what they believe marriage to be to change.  S2 believes there is a lack of moral character in those who vote away other people's rights. They use Proposition 8 as an example of this. They compare the example of illicit public sexual acts in rest stops between homosexuals to heterosexual men who also make it public that they do the same with heterosexual women in public places. This person somewhat agrees with S1 that exercising Constitutional Rights isn't morally objectionable, but using that as a platform to deny marriage rights to loving, committed homosexual couples is."}, "Key": "1-9391_147_145_1_157_162_165_170_187_191_196_197_13"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 claims that abortions and unwed couples have nothing to do with wars and earthquakes frequencies. S2 claims that earthquakes have increased exponentially outside of Israel and that the majority makes what ever rules it likes. S1 claims that is a religious argument about the earthquakes and either doesn't apply or if you are religious this isn't the right place to discuss it. S1 claims that making this a religious argument is not needed. S2 claims that references to a loving parent not killing some of their children are wrong. S2 claims that S1 claimed earthquakes are not a natural occurrence. S2 refutes that he stated that. S1 and S2 go back and forth arguing about refuting each other's refutations and inferences. S1 claims that polygamists and so on will want marriage rights now as well after homosexuals. S2 refutes the slippery slope argument.", "Natural_Summary_Text_4": "S1 claims that the Biblical prophecy that there will be wars and earthquakes in the future is not valid proof, that it is merely a recognition that people and nature continue to behave in the same way as time progresses. He rejects the idea that earthquakes have any relationship to people's behavior. He also claims that although the majority has the power to change the constitution, it is still in their best interest to support and accept minorities because they are a significant portion of society capable of swinging power between parties.   S2 suggests that the number of earthquakes has increased in the past 100 years and that this is due to people's behavior. He claims that the majority is able to overrule the minorities as long as it does not violate the constitution. He rejects S1's comments about God's choice to kill people by drawing an analogy with different parenting styles, suggesting that people choose to raise their children in differently, so S1 should not be attempting to understand the reasons behind God's behaviors.", "Natural_Summary_Text_3": "S1 dominates the debate.  He is against using religion, specifically Biblical references in the conversation around gay marriage.  His first comment seems to be arguing against a previous mention of increased earthquakes and wars.  He also argues for the inclusion and support of minority issues despite the fact that we live in a majority rule state.  He argues that first, most people fall into some sort of minority classification and second the minorities are still large in number.  There is a change in the conversation about half way through to genetics in which compares sexuality to a predisposition for alcoholism.  In the end he feels marriage must be consensual and that any parties may be free to leave, whether it is traditional, homosexual or polygamy.  S2 mostly argues the religious points, for example citing the increase in earthquakes outside of Israel in recent years though he mentions another name of who began the conversation around religion.  He questions why the debate remains around homosexuals and whether polygamists fall into similar categories in the genetic argument.", "Natural_Summary_Text_2": "S1 argues that the bible warning of wars and natural disasters is not viable proof nor an argument since wars and natural disasters will always happen. They believe that it is within the majority's best interest to look out for the minority, as the minority still has a great number of people. They state that they haven't been argued that religious beliefs condone homosexuality, but that religious beliefs shouldn't have anything to do with another person's individual life. They refute the idea that earthquakes are a divinely inspired event. They also believe that genetics has more to do with homosexuality and alcoholism than choice or upbringing.  S2 believes that since the number of earthquakes have increased outside of Israel over the past one hundred years, that it is a sign of God's love waxing cold. They believe that the way the United States government works is through the majority until something is viewed as unconstitutional. They argue that genetics does not have anything to do with homosexuality since they also don't believe that alcoholism is genetic.", "Natural_Summary_Text_1": "S1 argues that Biblical prophecy is not proof of America heading in the wrong direction from a religious perspective. S2 notes that the number of earthquakes seen in the last century have increased dramatically, providing evidence to the contrary. S1 argues that a pre-existing religious belief is necessary for any evidence regarding earthquakes to be relevant. S1 argues that religion should be excluded from determining the cause of common events. Further, if God is willing to cause earthquakes because people accept homosexuality but ignores greater tragedies, then God's ultimate benevolence is up for question. All that is required is that enough people want to accept homosexuality for such acceptance to be socially correct. S2 states that S1 is purposefully misunderstanding S2's statements and that God's motivations are ultimately unknowable. S2 argues that S1 is claiming to know the nature of homosexuality and God alike without being an expert on the situation. S2 then asks why gays should be considered acceptable but polygamists are not. S1 admits he sees no problems with polygamy being allowed either."}, "Key": "1-1281_466_275__483_561_576_625_633_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 liked an editorial about President Barrack Obama. S2 claims every Republican candidate wants gays to be in jail by reinstating anti-sodomy laws and gay marriage banned. He claims President Barrack Obama has done more for gays then any other president and that he will come out for full marriage equality but is not trying to impose his views on others as the Republicans are. S1 references S2 as fear-mongering and engaging in gay-pride politics. S2 references the Republicans as being like the brown shirts. S2 claims that Rick Perry supports a Ugandan law that would execute gays. S1 accuses S2 of paranoia. S2 references Japanese internment and killings of Native Americans by the military. S1 states that these events haven't happened since then. S2 that they could happen again. S1 make rude comments about the police not closing meat-markets or hook-up spots. S2 references that that has happened under this constitution and can again. S1 asks what he wants done, a change to the constitution. S2 says a limit to religions role in society.", "Natural_Summary_Text_4": "S1 references a Yahoo News article titled \"On Gay Marriage, Media Gives Obama a Pass.\" He accuses S2 of being a fear-monger, claiming that it is absurd to claim that people are attempting to imprison or execute homosexuals in the United States and that the police are not currently attempting to prevent people from engaging in homosexual behaviors.   S2 claims that every republican presidential candidate in the previous election wanted to ban same-sex marriage and to persecute homosexuals by reinstating anti-sodomy laws. He mentions that although President Obama believes that marriage is between a man and a woman, he is not willing legislate based on his personal beliefs, so he has been a strong supporter of marriage equality, more so than any other president in US history. S2 accuses republicans of basing their legislation of personal beliefs and claims that the rights of homosexuals should be protects through a constitutional amendment that restricts religion's role in society in order to prevent future human rights atrocities like those that occurred to Native Americans and Japanese Americans.", "Natural_Summary_Text_3": "S1 believes that the gay-rights movement, S2 in particular, are paranoid.  There is not much being said to support his argument, most of the conversation is dominated by S2.  He argues that economic issues are more likely to hurt those in the gay rights movement than any possible laws.  S2 has concerns about the possibility of creating a true second class citizens of  the GLBTQ community.  He refers to President Obama of being the only politician to put his beliefs aside and support gay marriage.  He references past injustices to support his claims that it is possible that gays will be lawfully discriminated against.  He mentions Native Americans and the genocide they experienced; Japanese Americans and the internment camps; African Americans and past slavery.  He worries that history will be allowed to repeat itself in the form of discrimination of homosexuals and points out recent attempts at renewing sodomy laws by some politicians.  At the end he seems to be in favor of an amendment to the Constitution to protect gay rights.", "Natural_Summary_Text_2": "S1 does not believe that new laws will call for the imprisonment or execution of homosexual citizens in the United States. They believes that there is more danger of economic collapse under President Obama than those laws concerning the gay issues. They don't think that S2's fears are warranted and such extremes cannot happen again.  S2 believes that every Republican candidate has stood on a platform that opposes gay rights, such as marriage and civil unions and wish to reinstate sodomy laws across the country. They argue that President Obama personally believes that marriage is between one man and one woman, but does not wish to push his personal beliefs into law and instead has supported marriage equality as much as he can. They argue that no president has done more for the homosexual community as President Obama. They argue that there is a legitimate danger of laws going too far and that imprisonment of homosexuals can happen as it was federally accepted in the past of different races such as the Native Americans and Japanese.", "Natural_Summary_Text_1": "S1 argues that main stream media is biased for Obama on the gay marriage issue. S2 states that every Republican presidential candidate is anti-gay marriage and pro-sodomy bans. According to S2, unlike the Republicans, Obama has refrained from attempting to make his personal opinion law. Further, he has done more for gay rights than any other president.S1 accuses S2 of fear mongering by misrepresenting the Republican stance on gay marriage. S2 accuses the Republican party of fascism and a zero-tolerance position regarding gay marriage. S1 accuses S2 of misrepresenting the nature of Republican opposition. S2 notes that the United States has a history of oppressing minorities, such as Native Americans and African Americans, which could be extended to include gay citizens. S1 notes that these are past not present US policies and unlikely to happen again. S2 is not so sure. S1 asks if S2's solution is to put a protection for gays in the US constitution. S2 proposes limiting religious influence upon society as a suitable means of providing protection for homosexuals in America."}, "Key": "1-10824_2_1__4_5_7_8_10_13_17_19_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 states that Republicans are focused on unimportant issues by appealing to people's prejudices instead of the important ones. S2 claims that the issues of Democrats are important issues, such as social security, global warming, poor schools and terrorism. S1 states that Republicans only care about tax cuts for the rich. S2 believes that the Democrats are manipulating the system unfairly. S2 claims that the Democrats are pushing an extremist agenda. S1 claims that Democrats were more fiscally responsible by balancing the budget. S2 claims it was a Republican house that balanced the budget but was hindered by Democrat created legacy costs. S2 claims that the left always claims Republicans want to starve the elderly and school children. S1 claims that the judges were doing there jobs and interpreting the constitution and claims that Republicans try to force religious rules on everyone. S2 wants marriage to not be messed with and states that its legal for different states to have different standards. S2 references driver licensing laws differing between states as evidence for his opinion.", "Natural_Summary_Text_4": "S1 claims that republicans focus on \"hot button\" issues to take attention away from the important issues. He claims that republicans have made issues out of gay rights and abortion by pushing legislation to ban them. He also suggests that democrats are more fiscally responsible than republicans whose only interest is to provide tax breaks for the wealthy. He claims that republicans are so concerned about certain minorities receiving their constitutional rights that they are willing to change the constitution to prevent it.   S2 claims that the republicans are focusing on important issues such as social security, taxes, and terrorism, and that it is democrats who are pushing unimportant issues like abortion, marriage equality, and global warming. He suggests that if democrats hadn't been pushing such a radical agenda, then the republicans wouldn't have had to come out against their position. He also rejects the idea that the democrats are the more fiscally responsible party, claiming that the social engineering policies put in place by the democrats will prevent the budget from ever being balanced.", "Natural_Summary_Text_3": "S1 is in favor of marriage between homosexual couples.  Within his debate he brings up the Republican use of \"hot-button\" issues, insinuating that gay marriage is an issue used to divide and distract from other \"bread and butter\" issues, mentioning tax breaks for the rich and global warming.  He disagrees with decisions being made that affect private affairs including gay marriage and also mentions abortion.  He also brings up the issue of morality being a part of the conversation when one's morality and beliefs is not everyone else's.  S2 believes that gay marriage is wrong because of the traditional role of marriage.  He claims that he does not care much about what people do in their own time but draws the line at allowing same sex marriage.  He accuses democrats and the left of pushing a radical agenda.  He specifically accuses the left of manipulating the system.  He ends with defending states' rights to not acknowledge gay marriage comparing it to the right of states to not acknowledge a driver's licence if not fitting into their requirements.", "Natural_Summary_Text_2": "S1 believes that Republicans are pushing issues by appealing to people's ignorance and prejudice in order to distract from more important issues. He or she believes that it is Republicans who are trying to make issues out of topics such as gay marriage, global warming and abortion. They do not view judges as being manipulated, as they are doing their job, which is to interpret the law. This person believes that conservatives are attempting to change the constitution so that they can impose their religious views and deny rights to others.  S2 argues that if the Democrats weren't pushing radical agendas, then Republicans wouldn't have to take action against them. He or she believes that homosexuals were attempting to manipulate judges by imposing the Full Faith and Credit clause on other states, which they argue does not apply to licenses, which would include marriage licenses. He or she argues that states are given the right to govern laws that aren't specifically covered in the constitution, and that marriage licenses fall into the category of states' governance.", "Natural_Summary_Text_1": "S1 states that the Republican Party is using \"hot button\" issues, such as gay marriage, to deflect attention from truly pressing and universal matters. S2 argues that it is in fact the Democratic Party that is emphasizing such issues while Republicans deal with these more central issues. S1 argues that in fact the Democrats have done better running the nation in trying times, while the Republican Party bases their opposition to gay marriage on cultivating fear and ignorance. S2 accuses S1 of revisionism by ignoring Republican contributions to balanced Federal budgets in spite of Democratic misinformation and manipulation of the legal system to promote gay marriage. S1 does not understand how the Democratic Party manipulated the judiciary in order to promote gay marriage. According to S1, if anyone is manipulating the system, it is the Republican Party who emphasize imposing morality at the expense of individual liberty. S2 argues that pro-gay marriage forces used a combination of Massachusetts marriages and the Fair Faith and Credit Clause to attempt to force universal acceptance of gay marriage."}, "Key": "1-2844_72_71__73_74_75_81_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 Accuses S2 of using straw-men in arguments. States courts have supported equal protection. Claims S2 doesn't understand definition of equality, and of being maliciously disingenuous. S2 Denies use of straw-men, asks for their use to be pointed out. Denies original intent apply to gay marriage under equal protection due to lack of documentation. Asks why S1 doesn't answer question. References other limitations to marriage that exist. S1 Sarcastically calls self stupid for believing constitutional mention of equal protection applied to gays. S2 Questions existence of documentation that links equal protection to gays but not other groups. S1 Accuses S2 of bigotry and links denial of gay marriage to being a denial of \"life, liberty and the pursuit of happiness\". S2 Accuses S1 of ignoring S2's points and instead insulting him. Accuses S1 of borderline breaking the rules of the forum. S1 States that the lack of equal protection is obvious to a blind-man, S2 is deliberately denying facts. S2 Questions why it is wrong to deny gay marriage but not to deny incestuous marriage.", "Natural_Summary_Text_4": "S1 cites court decisions upholding equal protections for people regardless of sexual orientation. He accuses S2 of claiming the courts are engaging in illegitimate judicial activism whenever they support equal rights for homosexuals. He argues that it is unconstitutional to prevent homosexuals from marrying because that would be restricting their pursuit of life, liberty, and happiness. He says that heterosexuals take the right to marry the person you love for granted and should extend the same right to people in homosexual relationships.   S2 reasserts his claim that it is illegitimate to misinterpret the original constitutional meaning of equal protection. He claims that true equality would require relaxing the marriage restrictions based on age and species, for example, which he suggests would be inappropriate. He claims that homosexuals are not being denied the right to marry because they are gay, but rather because the genders of the two people involved to not fit the criteria for marriage. He claims this demonstrates equality because two straight males or females would not be legally allowed to marry either.", "Natural_Summary_Text_3": "S1: The court upholds equal protections, but not for gays in federal and state laws. Equal protection under the law is for all. There is no evidence in the constitution that equal protection does not extend to homosexuals. For gays, not being able to marry is an obstacle to their pursuit of life, liberty and happiness. Gay partnerships are not protected in the same way that heterosexual marriages are. Denying gay marriage means denying an equal right.     S2: Marriage is restricted by age, sex, species, number, capacity etc. If equal protection for gay marriage is desired, than these restrictions would have to be removed. The constitution would have to be changed. Gay marriage is not a part of the term \"equal protection\" in the constitution. The original understanding of the 14th amendment does not apply to gays unless they are denied marriage (as it is defined today) for being gay.", "Natural_Summary_Text_2": "Two subjects are discussing the issue of gay marriage.  S1 is in favor of gay marriage while S2 is against it.  S2 feels if allowances are altered to allow gay marriage, then the other restrictions would need removed as well.  He also feels doing so would reduce moral judgment.  S1 disagrees advising the general consensus is that all people are entitled to equal rights except when they include gays.  S2 argues there is no document defining equal rights making S1's argument invalid.  S1 defends his original argument by saying the Constitution as it is defined right now prevents homosexuals from their rights to life, liberty, and the pursuit of happiness.  He also feels that supporting the rules remaining the same amounts to bigotry.  S2 argues this by stating his feelings that if laws were altered to allow gay marriage, they would also need to be altered to allow things such as incest marriages, challenging S1 to offer information to support why gay marriage laws should be passed; however, a ban remain on other such unions.", "Natural_Summary_Text_1": "S1 argues that state and federal laws on the issue of homosexual marriage are specifically directed against homosexuals. They believe that the courts are upholding equal protections and that those who oppose the rulings do so because of prejudice. They argue that equal protection under the law is a global blanket effect and cannot be argued to exclude certain groups. They argue that barring homosexuals from marrying each other serves as an obstacle in a homosexual's pursuit of life, liberty and happiness because they are forbidden to marry the person that they love.   S2 believes that it is illegitimate to argue that the constitution means one thing when it was never meant to in the first place. They believe that in order to get equal protection, that one would have to change the constitution to mean something completely different. They do not believe that homosexual marriage was in any part of the original meaning of equal protection. They argue that the 14th amendment wouldn't apply to homosexuals unless they were originally denied marriage as defined today."}, "Key": "1-7185_117_110__122_126_134_148_150_151_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 Compares heterosexual marriage Parthenon, asks why it should be torn down.  States heterosexual marriage is a universal institution. S2 States that marriage is a living institution and subject to change, that S1 is using circular logic. States it is a small change to law and gays want to strengthen their families. S1 Asserts gay marriage is a major change. Believes that gays want marriage to advance acceptability of gay life style or legal benefits. S2 Claims that acceptance has been ongoing and marriage is a small step, gays are as good as heterosexuals. References ongoing changes to gender roles. S1 Claims that gender, sexuality and family organization are fundamental aspects of society. Claims homosexuality is an eccentricity not equal to heterosexuality. S2 States that S1 thinks homosexuals are of lower value, that the existing definition was made by heterosexuals. S1 Denies homosexuals are of less value, objects to lifestyle not individuals. S2 Links individuals to the behavior. S1 States it is possible to make person/behavior distinction. S2 States that orientation leads to the behavior.", "Natural_Summary_Text_4": "S1 claims that traditional, heterosexual marriage is a universal human institution existing in almost every culture across the Earth and compares traditional marriage to the Parthenon as an example of an ancient structure that is damaged but deserves to be preserved. He claims that some homosexual unions would occur simply to demonstrate that homosexuality is equal to heterosexuality and that it is acceptable. He argues that it is not totally unacceptable to revise the definition of marriage, but that there would need to be a very good reason to do so, and that homosexuality is simply an eccentricity that is not equal in value to heterosexuality.     S2 argues that claiming that marriage has always been heterosexual is circular logic. He asserts that legalizing homosexual marriage wouldn't damage heterosexual marriages, but it would allow homosexual couples to receive the rights and protections currently afforded only to heterosexual couples.  He argues that just because something is traditional does not guarantee that it is right. He points out that S1 admitted to believing homosexuals were of lesser value.", "Natural_Summary_Text_3": "S1: Heterosexual marriage has existed in all cultures for a very long time. How can one justify revolutionizing an ancient institution? Some homosexuals want to marry for love or legal status, but many of them want to do it to prove that they are just as good as heterosexuals. Homosexuals want what heterosexuals have, and want to make the mainstream accept gay culture. Gay marriage is not a good enough justification for revolutionizing the institution of marriage. Homosexuality is an anomaly among man, is not equal with heterosexuality, and does not deserve marriage.     S2: Gays want to marry so that their families can have the strength and protection that the institution of marriage provides. They have no interest in harming the tradition of heterosexual marriage. Gays want to marry as badly as heterosexuals want not to be married. Living laws are meant to evolve with society. Homosexuals are just as good as heterosexuals. Other societies have legal gay marriage and no revolutions have occurred. Just because something is traditional does not make it just.", "Natural_Summary_Text_2": "S1 and S2 are discussing the topic of gay marriage rights.  S1 states he is not exactly opposed to gay marriage but would like someone to give valid reasoning behind restructuring the basis of marriage since it's been the same since the beginning of time, comparing it to the Parthenon.  S2 feels it is circular to classify marriage as simply heterosexual.  He believes no one is attempting to take away the idea of marriage, just asking for homosexual couples to be included in the fray.  S1 disagrees with S2's statements that at the root, most homosexuals fighting for marriage rights are doing so on a conservative note.  He feels instead that the reasons are a \"we are entitled to what you have\" mentality.  S2 disagrees stating that while many do want acceptance from society, most want marriage for the basic reasons of marriage.  He also feels S1's arguments support the notion that laws should stay absolute and cannot be changed or altered.  S1 disagrees with this statement advising he simply wants the reasons supported.", "Natural_Summary_Text_1": "S1 argues that heterosexual marriage is one of the most universal of all human institutions, found in almost all cultures that have ever existed. They believe that the true question is proposing a justification in revolutionizing that ancient institution. They believe that there are groups of homosexuals who want to change marriage for various reasons, whether it be for romance, economic and legal reasons but also to affirm that homosexuality and heterosexuality are just as good as each other. They warn that there is a risk of backlash with this way of thinking. They believe that homosexuality is an eccentricity and is not equal in value to heterosexuality.  S2 does not believe that homosexuals are attempting to destroy the idea of marriage but only wish to be included into it. They believe that homosexuals should be as accepted socially as heterosexuals and find it difficult to see a problem with homosexuals believing and acting as equals to heterosexuals. They believe that homosexuals want to have a positive influence on the institution of marriage, not destroy it."}, "Key": "1-1281_132_130_1_134_135_136_138_139_140_141_142_12"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 Denies bringing up religion, someone else did. States freedom of belief is law but rules govern actions. Also that changing something frequently weakens its integrity. S2 Denies validity of S1's earlier arguments, as referencing that were not between consensual adults. Questions if freedom of religion were allowed but expression limited. S1 States many religious practices such as polygamy are illegal and that many other consensual acts such as drug use as well. S2 States that other banned activities are linked to crime directly but homosexuality isn't. S1 States that if sodomy is illegal then homosexuality is a crime. States that the people are equal not the religions they follow. S2 Refutes S1, denies any link between homosexuality and crime. Cites difference between the letter and intent of the law.  S1 States that equality is treating everybody the same, not every behavior. The people determine what is in the public's interest. States differences between state laws with prostitution, age of consent and references physical effects reported by doctors of homosexuality also links to serial killers.", "Natural_Summary_Text_4": "S1 claims that laws are based on morals and because the United States is a predominantly Christian nation, the laws are going to be biased toward Christian beliefs. He asserts that homosexuality has negative consequences and harms the integrity of marriage. He argues that people have the right to believe freely, but that the government controls behavior, citing the freedom of religion until the practices do not conform to society's rules. He brings up the issue of equality, claiming that different religions are not actually equal even though the law says they should all be treated equally because although each of the religions has the same rights, they are still not all treated equally.  S2 rejects S1's differentiation between the right to believe and the right to behave and says it is inappropriate to compare homosexuality to non-consensual behaviors. He claims that behaviors like drug trafficking and gambling have links to crime and should therefore be regulated, but that there is no reason to believe that homosexuality is harmful so it should not be controlled.", "Natural_Summary_Text_3": "S1: All laws are based on morals - Christian morals, as the U.S. was founded as a Christian country. By changing family standards by allowing gay marriage, the integrity of heterosexual marriage and family structure is no longer stable.  Prostitution, polygamy, human trafficking, gambling and drug distribution are all \"consensual acts\" as gay relations claim to be; should these be legalized too? Homosexuality is linked to crime, and many consider homosexuality to be harmful. Equality means treating everyone the same, but not treating every behavior the same. The people will determine what is in the public's best interest to protect and ban.    S2: What if belief in God was legally allowed, but worshiping in churches or even praying in private was illegal? A parallel to gay marriage - gay relations between two consenting adults is fine, but gay marriage is not. Acts like prostitution and drug trafficking are not equal exchanges, and are linked to crime; homosexuality is not. Equality means worshiping whomever you want, not what the majority believes is correct.", "Natural_Summary_Text_2": "Two people are discussing the subject of gay marriage rights.  S1 is against gay marriage but adamantly states his objection is not based on religion but because there are laws prohibiting the practice.  S2 is in support of gay marriage and argues laws could also be passed to ban things such as worshiping God and begs the question of whether or not S1 would so adamantly support the laws he cites if that were the case.  S1 advises he would still support the law as there are already laws banning certain religious practices such as polygamy.  He advises that even though such a thing would most likely not happen, he would still support it because it would be fair and equal toward all.  S1 contends that if this were the case, crime rate would increase due to the banning of religious freedom, in a sense.  S1 believes homosexuality should be considered a crime because sodomy is a crime.  S2 feels S1 is distorting the law to justify homosexuals being discriminated against.  S1 denies this accusation.", "Natural_Summary_Text_1": "S1 believes that all laws are based on morals and that because the country of the United States is predominantly Christian, their laws will reflect those beliefs. They believe that by changing standards there is a harm to integrity. This person believes that everyone has equal rights in terms of religious beliefs, however behavior is regulated by government and as such society can only do anything in the name of religion until it violates behavior that is accepted by society. They argue that it is the people who determine what is in the public's best interest to protect and ban.  S2 argues that if the government allowed for people to believe in God, but made it illegal to put their beliefs into practice, such as going to church or private prayer at home, that it would be similar to the situation with homosexuals being unable to marry, and thus inequality. This person argues that this would not be equality and that S1 is using the letter of the law to twist the purpose of the law."}, "Key": "1-1281_206_203__227_238_259_278_467_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 and S2 are discussing the political processes that may lead to gay marriage.  S2 is of the opinion that society and government failure to recognize gay marriage and provide it equal protection is a civil rights violation being carried out against a minority group, implicitly suggesting that it should be protected under the Constitution by the Courts.  S1 on the other hand believes the issue is one that needs to spend time in the public awareness and consideration and be realized over time in the results of various political processes such as election results, initiatives in State legislatures and ballot initiatives.  S2 complains that this is obfuscation and an attempt by S1 to avoid the rights violation issue.  S2 disagrees and notes that just calling something a violation or stupid or wrong doesn't advance the process, and defies S1 to draw appropriate lines on where to draw the line, such as with regard to protection of other less acceptable group intimate relationships.  S2 asserts that the government has protected minorities against bigotry in the past.", "Natural_Summary_Text_4": "S1 believes that protesting made a difference, but not until enough people had grouped together to voice their opinion. They point out that despite protesting, change would not be brought about unless the will of the people was not desiring that change. They believe this is how the system works, and any legislation is a matter of voters and the will of elected officials to reflect what the voters desire. They believe that the true reason behind the ballot initiatives is to determine whether or not it is a civil right in the first place to give legal marriage to whatever group arrangement is in question.  S2 believes that there is a difference between voters voting on laws and legislators voting on laws. They do not believe that it is a good thing to allow the majority vote on civil rights issues because if a minority needs protecting, it will need protection most from the majority that is trying their best to keep them down. They do not believe society should be allowed to be bigoted.", "Natural_Summary_Text_3": "S1 claims that any legislative movement requires the support of the people to be successful. He suggests that the legal decisions about important issues involve not just the legislature, but national debates and protests. He argues that this same process is now occurring over gay rights and that people voting on laws is how the legal system works in order to allow society to determine its own standards. He claims that there is no problem with marriage being redefined to include same-sex couples, but that this change of definition must occur through the official process.   S2 accuses S1 of shifting off topic to the voting process and how the legislature works, claiming that the legal intricacies are irrelevant. He claims that allowing the general public to determine civil rights is wrong and that if a group needs protecting it is the government's job to do so, citing instances in the past where the government has taken a stand against bigotry. He argues that just because something is currently legal doesn't mean that it isn't wrong.", "Natural_Summary_Text_2": "S1 feels that issues involving legislative movements are decided by society. Though the legislature votes on national issues, the power of the citizens is what grants or denies civil rights legislation. He feels the hot issue right now involves gay marriage, and the outcome of that issue will be a voting matter. According to him, society determines its own standards and it is not possible to make gay marriage civil rights matter. Legal marriage cannot just be handed out to any group that calls for it; society determines the facts and acts reasonably and accordingly to the facts given about the issue.    S2 feels that civil rights issues should not be left up to society, especially if that society is the main deterrent in approving a group's rights.  He states that the government should be the force behind protecting citizens' rights against the hatred and bigotry of the masses. The government has involved itself in civil rights issues in the past, and should step up to defend gay rights when it comes to legal marriage.", "Natural_Summary_Text_1": "S1 replies to Matthew (who had asked about voting on his civil rights), that there are legal and legislative processes that need to take place to determine civil rights, that legislators, elected officials, and the people of our country all are required to vote for change to take place. He notes that this process has happened before and that protesting had made a difference, but not until enough people had gotten on board with the issue. He feels that this process has to be there in some form to determine the status of civil rights and how those rights are expressed.     S2 feels that by explaining how legislation works in this country S1 has moved the topic away from the question Matthew had asked. He does not feel that the people voting on laws, legislators voting on laws, or the people electing politicians, are the same thing. He takes issue with S1 derailing the topic away from the question. He takes further issue with the idea that the masses should be allowed to vote on civil rights issues, calling this stupid and wrong. He feels that if a group's civil rights need protecting, then they need protecting from the group doing the voting. He believes that if the power of the government can be used to fight evil and prejudice than it should be."}, "Key": "1-6646_6_5__7_10_11_12_17_20_3"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes in a conservative silent majority that negates liberal or left polling and votes in a politically correct and like minded conservative fashion in order to defeat liberal agendas such as gay marriage.  S2 doesn't think the conservatives are silent and they both cite various election results from the past to debate the premise that there is a silent conservative majority.  S2 doesn't believe there is a silent conservative majority and offers statistics to suggest that President Clinton was better supported by the electorate than President George W. Bush.  S1 is clearly a republican and repeatedly refers to President Clinton as \"Slick Willie\", whereas S2 is somewhat more guarded about his party affiliation in an apparent attempt to argue the matter from a point of neutrality, both asserting Clinton's superior level of support over Bush, and simultaneously implying that he, S2, is not a Clinton supporter.  S1 argues that Kerry expected to win Ohio and that the silent majority surprised him.  S2 replies that Kerry wasn't so sure he was going to win Ohio.", "Natural_Summary_Text_4": "S1 believes that since Ohio passed a Gay Marriage amendment, it was the silent majority speaking the same as when President Bush was re-elected by a large margin. This person believes that morals and homosexual marriage had a large bearing on the election's eventual outcome. S1 believes that because of the silent majority, Kerry was confident in his victory in the polls in Ohio, when in fact he did not win in that state.  S2 does not believe that the voters of Ohio were silent in any manner regarding the issue of homosexual marriage or their choice for president. S2 believes that even though Bush won by a larger margin than Bill Clinton, it doesn't mean that Clinton did not win by a larger percentage. This person believes that population increases and higher voter turnout is what won President Bush the election. They explain that despite percentages being relatively low for the two primary candidates during President Clinton's election periods, the difference in the elections was that there was a competent third party running in both.", "Natural_Summary_Text_3": "S1 notes that although John Kerry was expected to win the election in Ohio, he lost. He attributes this loss to the disapproval of homosexuality by Ohioans, as indicated by the passing of a gay marriage amendment and their support for President Bush who he claims won by a larger margin than President Clinton. S2 rejects the claim that the people of Ohio were silent about their views of same-sex marriage and claims that although President Bush won with a larger margin, President Clinton still won by a larger percentage, due to the increased population and larger voter turnout in President Bush's election. S1 claims that population is irrelevant, citing several statistics showing a low level of support for President Clinton, and also claims that the same-sex marriage issue definitely had an effect on the outcome of the Ohio election. S2 again responds with statistics showing that President Clinton won by larger percentages than President Bush. He does not deny that the same-sex marriage issue was relevant, but denies that there was a silent majority.", "Natural_Summary_Text_2": "S1 feels that the silent majority in Ohio spoke out about the issue of the state's passing of a gay rights amendment, and compares it to the large percentage of voters in past presidential elections. He believes that the morals and beliefs in the state were the reasons for the Republican presidential candidate, George Bush, winning by a larger percentage than either democratic candidate, John Kerry and Bill Clinton, in the past elections.     S2 rebuts that the majority of people in Ohio were not silent about their views on gay marriage or on their choice for president; the people in that state were very vocal about their views. He states that Bush did win by a larger percentage than Clinton, the increase in population was the determining factor for those numbers. He feels that majority's desire to oppress the minority, in Ohio, did play some factor in Bush's win. He uses percentages from various candidates, likeClinton, Bush, Dole, Kerry and Gore to back up his argument. He disagrees that Bush was more supported than Clinton.", "Natural_Summary_Text_1": "S1 feels that there is a silent majority of people who appose gay marriage, and that they have spoken in the polls by electing Bush and not Kerry for president. He uses the argument that Bush had a wider margin of victory over Kerry than Clinton had in either of his elections. He notes that Ohio passed a Gay Marriage amendment and then elected Kerry was smashed in the Ohio presidential election, and credits this to the silent majority. He states that It is the silent majority that make the polls used by the left wing media indicating that the presidents approval rating is down, the economy is bad, the war in Iraq is going badly. He feels that morals and the gay marriage issue played a large role in the presidents victory.     S2 states that the people of Ohio were equally as vocal about their views on gay marriage and their choice for president as any one else, and are therefore not a silent majority. He notes that while Clinton won by fewer total votes, he carried a larger percentage of votes, and therefore had a greater amount of support than Bush. He feels that due to the polls being accurate going into the election the term silent majority does not apply. While he notes that the majority's desire to suppress the minority likely played a  role in Bush's victory, polls suggest that in was a very small role."}, "Key": "1-3089_96_94__97_99_103_105_108_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 argues that allowing gay marriage would set a precedent that would be used to allow marriage for other forms of traditionally socially unacceptable intimate or sexual relationships, such as incest between half brothers or a mother and son, and/or polygamy.  S2 is in a 15 year male homosexual relationship and is anticipating twin children that are biologically related to him.  He challenges S1 to explain why he and his family should not be entitled to the many benefits associated with marriage, such as social security surviver status.  S1 provides a putative explanation by noting that his children are outsourced, meaning that one of the parents of the children is not part of the family intended to receive the benefits of marriage.  S1 also notes that others do not qualify, and likens S2 to a single mother who has many children and then complains about not enough help from the government.  S1 repeatedly compares gay relationships to other types of relationships which he considers to be devious in order to justify excluding gays from marriage rights.", "Natural_Summary_Text_4": "S1 believes that homosexual marriages should not be prohibited, but also believes that heterosexual marriages and homosexual marriages are not the same. They believe that if homosexuals are allowed to marry, than any kind of marriage between consenting adults should be allowed, otherwise you are discriminating against the person wanting to enter into the marriage. They believe that S2 deserves as much protection as an incestuous or polygamous relationship that has children. Overall, they believe that if homosexual marriages are allowed then it should branch out to other types of potential marriages.  S2 points out that with full civil marriage equality, benefits otherwise not available to homosexual couples are now options such as survivor's benefits of social security or retained guardianship of their children. They don't see a reason for homosexual couples to have to go through a different process than heterosexuals in order to gain the same benefits of heterosexual marriage. Since S2 has children, they do not believe that they are any less deserving of government benefits of marriage than heterosexual couples with children.", "Natural_Summary_Text_3": "S1 states that same-sex marriage should not be prohibited, but believes that a homosexual marriage is different than a heterosexual marriage. He argues that recognizing this difference is not discrimination. He claims that children of same-sex couples or comparable to children from incestuous, polygamous, or other sexual deviant relationships. He makes the argument that if same-sex marriages are legalized, then all types of marriages between consenting adults should be legalized. He claims that the arguments in favor of same-sex marriage would work equally well for incestuous or polygamous relationships.  S2 identifies himself as a homosexual and argues that same-sex families deserve the same benefits as heterosexual families. He questions what difference exists that distinguishes his relationship from that of a heterosexual couple other than the genitals involved. He identifies a variety of benefits received only through marriage, such as social security and guardianship among others. He takes offense at S1's comment that his children are \"outsourced\" and rejects the idea that homosexuals are fighting for marriage equality simply because they free handouts from the government.", "Natural_Summary_Text_2": "S1 believes that gay marriages should not be viewed the same way as heterosexual marriages; the speaker does state that he does not disagree with the idea of gay marriage. He says that gay marriage is a deviation from the traditional union between a man and woman. Any sexual relationship that is a deviation from the \"norm,\" like polygamist and incestuous relationships, should also be granted the same rights. The speaker feels that these relationships are all on the same levels, and one should not be afforded rights that the others are not.    S2 identifies as a gay male, who has been in a 15-year-long homosexual relationship, and has a set of twins due soon; he feels his family should be granted the same rights as a heterosexual, married couple. He states that legalizing gay marriage allows for automatic guardianship of children if something happens to the biological parent, and also awards survivors benefits from social security. He believes that other types of marriage should be looked at based on its own situations and conditions.", "Natural_Summary_Text_1": "S1 believes that gay couples, and their rights in regard to marriage, are no different than other deviant relationships, such as incestuous and polygamous relationships. He does not feel that gay marriage should be prohibited, rather that it is simply different than a normal heterosexual marriage, and to recognize this difference is not discrimination. He feels that if gay relationships were to be allowed then not extending the same benefits to all forms of relationships between consenting adults would then be discriminatory. He feels that gay couples who have children through surrogates have outsourced their children, and he should therefore not be responsible for them.     S2 makes the case that he has been with his partner for 15 years, and will be having his own biological children soon. He feels that his family should be afforded the same rights as a heterosexual couple, that his husband should gain automatic custody if he dies, survivor benefits from social security, and others. He does not see his relationship with his husband as being the same as other forms of non-sanctioned relationships, and that each new form of marriage arrangements would need to be argued on their own merits individually."}, "Key": "1-10073_119_44__120_124_127_129_130_131_132_133_134_6"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 believes that marriage, in it's conception, was made for biological reasons, that marriage exists to allow children to be born more easily. Although this should, in no way force people to have children, or their being capable of having children in the first place make a difference. S1 says that heterosexuals and homosexualsare fundamentally different, and that that difference is why they are treated differently. S1 compares the institution of marriage to the world being built to accommodate right handed people, and is insulted that the world should be forced to be changed for lefties, not believing they have that right.       S2 feels that, the federal government and other states, not recognizing his marriage license, is unconstitutional, as Iowa issues the same license for both hetero- and homosexual couples. He feels that there is no difference between a gay couple getting married, and a 70 year old straight couple getting married. He wants equal right to get married, and have that marriage recognized, as couples who either can't have children or choose not to.", "Natural_Summary_Text_4": "S1 argues that is important that a society lives by its laws. They argue that a heterosexual marriage is a formalization of the need to reproduce. They do not believe that the Constitution requires a state to recognize another state's laws because it is up to the states what is recognized and what is not. They argue that heterosexuals and homosexuals are biologically different and that some people just have to deal with the ramifications of being biologically different.   S2 argues against the idea of marriage being solely for reproduction by bringing up the fact that heterosexuals who are well past birthing age can legally get married without any consequence. They argue that it is unfair that even though they may have a legal grounds and license to prove that they are married in one state, if they go to another state that does not recognize that license then that marriage is not accepted. This person believes that it should be up to the federal government and not the state government to recognize a marriage license.", "Natural_Summary_Text_3": "S1 sees marriage as it is today as part of a social contract that is based upon biology and reproduction.  The drive to reproduce is part of the heterosexual bond and marriage is its formalization.  S1 is annoyed with S2 demanding that because his marriage is not universally recognized that there is something unconstitutional in place.  He explains that marriage is left to the States to determine what is legal and that the Federal government, according to the Constitution, has no place to change that.  S2 would like to see a change in the definition of marriage.  He holds a marriage licence but it is not universally recognized. He argues that biology and reproduction do not apply when people past the age where childbearing is possible can marry.  He challenges S1 that if marriage truly is about reproduction and family that a married couple must prove that this is a part of their relationship or their marriage would be terminated.  He is offended that others' beliefs can play a role in his life.", "Natural_Summary_Text_2": "S1 believes that everyone should live within the bounds of the laws of society. They are free to be changed but not broken. Society's definition of marriage is not based merely on religion, but on biology. S2 argues that people who are not able to reproduce but can marry invalidates S1's argument. S1 reiterates that the ultimate intended goal of marriage is to make reproduction easier. Bringing up exceptions to does not change anything. S1 argues that S2's opposition to gay marriage bans stems from not receiving benefits that a married couple does. S2 argues that gay marriage bans are unequal and unjust. S2 emphasizes universal equality and desires to be treated just as heterosexual people who do not reproduce are in terms of the ability to marry.  S1 argues that by placing marriage law in the realm of the states, then the states can determine which type of marriage to recognize. S2 argues that even if this were the case, it would still be unjust. S1 argues that S2 ignores the biological differences involved.", "Natural_Summary_Text_1": "S1 Claims never argued stance based upon religion, that would be arbitrary. Claims argument is based upon biology. S2 Claims argument on biology void, references age difference. S1 Claims debate is really about benefits not marriage itself. Claims heterosexual marriage is based on biology even if reproduction is impossible. S2 Wants equality, claims constitutionality. S1 Refers to S2s arguments about benefits. S2 Claims to have been commenting for years. S1 Doesn't care, accuses S2 of hypocrisy. S2 Refers to heterosexuals that can't breed, or won't, can still get married. S1 Refers to S2 having legal marriage in one state and not others as will of the people. Again refers to the demand being about benefits. S2 Asks why gays should be different. S1 Says that the idea of homosexuals and heterosexuals are the same is political fiction. Claims that being gay is like being left-handed, it's too bad that the world is made for right handed heterosexuals. Because you want something doesn't mean it's your right. Claims it's ignorant, insulting & arrogant to believe that."}, "Key": "1-10349_72_70__75_82_83_84_85_86_87_88_89_90_94_95_99_4"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 states that the legal definition of marriage is a contract between a man and a woman, who are not related, with no regard to love, or the intention of reproduction. S1 maintains, from the basis of observation, that the cultural definition of marriage is a formalization of a mating pair, love and the intension to reproduce being implied. Saying that homosexual couples are not a part of either definition, and that being included in the current definition is a catch-22, as homosexuality is not in sync with evolution. S1 further states that the only connection between, mating couples and marriage, are cultural.      S2 defines marriage as a commitment between two people who love one another. Using a hypothetical marriage between a 65 year old woman and a 68 year old man as an example, argues that reproduction has no bearing on the definition of marriage, and that without a harm involved, equality of rights is what is important. S2 believes that personal opinions are subjective and should not be used as the basis to limit the rights of the minority.", "Natural_Summary_Text_4": "S1 argues that the cultural meaning of marriage is a formalization of a mating pair, who create and support a family unit. They believe that in order for homosexuals to be included, the definition and cultural meaning of marriage would have to change to accommodate it. They argue that the most dominant cultural view on marriage is based upon evolutionary sound logic, that a monogamous pair of individuals will reproduce. This person does not believe that the argument stands on equality because they do not believe that equality factors into the evolutionary view of marriage.  S2 argues against the idea that there is a set, evolutionary definition of marriage and uses the example that people well over the age of reproduction are not only legally capable of getting married, but also suffer no special stigma for doing so. They believe what defines marriage is love between two people who desire a commitment between themselves. They argue that many do not share S1's definition of marriage and that it's an issue of personal belief rather than culture.", "Natural_Summary_Text_3": "S1 is focused on the definition of marriage and the cultural definition, both limiting marriage to heterosexual couples.  The cultural definition includes reproduction, he uses the term mating mating pairs.  He argues that this definition automatically excludes homosexuals because they cannot, without outside help, create a family.  He discusses other marriage outside of the norm-a young woman and older man- as being less meaningful than those that fulfill the cultural definition.  He sees it as the job of elected officials and the citizens to change the legal definition of marriage if that is what the majority want.  S2 disagrees with and questions the cultural definition given by S1.  He feels that the main factor in marriage is not reproduction but love and commitment between two individuals.  He challenges the cultural definition with the example of a 65 and 68 year old getting married.  He finds it unfair that a group of people are being excluded from an institution on which they pose no threat to those who are enjoying the status quo.", "Natural_Summary_Text_2": "S1 argues that marriage has a specific and deeply embedded definition within culture. Marriage is a formalized mating pair. Marriage's legal definition closely mirrors that definition. Homosexual marriage has never been an explicit or implicit part of those definitions. Including it would make the definition of marriage inherently self-contradictory. S2 argues that S1 is exercising a subjective definition. S2 notes that different members of society have different definitions of marriage. Further, there are instances of accepted marriage which violate S1's provided definitions. Instead, love, the emotional connection is what is most important.  S1 argues that legal and cultural definitions are not the same. The cultural definition is what is important. Most associate marriage with producing offspring, hence it is deemed important in the cultural definition. S2 questions S1's authority to determine what is culturally important and whether his cultural definition is appropriate for a legal definition. S1 says appropriateness is irrelevant. Cultural definitions have formed the root of all other definitions. The cultural definition of marriage has always been one male and female in monogamy.", "Natural_Summary_Text_1": "S1 States that the current definition of marriage specifically excludes homosexuals because the current definition is \"two people that are not underage, or opposite genders, same species, not closely related and not already married\" and that gays want to be married under current definition. Believes that ability to reproduce is implied in definition. S2 Claims S1's definition isn't only possible, refers to lack of reproductive abilities of an elderly person and a younger person marrying. S1 Refers to differences between cultural definitions of marriage and mating pairs or legal definitions of marriage. S2 Ask who agve S1 right to define cultural meanings. S1 Claims that cultural meaning comes from observation and that legal definition can be decided any way. S2 Asks who gets to make that legal definition. Claims that those that oppose gay marriage are opposing something that harms no one and are trying to limit other's actions. S1 States that in America people vote on laws or those that make them and that is who gets to determine legality of different marriage concepts."}, "Key": "1-10349_9_5__17_40_43_50_52_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 maintains that the current definition of marriage, being a public institution that has remained unchanged since cave man days, is neither cruel, nor unjust. S1 says that if the gay marriage laws of society are not to your liking than you should lobby for change, put the decision to a vote, and abide by the decision. S1 states that cruelty and injustice occur when you are stopped from doing something that you are not allowed to do, and further denies that the alleged suffering of gays is comparable to that of the slaves.       S2 believes that the ban on gay marriage is cruel and unjust, he likens the injustice of gay marriage to that of the slave trade. S2 believes that suffering and injustice should not be allowed, even if the institution that allows it has always been the law of the land. S2 states that it is not the suffering of one group to that of the other that was compared, but that S1's beliefs were being applied to the slave trade, particularly that it was the law at the time, where today it is illegal.", "Natural_Summary_Text_4": "S1 believes that marriage is a public institution that has its rules and requirements. They believe that it is in someone's rights to lobby to change those rules and requirements if they desire. However, they also believe that it is equally within someone's rights to lobby to keep the status quo on rules and requirements. They do not believe that it is cruel to decide that someone else should not have what another enjoys based on the idea that it is within one's rights to decide such things. This person argues that since marriage is seen as a public institution, society has the ultimate say in how it is treated.   S2 believes that it is cruel for the voice of the majority to continually lobby out the minority. This person does not believe that they have the right to tell people who they can and cannot marry. This person argues that just because something is the law does not make it any less cruel, and counters S1's arguments by comparing their views to that of slavery.", "Natural_Summary_Text_3": "S1 believes that the best way to legalize same sex marriage is through lobbying.  He thinks that in any discrepancy both sides should lobby and the one who has the majority support should win. Society is run by the majority opinion and he agrees that this is how it should be.  He agrees that same sex marriage should be legal but that the only way it can and should happen is when the majority believes it, even if roles were reversed and his relationship was not able to be acknowledged as a marriage.  When S2 compares marriage inequality to slavery he disagree that the comparison is valid but continues his argument for lobbying citing Wilberforce in his fight to abolish slavery.  S2 attempts to appeal to S1's emotions by repeatedly asking that he put himself in the shoes of those who are being denied the right to marriage.  He questions S1's ability to feel empathy and compares the issue of marriage equality to slavery in regards to the majority allowing it to exist.", "Natural_Summary_Text_2": "S1 and S2 are debating gay marriage. S1 argues that gay marriage should be decided by a public vote. S2 argues that it's cruel to limit someone else from enjoying rights you can currently enjoy. Opponents of gay marriage should try to have more empathy for gay people who wish to marry. S1 retorts that it is not cruel for society to bar someone from enjoying a particular right. Society can and does decide what it deems to be socially acceptable through consensus.  S2 states that tradition or being mundane does not make something any more wrong or right.  S2 compares S1's argument to a justification for slavery.  The majority once held slavery to be correct, hence it was morally and socially acceptable according to S1's logic. S1 says that he is not arguing for something being correct because it's traditional, only that it can be changed through convincing society to change.  It is up to society to determine what is permissible through a dialog between the proponents of gay marriage and society.", "Natural_Summary_Text_1": "S1 References S2 that marriage is a public institution limited by law. This is subject to the will of the people expressed in a vote. It's ok to lobby on either side. S2 Calls for empathy and that people are denying gays what everyone else has. S1 Claims it is ok for people to believe as they wish on the issue and can lobby on it, but not to belittle those who oppose it due any reason. S2 Refers back to the empathy question and wishes S1 to imagine a reversed world where being heterosexual denied you marriage rights. S1 Claims it's not injustice because it's not denying something that you're allowed to do and refers to society's right to determine its own rules. S2 Refers to similarity between gay marriage and slavery, refers to empathy and claims cruelty to deny gay marriage. S1 Denies similarity and degree between gay marriage and slavery, Again refers to society determining own rules. S2 States not comparing the two issues just applying S1's beliefs and standards to slavery."}, "Key": "1-6646_209_208__210_211_212_214_215_239_7"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 finds the argument that Bert and Ernie could be homosexuals extremely offensive arguing that characters created for children's programs should not be sexualized at all. This leads into the topic of gay marriage and gay sex which he labels as deviant.  He questions whether two straight men would marry simply for the benefits of marriage if same sex marriage was legalized.  He accuses S2 and other homosexuals of wanting Bert and Ernie to have a same sex marriage, which would include \"playing with their genitals\".  S2 never comes out and says he believes Bert and Ernie are gay but argues for them to be allowed to be in a same sex relationship.  Throughout his arguments he differentiates between the relationship and sexual behaviors.  He mentions other relationships in children's programs like Kermit and Miss Piggy and the lack of sexualization when dealing with couples of the opposite sex.  He refutes S1's claims that men will marry with the idea that they already can marry women and would not have to get into a same sex relationship to get the benefits of marriage.", "Natural_Summary_Text_4": "S1 believes that S2 wants Bert and Ernie to be gay and that this will sexualize them to children because gay men engage in \"deviant\" sexual behavior. S1 argues that you could have Bert and  Ernie be straight and get married and this will not sexualize them. S1 states that S2 wants Bert and Ernie to be described to children as engaging in deviant sexual behavior but under the guise of \"married\".  S2 points out that the show is a work of fiction and that he merely said marriage and that S1 is who brought sex acts into the equation. He states that straight people are portrayed to children and it has nothing to do with their sex life. He merely thinks that having two male characters who are married will help support gay inclusion.", "Natural_Summary_Text_3": "S1 doesn't believe that Bert and Ernie are homosexual, and that homosexuals cannot understand that two men can be close friends without desiring sex with each other. This person believes that it wasn't the creators' intentions for it to be taken that way. They believe homosexuals want to interject what they believe to be deviant sexual practices into children's programming. They believe there is no distinction between homosexuality and sexual relations, and that one cannot be homosexual without practicing intercourse with one's own gender. They believe that when people discuss homosexual marriage that they are trying to disguise what they believe to be deviant sexual activity by using the word marriage.  S2 argues against S1 by stating that heterosexual marriages can be portrayed without sexual relations being alluded to or mentioned. They believe that heterosexuals and homosexuals can discuss marriage without ever needing to get into the details of sexual activity or even touching the topic of sexual activity. They don't agree that when one discusses marriage that they are also trying to discuss sexual activity.", "Natural_Summary_Text_2": "S1 believes that Bert and Ernie are just two men who are really good friends and happen to live together. He feels that the homosexual deviants want to see Bert and Ernie as gay and is sickened by the hypocrisy of them saying that they don't feel that way. He feels that Kermit and Miss Piggy are not portrayed as being sexually active but that calling Bert and Ernie gay would automatically mean that they were. He also feels that if gay marriage were to be legalized then there would be some straight men who would find it to their advantage to get married to other men for the benefits.     S2 refutes that he wants Bert and Ernie to be gay, and that he had never said anything like that, and that S1 should look at the false fallacy paradox that was mentioned earlier. He feels that S1 has a dirty mind for saying that that was what he had thought, pointing that it was S1 who brought up sexual topics in the first place. He refutes that he wanted anything to do with a sexual relationship on a kids program, just that there could be married couples on Sesame Street, straight or gay there wouldn't have to be any mention of sexual situations.", "Natural_Summary_Text_1": "S1 asserts that the characters Bert and Ernie from Sesame Street at not homosexual partners. He suggests that homosexuals cannot understand how two men can be close without engaging in homosexual acts. He compares using Bert and Ernie as homosexual icons to using Kermit and Miss Piggy as a symbol for interspecies relationships. He argues that it is unfair for homosexuals to claim that they aren't sexual deviants when they are projecting deviant sex onto children's programs. He claims that homosexuals engage in deviant sexual practices and that they are attempting to project these behaviors onto Bert and Ernie under the pretense of them being married. He also claims that once same-sex marriage is legalized, it is possible that straight men will marry each other in order to gain some unspecified advantages.  S2 asserts that the argument currently being discussed is regarding marriage, not sexual behaviors of married couples. He claims that it is possible to represent two characters as homosexual without invoking sexual behaviors, comparing this to portraying heterosexual characters without being sexually explicit."}, "Key": "1-10585_36_34__39_52_54_64_65_1"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 considers Colson's article on gay marriage to be compelling.  He reads it as a comment on society generally, defends the author's views on traditional families and does not see it as a direct attack on same sex marriage. He refers to the statistics on children of traditional families being at a lower risk of ending up in prison.  He later mentions that he does not necessarily agree with this conclusion that was drawn by Colson.  S2 argues against any protection of the traditional family pointing out that it has been having its own issues.  He sees Colson's article as a direct attack on any family other than what has been labeled traditional- two heterosexual parents raising children.  He believes that the article is inferring that homosexual parents would end up raising children who commit crimes.  He also argues with the concept that homosexual marriages will have a direct negative impact on heterosexual marriages mentioning that any claims need to be backed up to be reliable that there is nothing to back up any claims on this issue.", "Natural_Summary_Text_4": "S1 states that the author is not drawing a link between gay marriage and crime but to the overall effect on family and community. S1 is against the proposed amendment and does not believe that the constitution should be changed for this but feels the author has a compelling argument.That Colson is not saying gay marriage is responsible for increased crime.   S1 is saying that Colson is right when he says that broadening the defintion of marriage will impact \"traditonal\" marriage.    S2 feels this argument has no merit. That traditional marriage is not effected just because gay marriage is legal. One has no impact on the other. Straight marriage has been in decline for years long before gay marriage was legalized.  For Colson to state that traditional marriage will deteriorate is preposterous. S2 states that a household with two parents will obviously do better in raising their children because there is twice the capability to care for the child, but the sex of those two parents is irrelevant. S2 also states that Colson is saying that gay marriage yields more criminals because Colson links gay marriage to a decrease in traditional families, and decreases in traditional marriages result in more criminals.", "Natural_Summary_Text_3": "S1 doesn't agree that amending the Constitution is the right things to do, though they find the argument connecting society and traditional family compelling regardless. They believe that the definition of the words family and marriage are being broadened and redefined. They argue that those who oppose this change believe that marriage and family fit a certain criteria to truly be a marriage, and that criteria is traditional marriage. They agree on some points with these people, and believe that adopting homosexual marriage will have an effect on that definition, but they don't on others.  S2 doesn't believe that there will be an effect on traditional marriage because of the adoption of homosexual marriages. They believe that the traditional family has its own problems and has been in decline long before the issue was brought up. They don't agree that connecting society and traditional family to homosexual marriage is logical or compelling and that there is reasonable evidence for the contrary. They don't believe there is substantial proof to argue that homosexual marriage will affect society.", "Natural_Summary_Text_2": "S1 feels that Colson's is the most compelling argument for the Marriage Protection Amendment yet, but that he still does not support it personally, as the changing the constitution of it isn't right. He feels that the legalization of gay marriage would redefine what family is in a negative manner. He feels that the broadening of what constitutes the definition of marriage would somehow weaken traditional marriage. This, he says, would lead to more crime.    S2 feels that the problems with traditional marriage in this country began long before gay marriage began to be legalized. He makes an analogy of a man jumping out of a plane before gay marriage, and gay marriage being blamed. He does not feel that gay marriage has any effect on traditional marriage at all, and that society is not harmed by the inclusion of gay marriage. He believes that any statement that says that gay marriage harms society should be proven before being widely talked about. He feels that S1 is misrepresenting himself and twisting his argument to make statements that are different from what Colson had written.", "Natural_Summary_Text_1": "S1 claims that despite arguments linking same-sex marriage to negative effects on society and traditional families, he is against the constitutional amendment to ban same-sex marriages on the grounds that it is an inappropriate topic for a constitutional amendment. He references a person named Colson who believes that the terms \"marriage\" and \"family\" need to meet specific criteria, and that legalizing same-sex marriage would change those criteria, leading to changes in the meaning of traditional marriage. He also claims that Colson believes that traditional families have the best outcomes in regards to criminal behavior of offspring.     S2 rejects the claim that same-sex marriage has a negative effect on society, suggesting that traditional marriage was on the decline long before same-sex marriage was ever legalized. He also questions what negative effect same-sex marriage could have on society, claiming that there are no studies suggesting that two heterosexual parents fare any better than two homosexual parents because there is no difference in reality, and that there is no reason to predict that same-sex marriages would affect crime."}, "Key": "1-5672_6_5__7_13_15_16_17_20_2"}, {"Natural_Summary_Text": {"Natural_Summary_Text_5": "S1 begins by defending Colson, who does not appear directly in the conversation but primarily deals with issues of single parenthood in favor of traditional families.  This then carries into the debate on same sex marriage arguing the family structure is not as secure, even looking at whether or not children of non traditional families end up in prison at higher rates.  S1's argument gets confused when he later states that he is in favor of sex sex adoption, quite contrary to the beliefs of Colson whom he was initially defending.  He also speaks in favor of protects for homosexual relationships and individuals and against the amendment that would prevent gay marriage.  S2 takes issue with what Colson argues pointing out that single parenthood has not been attacked politically through attempts at amendments.   He mostly questions S1's validity, accusing him of being paid to post.  There is not much opinion being given from S2 but rather objections to much of what S1 has said both in the current text as well as mentions of previous debates.", "Natural_Summary_Text_4": "S1 is pointing out that by changing the definition of marriage in a proposed amendment it will affect traditional marriages. S1 quotes Colson and is attempting to make sure that Colson is not misrepresented. That Colson's belief is that the \"traditional\" household is the best scenario and does the best job in regards to keeping their children out of prison. He asserts that Colson feels the same regarding single parent households as well. That they are not \"bad\" but traditional households have the most success. S1 agrees with some of Colson's points but also agrees with many gay rights issues regarding discrimination, harassment, and adoption. S1 also points out that S2 seems to attack posters personally rather than the topics at hand.   S2 feels that S1 continually draws conclusions about gay marriage from single parent household statistics. S2 also feels that S1 may be compensated financially for participation in the forum due to the discrepancy of S1 opposing the amendment and his stated beliefs but constantly bringing up arguments which are in opposition to those beliefs.", "Natural_Summary_Text_3": "S1 believes that what is happening is a redefining of the meanings behind family and marriage. Specifically, they believe that the definitions for both are being broadened. This person argues that to certain people, that is what matters and is why people oppose homosexual marriage. They point out that those who speak out against it believe that traditional families perform the best in terms of raising children and keeping them from becoming criminals. He or she argues that these people do not believe that single parent homes are bad, necessarily, but that a home with both a mother and a father are best. However, he or she personally agrees with the homosexual movement's opinions on the matter of homosexual marriage and that there should be efforts to stop discrimination and harassment.  S2 believes that people with opinions opposing homosexual marriage are getting their opinions from negative observations of single parenthood. They do not believe that S1 has been consistent in their arguments and that S1's opinions lean towards standing against homosexual rights rather than supporting them.", "Natural_Summary_Text_2": "S1 feels that marriage and family are being redefined, and that including gay marriage into the definition of traditional marriage affects traditional marriage in a negative manner. He expresses that he supports some of what Colson says and doesn't support some of the other stuff he says. He admits to accidentally miss-wording something, and refutes any \"game\" being involved. He feels that S2 is being hostile, and that S2's main reason for being there is to disagree with people and not to debate the topic at hand.    S2 feels that Colson has done very well for being a felon, but that he should stop drawing conclusions about gay parenthood based on observations of single parenthood. He thinks S1 does not actually support gay rights, but is purposely misrepresenting himself, and points to times that he said one thing and then voiced opposition to that same thing. He questions wether S1 might be getting paid to be there, and feels this is the least bad reason that S1 could have for the discrepancies in his views.", "Natural_Summary_Text_1": "S1 claims that legalizing same-sex marriage requires redefining family and marriage and that it would affect traditional marriage. He references a person named Colson who believes that same-sex households are deficient compared to heterosexual households in the same way that a single-parent household is deficient compared to a two-parent household. There is nothing inherently wrong with the deficient family systems, but they are not ideal. S1 notes that he does sometimes agree with gay rights supporters, for example, believing that the constitutional amendment banning same-sex marriage is a bad idea, that homosexuals do experience violence and harassment, and that homosexuals should not be discriminated against when it comes to adoption, housing, or employment.     S2 rejects the comparison of same-sex households to single-parent households by noting that there is not a constitutional amendment to ban single-parenthood. He claims that S1's inconsistent arguments in favor of and against same-sex marriage make it doubtful whether he actually does support gay rights, and he suggests that it is possible that S1 is being paid to post on the forum."}, "Key": "1-5672_18_7__22_24_25_29_30_33_1"}]