[{"contrib": [["He was then divorced"], ["then subsequent long term marriage and divorce"], ["lasted for twenty-six years before a divorce was ordered"], ["were married for 26 years", "until they divorced"], ["divorced his first wife wife"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 9, "weight": 5, "label": "Fred married for 26 years until he divorce."}, {"contrib": [["He states that Fred married his pregnant girlfriend at 18"], ["a politician who was married at 17"], ["S1 heaps opprobrium on Fred Thompson for having had a teenage pregnancy out of wedlock occur"], ["He talked about a \"Christian man\" who married young"], ["he got his eighteen year old girlfriend, Sarah Lindsey, pregnant which prompted an immediate marriage"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 8, "weight": 5, "label": "Fred married young."}, {"contrib": [["he married a woman who is younger than his oldest child"], ["remarried to a woman younger than his oldest child with whom he fathered two more children"], ["He's critical of Thompson for having a second wife and young children at the age of 65"], ["married a  woman younger than his oldest child", "at the age of 65 has two very young children"], ["Thompson had two more with a woman who was younger than his oldest child"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 10, "weight": 5, "label": "Fred remarried a young woman and had two more children at old age."}, {"contrib": [["he is not really a Christian"], ["James Dobson says this man is not a Christian"], ["S1 states that James Dobson does not believe Thompson to be a true Christian"], ["He notes James Dobson says Thompson is not really a christian"], ["He then states that James Dobson says Fred is not really a Christian"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 4, "weight": 5, "label": "James Dobson does not believe Fred to be a true Christian."}, {"contrib": [["politicians should be stoned in public as punishment for their deviant sexual behaviors"], ["S1 proposes that Vitter and Craig should be stoned to death along with Vitter's hooker and a gay partner of Craig's"], ["S1 expresses his wish that Vitter and Craig be stoned"], ["S1 suggested stoning Vitter, his hooker, Craig and the man he was with on the Capitol steps"], ["S1 believes that Vitter and Craig should be stones on the Capitol Steps as well as the people they slept with"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 1, "weight": 5, "label": "Politicians should be stoned in public as punishment for their deviant sexual behaviors."}, {"contrib": [["fathered three children with his first wife"], ["having multiple children"], ["After remarrying, S1 points out that in addition to three children from the previous marriage"], ["had  children"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 19, "weight": 4, "label": "Fred fathered three children with his first wife."}, {"contrib": [["Fred Thompson is a member of the Churches of Christ which is a religious cult"], ["claims to be a member of the Churches of Christ"], ["This man says he is a member of the Churches of Christ"], ["for being only vaguely christian through identification as a member of Churches of Christ"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 3, "weight": 4, "label": "Fred is a member of the Churches of Christ."}, {"contrib": [["S2 jokes that stoning could draw drug charges"], ["S2 jokes that if you stone someone in public you might be brought up on drug charges"], ["In regards to the stoning comment, S2 with humor said that those who did stone people on the Capitol steps could get arrested on drug charges"], ["this person believes that a stoning would result in the arrest of those who perpetrated it on drug charges"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 5, "weight": 4, "label": "Stoning could draw drug charges."}, {"contrib": [["He asked if Dobson thinks the man is pretending to be a Christian"], ["S2 questions if Dobson thinks the man is just acting"], ["wonders if people think Fred Thompson is simply pretending to be religious"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 16, "weight": 3, "label": "Dobson thinks the man is pretending to be a Christian."}, {"contrib": [["He then states a tale about a man named Fred Thompson"], ["He cites the story of Fred Thompson"], ["This person states a hypocrisy with Fred Thompson"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 6, "weight": 3, "label": "The tale is about a man named Fred Thompson."}, {"contrib": [["S1 and S2 discuss several prominent individuals with respect to their sex lives"], ["Two people are discussing the sanctity of Christian marriage"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 2, "weight": 2, "label": "Two people discuss several prominent individuals with respect to theri sex lives."}, {"contrib": [["he believes Dobson is mostly self serving"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 17, "weight": 1, "label": "Dobson is mostly self serving."}, {"contrib": [["S2 states maybe about himself, but on issues its hard to say"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 18, "weight": 1, "label": "It is hard to say on the issues."}, {"contrib": [["It is unclear why this is relevant"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 12, "weight": 1, "label": "It is unclear why this is relevant."}, {"contrib": [["S1 retorts, asking if Dobson thinks period"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 20, "weight": 1, "label": "One person asks it Dobson thinks so."}, {"contrib": [["S2 seems to partially agree with S1"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 11, "weight": 1, "label": "The partial agreement between two people."}, {"contrib": [["it is clear neither S1 nor S2 respects Dobson either"]], "key_user": "1-7185_224_223__225_226_228_229_3_userA.pyr", "id": 14, "weight": 1, "label": "The two people do not respect Dobson."}, {"contrib": [["S2 believes it is a legislative matter which should be left to voting"], ["If marriage is subject to change then he asks how it is supposed to be changed if not by vote"], ["This speaker believes that it should left up to a vote to decide the definition of marriage"], ["since we're in a democracy it must change by vote"], ["Also advising a key point to the nation is the basis of laws being voted upon"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 3, "weight": 5, "label": "It should left up to a vote to decide the definition of marriage."}, {"contrib": [["S1 believes fundamental rights are not subject to vote"], ["are not subject to a plebescite"], ["This speaker believes that \"fundamental rights\" are not subject to state votes"], ["should be a fundamental right for all not to be determined by each state individually"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 7, "weight": 4, "label": "Fundamental rights are not subject to vote."}, {"contrib": [["He takes issue with the judiciary becoming the legislative branch"], ["S2 accuses S1 of believing in an activist judiciary", "usurp the role of the legislature", "an example of judicial activism"], ["that legislature should not be confused with judiciary"], ["by allowing this the judiciary branch becomes the legislative branch, which is not so"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 9, "weight": 4, "label": "Legislature should not be confused with judiciary."}, {"contrib": [["Two people are discussing gay marriage laws"], ["Two people are debating gay marriage rights"], ["S1 and S2 discuss the United States Constitutional legal system", "whether and how same sex marriage can be banned"], ["The issue is here is the definition of marriage", "what government body/level has the right to change this definition"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 11, "weight": 4, "label": "Two people are discussing gay marriage laws."}, {"contrib": [["cites Loving v. Virginia as an example"], ["S1 sites Loving v. Virginia in argument marriage is not a human construct"], ["cites several previous cases in the past"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 8, "weight": 3, "label": "Loving v. Virginia is used as an example."}, {"contrib": [["S1 believes the concept of marriage has evolved dramatically over time"], ["S1 thinks the definition of marriage is subject to change"], ["it can be changed to meet changing times"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 1, "weight": 3, "label": "The concept of marriage has changed over time."}, {"contrib": [["S1 feels the constitution can evolve with changing times"], ["can change"], ["evolving Constitutional standards"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 16, "weight": 3, "label": "The Constitution can change."}, {"contrib": [["He believes the courts are an intermediate body between the people and legislature;"], ["S1 states that the courts were designed to be an intermediate between people and legislature"], ["the federal government stepped up to introduce legislature"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 21, "weight": 3, "label": "The courts are an intermediate body between the people and legislature."}, {"contrib": [["contends that the legal definition is human made"], ["it is a man-made construct"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 17, "weight": 2, "label": "Legal definition is human made."}, {"contrib": [["can now be declared by the Supreme Court to be a fundamental right not to be denied to same sex couples"], ["S1 also advises marriage is a fundamental right"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 2, "weight": 2, "label": "The Supreme Court can declare marriage to be a fundamental right that not to be denied to same sex couples."}, {"contrib": [["thus to ban gay marriage one must prove it isn't a right or give compelling evidence against it"], ["if same gender marriage can be banned by state action it must be proven that marriage is not a fundamental right"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 22, "weight": 2, "label": "To ban gay marriage, one must prove it isn't a right with compelling evidence."}, {"contrib": [["so far votes favor a \"one man one woman\" definition of marriage"], ["S2 cites the fact 26 states still consider the sanctity of marriage to be one man and one woman"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 13, "weight": 2, "label": "Votes favor a \"one man one woman\" definition of marriage."}, {"contrib": [["questions what \"fundamental rights\" have to do with the \"definition\" of marriage"], ["S2 wonders what marriage being a fundamental right has to do with defining marriage"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 10, "weight": 2, "label": "What \"fundamental rights\" have to do with the \"definition\" of marriage?"}, {"contrib": [["As an example S1 points to an old definition of marriage in which a woman lost her identity into that of a man"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 5, "weight": 1, "label": "An example for old definition of marriage is a woman lost her identity into that of a man."}, {"contrib": [["courts and federal government should be able to rule on the definition of marriage", "can be decided by government"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 24, "weight": 1, "label": "Courts and federal government should decide the definition of marriage."}, {"contrib": [["Speaker two believes that each state should decide the definition of marriage"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 23, "weight": 1, "label": "Each state should decide the definition of marriage."}, {"contrib": [["S2 also criticizes Loving v. Virginia as incorrect in reasoning"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 20, "weight": 1, "label": "Loving v. Virginia is incorrect in reasoning."}, {"contrib": [["S1 is pro gay marriage"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 14, "weight": 1, "label": "One person is pro gay marriage."}, {"contrib": [["S2 does not feel S1's statements are correct regarding whether or not marriage is a right"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 25, "weight": 1, "label": "Statements are incorrect regarding whether or not marriage is a right."}, {"contrib": [["S1 argues that fundamental rights are protected by the Constitution"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 4, "weight": 1, "label": "The Constitution protects fundamental rights."}, {"contrib": [["S2 appears against"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 15, "weight": 1, "label": "The other person is against gay marriage."}, {"contrib": [["the traditional definition of marriage is human made"]], "key_user": "1-7858_135_133__137_142_144_148_1_userA.pyr", "id": 12, "weight": 1, "label": "The traditional definition of marriage is human made."}, {"contrib": [["same sex marriage is not the same essential component to people's general welfare that one man and one woman is"], ["same-sex marriage is not the same essential component of society that opposite-sex marriage is"], ["S2 believes whether or not gay marriage impacts the public's view of marriage"], ["gay marriage is not an essential component to the welfare of society"], ["it doesn't matter if anyone is harmed by gay marriage it is different than the basic structure"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 1, "weight": 5, "label": "Gay marriage is not the same essential component as heterosexual marriage to the welfare of society."}, {"contrib": [["society can survive without homosexual unions, polygamy and bestiality"], ["suggesting that society can function without same-sex marriage"], ["it can without gay marriage"], ["society could survive without it"], ["our society can survive without homosexual unions, polygamy and bestiality;"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 2, "weight": 5, "label": "Society can survive without homosexual marriage."}, {"contrib": [["it would not survive long without heterosexual marriage"], ["but not without opposite-sex marriage, presumably due to the reproductive element involved"], ["society could not survive without heterosexual marriage"], ["society could not survive as a whole without heterosexual unions"], ["without heterosexual marriage society would not survive long at all"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 3, "weight": 5, "label": "Society could not survive without heterosexual marriage."}, {"contrib": [["S2 argues that society could survive without many of the rights it has"], ["S1 is correct that society could function without giving minorities the same rights as majority"], ["S2 retorts that this is not an argument, as society could survive without giving many minorities the same rights as the majority"], ["rebutting the idea that society could also survive without allowing many minorities the same rights as the majority"], ["the argument of society's survival is a way of saying it's alright to exclude a minority group from what is to be considered the social norm as homosexuals have been"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 10, "weight": 5, "label": "Society could survive without giving minorities the same rights as majority."}, {"contrib": [["government has the right to impose a legal distinction somewhere"], ["the argument to be whether the government has the right to decide which types of marriages it will recognize"], ["most people agree the government has a right to draw a line where marriage is concerned as in polygamy, incest, statutory"], ["the people through government has the right to draw the line on what is recognized as marriage"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 5, "weight": 4, "label": "The government has the right to decide what is recognized as marriage."}, {"contrib": [["the real issue is where to draw the lines on marriage laws", "S2 agrees the issue is where to draw the line"], ["suggesting that the debate is just about where the line is drawn"], ["more of where the line should be drawn"], ["the disagreement is to where that line is"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 9, "weight": 4, "label": "The real issue is where to draw the line on marriage laws."}, {"contrib": [["S1 believes S2's statements exclude gay couples from the term marriage"], ["there isn't one for gay marriage"], ["S2 states that the real issue at hand is banning gay marriage"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 14, "weight": 3, "label": "Gay marriage is being excluded."}, {"contrib": [["homosexual couples and families all have the same basic needs, responsibilities to one another and society as heterosexual people do"], ["same-sex and opposite-sex families have the same needs and responsibilities within society"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 6, "weight": 2, "label": "Homosexual and heterosexual families have the same needs and responsiblities within society."}, {"contrib": [["that argument is really a way of discriminating against minorities, therefore it isn't an argument"], ["so it could be said the only valid argument is not that of inequality"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 13, "weight": 2, "label": "The argument discriminates against minorities."}, {"contrib": [["this is amoral, and that there is no good reason to deny people the right of same-sex marriage"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 8, "weight": 1, "label": "It is amoral to deny people the right of gay marriage without good reason."}, {"contrib": [["S2 is simply disagreeing on where the legal line should be drawn for marriage"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 4, "weight": 1, "label": "One persion disagrees on where the legal line should be drawn for marriage."}, {"contrib": [["you need reasons the line should be there"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 15, "weight": 1, "label": "The line on marriage laws needs reasons."}, {"contrib": [["Two people are discussing the importance of gay marriage to society"]], "key_user": "1-9331_28_26__31_38_39_40_3_userA.pyr", "id": 11, "weight": 1, "label": "Two people are discussing the importance of gay marriage to society."}, {"contrib": [["what behavior can be disapproved of if the person does his/her job correctly"], ["what behavior that he is exhibiting that warrants disapproval"], ["gay activist will soon find out why the behavior and thoughts are what they are"], ["not just disapproval"], ["questioning which behaviors warrant disapproval"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 13, "weight": 5, "label": "No behavior should be disapproved."}, {"contrib": [["the other is just disapproval of another person's behavior"], ["opposing homosexuality is based on disapproval of a person's behavior"], ["disapproval of gay relationships is due to not agreeing with another's behavior"], ["the other is a disapproval of someone's behavior"], ["the public's overwhelming disapproval of another human being's behavior"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 3, "weight": 5, "label": "Opposing homosexuality is based on disapproval of a person's behavior."}, {"contrib": [["They believe that employers base their employment on competency and not sexuality"], ["if a homosexual were fired from their job, it would be due to their incompetence and not due to their homosexuality"], ["if a homosexual was fired, it would be for incompetence rather than for being gay"], ["if you were fired it would be for being incompetent rather than being gay"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 5, "weight": 4, "label": "Employers fire people based on competency rather than being gay."}, {"contrib": [["it is within the rights under current states' laws for employers to let their workers go because of one's sexuality", "the law supports the right for employers to release employees solely on the fact that they are homosexual and not due to competency"], ["homosexuals are frequently legally fired for their sexual preference with no regard for competence"], ["it is currently legal to fire someone simply for being gay rather than their ability to complete the job correctly"], ["it is perfectly legal in most places in the U.S. to fire someone simply for being gay, not for incompetence"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 7, "weight": 4, "label": "Employers frequently fire people based on their sexual preference rather than competency."}, {"contrib": [["This person does not agree that this is a viable comparison"], ["it is inappropriate to compare opposing homosexuality with racial discrimination"], ["there is no comparison between racial discrimination and disapproval of homosexual relationships"], ["it is wrong for gay activists to compare public disapproval of homosexuality with race discrimination", "the two are two different entities and can't truly be compared"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 4, "weight": 4, "label": "It is inappropriate to compare opposing homosexuality with racial discrimination."}, {"contrib": [["they believe that racial discrimination is the hatred or fear of another human being"], ["racial discrimination is the fear of a particular person"], ["discrimination is defined as a hatred or fear of another person or group"], ["one is a hatred or fear of another human being"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 2, "weight": 4, "label": "Racial discrimination is the hatred or fear of a particular person."}, {"contrib": [["S2 does not agree that being homosexual is a behavior"], ["S2 objects to S1's claim that homophobia is disapproval of behavior", "He claims that being homosexual is in itself not a behavior"], ["S2 doesn't feel being gay can be described as a behavior"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 6, "weight": 3, "label": "Being homosexual is not a behavior."}, {"contrib": [["gay activists compare public disapproval of homosexuality with racial discrimination"], ["gay activists love comparing public disapproval of homosexuality with racial discrimination"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 1, "weight": 2, "label": "Gay activists compare public disapproval of homosexuality with racial discrimination."}, {"contrib": [["They believe this is discrimination"], ["feels this is discrimination"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 8, "weight": 2, "label": "This is discrimination."}, {"contrib": [["Two subjects are discussing discrimination against homosexuals in the workplace"], ["Two people are discussing the difference between homosexuality and racial discrimination"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 11, "weight": 2, "label": "Two subjects are discussing discrimination against homosexuals in the workplace."}, {"contrib": [["he asks what a gay activist is"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 16, "weight": 1, "label": "One person asks what a gay activist is."}, {"contrib": [["He also states that he is currently sitting in his pajamas being gay"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 18, "weight": 1, "label": "One person is currently sitting in his pajamas being gay."}, {"contrib": [["The both argue that each one's wrong"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 15, "weight": 1, "label": "The both argue that each one's wrong."}, {"contrib": [["He thinks that the questions that the GUEST is asking are not relevant enough to answer them"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 14, "weight": 1, "label": "The questions are not relevant enough to answer."}, {"contrib": [["S1 responds by recommending S2 google the term"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 17, "weight": 1, "label": "The responds recommend to google the terms."}, {"contrib": [["S1 feels there is no issue with this practice"]], "key_user": "1-9390_2_1__3_6_7_8_10_1_userA.pyr", "id": 12, "weight": 1, "label": "There is not issue with the practice."}]